{
     "pub_num": "sb5b00001",
     "is_research": false,
     "keywords": [],
     "abstract": [],
     "body": [
          {
               "normalized_section_header": [],
               "section_header": null,
               "text": [
                    "This issue of ACS Synthetic Biology contains articles that were originally submitted as part of the inaugural Synthetic Biology: Engineering, Evolution, and Design (SEED) conference, held July, 2014, in Manhattan Beach, CA.",
                    "SEED is an annual technical conference dedicated to the broad set of technologies that make up the discipline of Synthetic Biology.",
                    "SEED will be a regularly held meeting, the next iteration of which will be held in Boston in the summer of 2015."
               ],
               "type": "paragraph",
               "num_sentences": 3,
               "local_span_start": 0,
               "local_span_end": 468,
               "global_span_start": 0,
               "global_span_end": 468
          },
          {
               "normalized_section_header": [],
               "section_header": null,
               "text": [
                    "The original idea for SEED arose from conversations among a small group of researchers shortly after the SB 6.0 conference in London.",
                    "The group, which included the authors along with Frances Arnold, Jim Collins, Martin Fussenegger, Ryan Gill, Jeff Hasty, and Pam Silver, felt that the time was right for an annual technical conference that focused on synthetic biology and its emerging applications and brought to light new advances from both inside and outside the field."
               ],
               "type": "paragraph",
               "num_sentences": 2,
               "local_span_start": 0,
               "local_span_end": 472,
               "global_span_start": 468,
               "global_span_end": 940
          },
          {
               "normalized_section_header": [],
               "section_header": null,
               "text": [
                    "One of the goals of the SEED conference is to bring together a broad set of researchers from both academia and industry and from different technical communities that are working on various technologies and aspects of synthetic biology.",
                    "Thus, the technical areas represented in SEED span circuit design, metabolic engineering, molecular programming, automation and instrumentation, DNA synthesis, and fermentation; and the applications range from agriculture to materials to therapeutics to diagnostics.",
                    "The inaugural conference succeeded in bringing together an outstanding collection of researchers from academia, industry, and government, many of whom had never had the opportunity to interact with each other."
               ],
               "type": "paragraph",
               "num_sentences": 3,
               "local_span_start": 0,
               "local_span_end": 712,
               "global_span_start": 940,
               "global_span_end": 1652
          },
          {
               "normalized_section_header": [],
               "section_header": null,
               "text": [
                    "Another important feature of SEED is that talks are based on a mixture of invited talks and contributed talks, with the latter chosen based on submission of either abstracts or full technical papers.",
                    "By allowing a large number of contributed talks, SEED allows new speakers and new results to be heard.",
                    "This provides an important mechanism for both young researchers and those in other fields to present their work, in addition to established leaders in the field.",
                    "A key element in choosing SEED speakers is to hear about new results that have not yet been published.",
                    "Combined with the selection of a small number of keynote speakers, this approach enables SEED to provide a venue for the latest exciting results in the field to be shared with the community.",
                    "For those that would like to speak at the 2015 meeting, we encourage you to submit an abstract or paper for review."
               ],
               "type": "paragraph",
               "num_sentences": 6,
               "local_span_start": 0,
               "local_span_end": 874,
               "global_span_start": 1652,
               "global_span_end": 2526
          },
          {
               "normalized_section_header": [],
               "section_header": null,
               "text": [
                    "The idea of choosing talks based on contributed abstracts and papers also moves SEED in the direction of engineering conferences in many other disciplines, where it is not uncommon to submit full papers that are peer-reviewed and selected for presentation at the conference (and publication in the proceedings) based on those reviews.",
                    "Since much of the synthetic biology community publishes in scientific journals that do not allow prior publication of results in peer-reviewed conference proceedings, a hybrid model was adopted in which authors could submit either abstracts or full papers.",
                    "For those submitting full papers, ACS Synthetic Biology handles the reviews and eventually publishes the papers that result.",
                    "It is these papers that serve as the contents of this special issue."
               ],
               "type": "paragraph",
               "num_sentences": 4,
               "local_span_start": 0,
               "local_span_end": 785,
               "global_span_start": 2526,
               "global_span_end": 3311
          },
          {
               "normalized_section_header": [],
               "section_header": null,
               "text": [
                    "The SEED conference is also the venue for announcing the winner of the newly established ACS Synthetic Biology Young Investigator Award.",
                    "This award recognizes outstanding contributions to the field by a researcher who is within 10 years for their first independent appointment and who has performed exemplary research in synthetic biology.",
                    "The first winner of the ACS Synthetic Biology Young Investigator Award was Peng Yin from Harvard University, for his work in molecular programming with DNA and RNA."
               ],
               "type": "paragraph",
               "num_sentences": 3,
               "local_span_start": 0,
               "local_span_end": 504,
               "global_span_start": 3311,
               "global_span_end": 3815
          },
          {
               "normalized_section_header": [],
               "section_header": null,
               "text": [
                    "Going forward, we hope that SEED can serve as one of the key meetings that synthetic biology researchers and practitioners view as a key opportunity for finding out about the latest results and technologies impacting the field, catching up with their colleagues from around the world, learning about new companies and products being launched, and meeting the students and postdocs who are driving the newest results in the field.",
                    "We hope that this special issue of ACS Synthetic Biology will help highlight some of the outstanding work that was presented at SEED and encourage even more submissions for SEED 2015.",
                    "(SEED 2015 will be held in Boston June 10–13, 2015.",
                    "See www.synbioconference.org for details.)"
               ],
               "type": "paragraph",
               "num_sentences": 4,
               "local_span_start": 0,
               "local_span_end": 708,
               "global_span_start": 3815,
               "global_span_end": 4523
          },
          {
               "normalized_section_header": [],
               "section_header": null,
               "text": [
                    "Finally, we thank ACS Synthetic Biology, the Society for Biological Engineers (SBE), and the many industry and government sponsors of SEED 2014 for their support and encouragement."
               ],
               "type": "paragraph",
               "num_sentences": 1,
               "local_span_start": 0,
               "local_span_end": 180,
               "global_span_start": 4523,
               "global_span_end": 4703
          }
     ],
     "issue_pub_date": "01/16/2015",
     "electron_pub_date": "01/16/2015",
     "article_id": "10.1021/acssynbio.5b00001",
     "internal_id": "c746067390",
     "history": [
          {
               "event": "received",
               "time": "01/02/2015"
          }
     ],
     "type": "Editorial",
     "article_title": "Editorial for SEED 2014 Special Issue",
     "suppl_files": [],
     "topic_modeling": [
          [
               0.34567901234567905,
               "gene expression"
          ],
          [
               0.10789049919484703,
               "biosensors"
          ],
          [
               0.3332566520972319,
               "metabolic engineering"
          ],
          [
               0.16455793267387472,
               "genetic circuit design"
          ],
          [
               0.04861590368836746,
               "strain construction"
          ]
     ]
}