{
    "pub_num": "sb6b00010",
    "is_research": true,
    "keywords": [
        "uncoupling",
        "cell-free",
        "ribosomes",
        "transcription",
        "translation"
    ],
    "abstract": [
        {
            "text": "Secondary structure formation of mRNA, caused by desynchronization of transcription and translation, is known to impact gene expression in vivo. Yet, inactivation of mRNA by secondary structures in cell-free protein expression is frequently overlooked. Transcription and translation rates are often not highly synchronized in cell-free expression systems, leading to a temporal mismatch between the processes and a drop in efficiency of protein production. By devising a cell-free gene expression platform in which transcriptional and translational elongation are successfully performed independently, we determine that sequence-dependent mRNA secondary structures are the main cause of mRNA inactivation in in vitro gene expression.",
            "ner_annotations": {}
        }
    ],
    "body": [
        {
            "text": "Prokaryotic cells have evolved to efficiently synchronize transcription and translation rates for optimal gene expression. In Escherichia coli (E. coli), RNA polymerase (RNAP) synthesizes RNA with a speed of about 60 nucleotides per second (nt s –1). A ribosome, which translates the nascent mRNA chain, will incorporate about 20 amino acids s –1 (i.e., reading mRNA at 60 nt s –1). Since the first ribosome will initiate translation approximately immediately after the RNA polymerase, there is a tight coupling between transcription and translation. This first ribosome is followed rapidly by other ribosomes with a spacing as small as 22 nm. To retain the tight synchronization between transcription and translation, the RNA polymerase pauses during transcription, allowing the leading ribosome to draw level with the RNA polymerase. This synchronization of transcription and translation ensures that the amount of naked mRNA is minimized and prevents the depletion of resources. Numerous in vivo studies have shown that a temporal mismatch between these two reactions in prokaryotic cells, usually by increasing the transcription rate, can have lethal consequences. Furthermore, it was recently found that the translational initiation rate in vivo is determined by the amount of accessible, single-stranded, mRNA. Cell-free protein expression is a unique platform for mechanistic studies involving the flow of genetic information from DNA to protein, and provides the basis for the nascent field of cell-free synthetic biology. The success of using cell-free systems for the design of complex synthetic gene circuits will, in part, depend on the ability to predict protein production rates. The efficiency of in vitro protein synthesis, based on prokaryotic expression systems, is also governed by the fine balance between transcription and translation rates. However, the tight coupling observed in vivo will be much more relaxed in in vitro systems, and in this study we wish to explore the consequence of (partial) decoupling. Since the term uncoupled gene expression can be broadly interpreted, we will distinguish between two distinct types of uncoupling. The first, the temporal mismatch between transcription and translation caused by an augmented transcriptional rate, will be called desynchronization. The second, the complete uncoupling of transcription from translation, meaning performing both reactions independently and sequentially, will be called uncoupling. Our approach is to study how and why uncoupling influences protein production rates and yields.",
            "normalized_section_header": [],
            "section_header": null,
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "RNA polymerase",
                    "appearance_count": 4,
                    "ner_instance_array": [
                        {
                            "instance_id": "T1",
                            "entity_type": "Gene",
                            "global_span_start": 154,
                            "global_span_end": 168,
                            "local_span_start": 154,
                            "local_span_end": 168
                        },
                        {
                            "instance_id": "T3",
                            "entity_type": "Gene",
                            "global_span_start": 471,
                            "global_span_end": 485,
                            "local_span_start": 471,
                            "local_span_end": 485
                        },
                        {
                            "instance_id": "T4",
                            "entity_type": "Gene",
                            "global_span_start": 724,
                            "global_span_end": 738,
                            "local_span_start": 724,
                            "local_span_end": 738
                        },
                        {
                            "instance_id": "T5",
                            "entity_type": "Gene",
                            "global_span_start": 821,
                            "global_span_end": 835,
                            "local_span_start": 821,
                            "local_span_end": 835
                        }
                    ]
                },
                {
                    "ner_mention": "RNAP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T2",
                            "entity_type": "Gene",
                            "global_span_start": 170,
                            "global_span_end": 174,
                            "local_span_start": 170,
                            "local_span_end": 174
                        }
                    ]
                }
            ]
        },
        {
            "text": "Cell-free protein production systems typically use T7 RNAP to achieve high protein production rates and yields. However, the high transcription rate of T7 RNAP causes desynchronization of transcription and translation, whereas endogenous E. coli RNAP provides the required synchronization of transcription and translation rates, and this can result in more efficient expression systems. Because T7 RNAP remains a dominant polymerase used in cell-free protein expression, we decided to investigate the resulting degrees of desynchronization and uncoupling using this polymerase. In vitro transcription has been studied using multiple approaches. Yet, uncoupled translation in a prokaryotic system is very inefficient and requires much higher concentrations of mRNA than DNA, as only a small fraction of transcripts are being actively translated. The mRNA is therefore thought to be inactivated in an uncoupled system. This inactivation can be in the form of RNA degradation, secondary structures of mRNA, and R-Loops between mRNA and DNA. Polysome analysis revealed a 3-fold slower initiation on free mRNA than on polysomes, and the authors hinted at mRNA folding as the cause. Recently, a study that modeled in vitro transcription and translation introduced an active ratio of mRNA to fit the experimental data. Therefore, determining the relationship between the amount of DNA, and the concentrations of mRNA and proteins produced, is of great importance.",
            "normalized_section_header": [],
            "section_header": null,
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "RNAP",
                    "appearance_count": 4,
                    "ner_instance_array": [
                        {
                            "instance_id": "T6",
                            "entity_type": "Gene",
                            "global_span_start": 2629,
                            "global_span_end": 2633,
                            "local_span_start": 55,
                            "local_span_end": 59
                        },
                        {
                            "instance_id": "T7",
                            "entity_type": "Gene",
                            "global_span_start": 2730,
                            "global_span_end": 2734,
                            "local_span_start": 156,
                            "local_span_end": 160
                        },
                        {
                            "instance_id": "T8",
                            "entity_type": "Gene",
                            "global_span_start": 2821,
                            "global_span_end": 2825,
                            "local_span_start": 247,
                            "local_span_end": 251
                        },
                        {
                            "instance_id": "T9",
                            "entity_type": "Gene",
                            "global_span_start": 2973,
                            "global_span_end": 2977,
                            "local_span_start": 399,
                            "local_span_end": 403
                        }
                    ]
                },
                {
                    "ner_mention": "polymerase",
                    "appearance_count": 2,
                    "ner_instance_array": [
                        {
                            "instance_id": "T10",
                            "entity_type": "Gene",
                            "global_span_start": 2997,
                            "global_span_end": 3007,
                            "local_span_start": 423,
                            "local_span_end": 433
                        },
                        {
                            "instance_id": "T11",
                            "entity_type": "Gene",
                            "global_span_start": 3141,
                            "global_span_end": 3151,
                            "local_span_start": 567,
                            "local_span_end": 577
                        }
                    ]
                }
            ]
        },
        {
            "text": "Results and Discussion",
            "normalized_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "title"
        },
        {
            "text": "We first compared the in vitro transcription and translation (IVTT) curves of a fully coupled system, a semicoupled system, and a completely uncoupled system. Figure shows a schematic representation of these three systems. The fully coupled IVTT system (Figure A) consists of a typical cell-free gene expression reaction in the presence of all components, including E. coli based cell extract, T7 RNAP, and plasmid DNA, added from the start. The semicoupled system (Figure B) is the same as the fully coupled system except for the addition of DNase after 20 min, thereby splitting gene expression into two steps. During the first step, both transcription and translation can take place, and during the second step, only translation occurs. In the uncoupled system (Figure C), only DNA and T7 RNA polymerase are present in the first 20 min (using the same buffer composition). Subsequently, DNase is added to degrade the plasmid. After a 10 min incubation period, the cell lysate is added to initiate translation and protein production is followed over time. As a result, transcription should only occur in the first 20 min and translation only in the remaining time. This allows transcription and translation to occur sequentially thereby completely uncoupling transcription from translation. The protein expressed was enhanced green fluorescent protein (eGFP).",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "RNAP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T12",
                            "entity_type": "Gene",
                            "global_span_start": 4452,
                            "global_span_end": 4456,
                            "local_span_start": 398,
                            "local_span_end": 402
                        }
                    ]
                },
                {
                    "ner_mention": "DNase",
                    "appearance_count": 2,
                    "ner_instance_array": [
                        {
                            "instance_id": "T13",
                            "entity_type": "Gene",
                            "global_span_start": 4598,
                            "global_span_end": 4603,
                            "local_span_start": 544,
                            "local_span_end": 549
                        },
                        {
                            "instance_id": "T15",
                            "entity_type": "Gene",
                            "global_span_start": 4945,
                            "global_span_end": 4950,
                            "local_span_start": 891,
                            "local_span_end": 896
                        }
                    ]
                },
                {
                    "ner_mention": "RNA polymerase",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T14",
                            "entity_type": "Gene",
                            "global_span_start": 4847,
                            "global_span_end": 4861,
                            "local_span_start": 793,
                            "local_span_end": 807
                        }
                    ]
                },
                {
                    "ner_mention": "enhanced green fluorescent protein",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T16",
                            "entity_type": "Gene",
                            "global_span_start": 5374,
                            "global_span_end": 5408,
                            "local_span_start": 1320,
                            "local_span_end": 1354
                        }
                    ]
                },
                {
                    "ner_mention": "eGFP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T17",
                            "entity_type": "Gene",
                            "global_span_start": 5410,
                            "global_span_end": 5414,
                            "local_span_start": 1356,
                            "local_span_end": 1360
                        }
                    ]
                }
            ]
        },
        {
            "text": "Schematic of three systems compared. (A) Typical coupled transcription and translation. (B) Semicoupled transcription and translation. Lysate is present from the start. Therefore, in the first 20 min of reaction, coupled transcription and translation occurs, the DNase is then added to degrade the plasmid. In the subsequent 130 min, only translation can take place. (C) Uncoupled transcription and translation. In vitro transcription occurs for approximately 20 min. Subsequently, DNase is added to degrade the plasmid DNA. After a 10 min incubation period, the lysate is added to initiate translation and protein production is followed over time. As a result, transcription only occurs in the first 20 min and translation only in the remaining time. (D) mRNA expression of eGFP with addition of DNase (blue triangles) and without (red circles) the addition of DNase. The orange line indicates the addition of DNase, and the shaded region indicates the 10 min incubation period. (E) Semicoupled system, checking the effect of DNase on eGFP expression. (F) Protein expression (eGFP) curves for coupled (red full line) and uncoupled (black dashed line) gene expression. In panels D–F, the orange band indicates the addition of DNase. The lines indicate mean protein concentrations from three separate experiments with standard deviations shown by the shaded areas.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "DNase",
                    "appearance_count": 6,
                    "ner_instance_array": [
                        {
                            "instance_id": "T18",
                            "entity_type": "Gene",
                            "global_span_start": 5679,
                            "global_span_end": 5684,
                            "local_span_start": 263,
                            "local_span_end": 268
                        },
                        {
                            "instance_id": "T19",
                            "entity_type": "Gene",
                            "global_span_start": 5898,
                            "global_span_end": 5903,
                            "local_span_start": 482,
                            "local_span_end": 487
                        },
                        {
                            "instance_id": "T21",
                            "entity_type": "Gene",
                            "global_span_start": 6213,
                            "global_span_end": 6218,
                            "local_span_start": 797,
                            "local_span_end": 802
                        },
                        {
                            "instance_id": "T22",
                            "entity_type": "Gene",
                            "global_span_start": 6278,
                            "global_span_end": 6283,
                            "local_span_start": 862,
                            "local_span_end": 867
                        },
                        {
                            "instance_id": "T23",
                            "entity_type": "Gene",
                            "global_span_start": 6443,
                            "global_span_end": 6448,
                            "local_span_start": 1027,
                            "local_span_end": 1032
                        },
                        {
                            "instance_id": "T25",
                            "entity_type": "Gene",
                            "global_span_start": 6642,
                            "global_span_end": 6647,
                            "local_span_start": 1226,
                            "local_span_end": 1231
                        }
                    ]
                },
                {
                    "ner_mention": "eGFP",
                    "appearance_count": 2,
                    "ner_instance_array": [
                        {
                            "instance_id": "T20",
                            "entity_type": "Gene",
                            "global_span_start": 6191,
                            "global_span_end": 6195,
                            "local_span_start": 775,
                            "local_span_end": 779
                        },
                        {
                            "instance_id": "T24",
                            "entity_type": "Gene",
                            "global_span_start": 6452,
                            "global_span_end": 6456,
                            "local_span_start": 1036,
                            "local_span_end": 1040
                        }
                    ]
                }
            ]
        },
        {
            "text": "To verify that the addition of DNase would inhibit mRNA production, mRNA was expressed in an in vitro transcription system (IVT). Transcription was observed using a molecular beacon, which is a hairpin shaped molecular probe that linearizes by hybridizing to the specific mRNA sequence resulting in a fluorescent signal. The specific mRNA sequence was a 4 times repeat unit cloned behind the gene encoding for eGFP (Figure S1). Figure D shows the mRNA production over time. The mRNA expression in a normal IVT reaction (red circles) continues to increase, whereas, after a 10 min incubation period with DNase, the mRNA production curve plateaus (blue triangles). The plateau of mRNA production shows that we have no significant mRNA degradation during transcription. We also verified that the addition of DNase digested enough plasmid to prevent protein expression (Figure S2).",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "eGFP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T26",
                            "entity_type": "Gene",
                            "global_span_start": 7190,
                            "global_span_end": 7194,
                            "local_span_start": 410,
                            "local_span_end": 414
                        }
                    ]
                },
                {
                    "ner_mention": "DNase",
                    "appearance_count": 2,
                    "ner_instance_array": [
                        {
                            "instance_id": "T27",
                            "entity_type": "Gene",
                            "global_span_start": 7383,
                            "global_span_end": 7388,
                            "local_span_start": 603,
                            "local_span_end": 608
                        },
                        {
                            "instance_id": "T28",
                            "entity_type": "Gene",
                            "global_span_start": 7585,
                            "global_span_end": 7590,
                            "local_span_start": 805,
                            "local_span_end": 810
                        }
                    ]
                }
            ]
        },
        {
            "text": "As shown in Figure E,F (red full line), a fully coupled transcription and translation system yielded protein concentrations of approximately 0.55 μM. As a control, we performed semicoupled gene expression and compared the yields to the fully coupled system (Figure E, blue dashed line). This control was to verify that the addition of DNase after 20 min did not interfere with the translational machinery. The semicoupled system showed comparable yields to the normal coupled IVTT reaction. Surprisingly, when transcription was fully uncoupled from translation (Figure F, black dashed line; Figure S3), no protein expression was observed. Since enough mRNA was produced during the first 20 min of transcription to generate yields comparable to the coupled transcription/translation reaction, the unsuccessful translation must be a result of uncoupling gene expression.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "dashed",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T29",
                            "entity_type": "Species",
                            "global_span_start": 7930,
                            "global_span_end": 7936,
                            "local_span_start": 272,
                            "local_span_end": 278
                        }
                    ]
                },
                {
                    "ner_mention": "DNase",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T30",
                            "entity_type": "Gene",
                            "global_span_start": 7992,
                            "global_span_end": 7997,
                            "local_span_start": 334,
                            "local_span_end": 339
                        }
                    ]
                }
            ]
        },
        {
            "text": "Next, we performed the same experiments for yellow and cyan fluorescent protein (YFP and CFP, respectively). Figure A,B shows the expression curves of semicoupled transcription/translation (dashed blue line) in comparison to coupled protein expression (full red line). Again, these expression curves indicate that the mRNA concentrations produced during the first 20 min of transcription are enough to yield the same amount of protein as in the coupled system. eGFP has been especially designed to yield a higher fraction of correctly folded, fully matured and fluorescent protein; therefore it is not surprising that CFP and YFP show lower overall yields of expression compared with eGFP. However, in contrast to eGFP, both CFP and YFP show slightly higher yields in the uncoupled IVTT reaction, 21% and 29%, respectively (Figure C,D), which gives rise to some speculation. Translational initiation is often the rate limiting step in prokaryotic gene expression. This is governed by a combination of factors including the sequences surrounding the ribosomal binding site (RBS).",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "yellow and cyan fluorescent protein",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T31",
                            "entity_type": "Gene",
                            "global_span_start": 8570,
                            "global_span_end": 8605,
                            "local_span_start": 43,
                            "local_span_end": 78
                        }
                    ]
                },
                {
                    "ner_mention": "YFP",
                    "appearance_count": 2,
                    "ner_instance_array": [
                        {
                            "instance_id": "T32",
                            "entity_type": "Gene",
                            "global_span_start": 8607,
                            "global_span_end": 8610,
                            "local_span_start": 80,
                            "local_span_end": 83
                        },
                        {
                            "instance_id": "T36",
                            "entity_type": "Gene",
                            "global_span_start": 9152,
                            "global_span_end": 9155,
                            "local_span_start": 625,
                            "local_span_end": 628
                        }
                    ]
                },
                {
                    "ner_mention": "CFP",
                    "appearance_count": 3,
                    "ner_instance_array": [
                        {
                            "instance_id": "T33",
                            "entity_type": "Gene",
                            "global_span_start": 8615,
                            "global_span_end": 8618,
                            "local_span_start": 88,
                            "local_span_end": 91
                        },
                        {
                            "instance_id": "T35",
                            "entity_type": "Gene",
                            "global_span_start": 9144,
                            "global_span_end": 9147,
                            "local_span_start": 617,
                            "local_span_end": 620
                        },
                        {
                            "instance_id": "T39",
                            "entity_type": "Gene",
                            "global_span_start": 9251,
                            "global_span_end": 9254,
                            "local_span_start": 724,
                            "local_span_end": 727
                        }
                    ]
                },
                {
                    "ner_mention": "eGFP",
                    "appearance_count": 3,
                    "ner_instance_array": [
                        {
                            "instance_id": "T34",
                            "entity_type": "Gene",
                            "global_span_start": 8987,
                            "global_span_end": 8991,
                            "local_span_start": 460,
                            "local_span_end": 464
                        },
                        {
                            "instance_id": "T37",
                            "entity_type": "Gene",
                            "global_span_start": 9210,
                            "global_span_end": 9214,
                            "local_span_start": 683,
                            "local_span_end": 687
                        },
                        {
                            "instance_id": "T38",
                            "entity_type": "Gene",
                            "global_span_start": 9240,
                            "global_span_end": 9244,
                            "local_span_start": 713,
                            "local_span_end": 717
                        }
                    ]
                }
            ]
        },
        {
            "text": "(A,B) Semicoupled system, effect of DNase on total yield of protein expression for (A) YFP and (B) CFP. (C,D) Coupled (red full line) and uncoupled (black dashed line) in vitro transcription and translation for (C) YFP and (D) CFP. The orange band in each panel indicates the addition of DNase. The lines indicate mean protein concentrations from three separate experiments with standard deviations shown by the shaded areas.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "DNase",
                    "appearance_count": 2,
                    "ner_instance_array": [
                        {
                            "instance_id": "T40",
                            "entity_type": "Gene",
                            "global_span_start": 9640,
                            "global_span_end": 9645,
                            "local_span_start": 34,
                            "local_span_end": 39
                        },
                        {
                            "instance_id": "T43",
                            "entity_type": "Gene",
                            "global_span_start": 9892,
                            "global_span_end": 9897,
                            "local_span_start": 286,
                            "local_span_end": 291
                        }
                    ]
                },
                {
                    "ner_mention": "CFP",
                    "appearance_count": 2,
                    "ner_instance_array": [
                        {
                            "instance_id": "T41",
                            "entity_type": "Gene",
                            "global_span_start": 9703,
                            "global_span_end": 9706,
                            "local_span_start": 97,
                            "local_span_end": 100
                        },
                        {
                            "instance_id": "T42",
                            "entity_type": "Gene",
                            "global_span_start": 9831,
                            "global_span_end": 9834,
                            "local_span_start": 225,
                            "local_span_end": 228
                        }
                    ]
                }
            ]
        },
        {
            "text": "We therefore analyzed the mRNA sequence of four proteins, YFP and CFP, eGFP, and wtGFP, using mFold (Figure, panels A, B and C, respectively). We let mFold predict possible secondary structures of a 50 nucleotide mRNA sequence, of all four respective sequences, with the RBS in the center of the sequence. We then determined how many bases from the RBS and start codon (AUG) were involved in the structure with the lowest predicted energy. Since CFP and YFP have identical mRNA sequences surrounding the RBS, they both have the same number of bases from the RBS and start codon (AUG) involved in the lowest energy fold, namely, 4. eGFP has 8 bases involved in the lowest energy fold, and wtGFP only 2. We compared these number of bases to the yield of uncoupled gene expression and found that the latter scales linearly with the number of base pairs involved in secondary structures (Figure D, Figure S5). This negative linear correlation (Pearson’s correlation coefficient = −0.98) is a strong indication that secondary mRNA structures do not allow for translation in an uncoupled system.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "YFP",
                    "appearance_count": 2,
                    "ner_instance_array": [
                        {
                            "instance_id": "T44",
                            "entity_type": "Gene",
                            "global_span_start": 10088,
                            "global_span_end": 10091,
                            "local_span_start": 56,
                            "local_span_end": 59
                        },
                        {
                            "instance_id": "T49",
                            "entity_type": "Gene",
                            "global_span_start": 10484,
                            "global_span_end": 10487,
                            "local_span_start": 452,
                            "local_span_end": 455
                        }
                    ]
                },
                {
                    "ner_mention": "CFP",
                    "appearance_count": 2,
                    "ner_instance_array": [
                        {
                            "instance_id": "T45",
                            "entity_type": "Gene",
                            "global_span_start": 10096,
                            "global_span_end": 10099,
                            "local_span_start": 64,
                            "local_span_end": 67
                        },
                        {
                            "instance_id": "T48",
                            "entity_type": "Gene",
                            "global_span_start": 10476,
                            "global_span_end": 10479,
                            "local_span_start": 444,
                            "local_span_end": 447
                        }
                    ]
                },
                {
                    "ner_mention": "eGFP",
                    "appearance_count": 2,
                    "ner_instance_array": [
                        {
                            "instance_id": "T46",
                            "entity_type": "Gene",
                            "global_span_start": 10101,
                            "global_span_end": 10105,
                            "local_span_start": 69,
                            "local_span_end": 73
                        },
                        {
                            "instance_id": "T50",
                            "entity_type": "Gene",
                            "global_span_start": 10661,
                            "global_span_end": 10665,
                            "local_span_start": 629,
                            "local_span_end": 633
                        }
                    ]
                },
                {
                    "ner_mention": "wtGFP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T47",
                            "entity_type": "Gene",
                            "global_span_start": 10111,
                            "global_span_end": 10116,
                            "local_span_start": 79,
                            "local_span_end": 84
                        }
                    ]
                }
            ]
        },
        {
            "text": "mFold analysis of mRNA sequences of (A) CFP and YFP, (B) eGFP, and (C) wtGFP; the top triangle depicts bases involved in pairing in all possible folds, and the bottom triangle depicts paired bases in the lowest energy fold. Bases from the RBS involved in secondary structures are marked in red, and bases from the start codon (AUG) are marked in blue. (D) Number of bases involved in the lowest energy fold versus the uncoupled expression level for wtGFP (green triangle), CFP (blue triangle), YFP (red circle), and eGFP (black square).",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "CFP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T51",
                            "entity_type": "Gene",
                            "global_span_start": 11160,
                            "global_span_end": 11163,
                            "local_span_start": 38,
                            "local_span_end": 41
                        }
                    ]
                },
                {
                    "ner_mention": "YFP",
                    "appearance_count": 2,
                    "ner_instance_array": [
                        {
                            "instance_id": "T52",
                            "entity_type": "Gene",
                            "global_span_start": 11168,
                            "global_span_end": 11171,
                            "local_span_start": 46,
                            "local_span_end": 49
                        },
                        {
                            "instance_id": "T54",
                            "entity_type": "Gene",
                            "global_span_start": 11614,
                            "global_span_end": 11617,
                            "local_span_start": 492,
                            "local_span_end": 495
                        }
                    ]
                },
                {
                    "ner_mention": "eGFP",
                    "appearance_count": 2,
                    "ner_instance_array": [
                        {
                            "instance_id": "T53",
                            "entity_type": "Gene",
                            "global_span_start": 11177,
                            "global_span_end": 11181,
                            "local_span_start": 55,
                            "local_span_end": 59
                        },
                        {
                            "instance_id": "T55",
                            "entity_type": "Gene",
                            "global_span_start": 11636,
                            "global_span_end": 11640,
                            "local_span_start": 514,
                            "local_span_end": 518
                        }
                    ]
                }
            ]
        },
        {
            "text": "Next, we wanted to verify the influence of secondary structures experimentally using two different approaches. First, we purified mRNA and heat-treated it to linearize the sequence. We then performed in vitro translation of 500 nM of treated and untreated mRNA. Translation was studied for mRNA encoding for eGFP, CFP, and wtGFP, shown in Figure, panels A, B, and C, respectively. eGFP expression was not rescued by attempting to linearize the mRNA, supporting the argument that this mRNA sequence indeed forms the most stable secondary structure encompassing the ribosome binding site. On the other hand, CFP and wtGFP show enhanced expression when the mRNA is heat-treated. Second, we sought to use dimethyl sulfoxide (DMSO). DMSO is a reagent often used in polymerase chain reactions (PCR) to avoid secondary structure formation in primers, and hence it increases PCR yields. Additionally, DMSO has also been shown to help in the denaturation of mRNA. Therefore, we wanted to determine whether DMSO would also help in removing mRNA secondary structures, particularly in the eGFP mRNA. Figure E shows that when in vitro translation is carried out in the presence of 10% DMSO, eGFP mRNA shows protein production while eGFP mRNA without DMSO shows no expression (500 nM of mRNA was added in each case). Experiments conducted with YFP, CFP, and wtGFP mRNA showed similar results (Figure S6). This substantial enhancement in protein yield indicates that DMSO does play a role in disrupting secondary structures. The above experiments reinforce our hypothesis that mRNA secondary structures play a crucial role in mRNA inactivation. Please note that the yields shown in Figure are absolute yields and not yields compared with a positive control (as in Figure D). Therefore, we are unable to make any definite conclusions about the strength of stabilizing effect of heat treatment or DMSO. We also found that the addition of RNase inhibitors did not rescue eGFP expression in the in vitro translation reaction (Figure S6), indicating that, in our system, mRNA degradation was not a major cause of mRNA inactivation.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "eGFP",
                    "appearance_count": 6,
                    "ner_instance_array": [
                        {
                            "instance_id": "T56",
                            "entity_type": "Gene",
                            "global_span_start": 11964,
                            "global_span_end": 11968,
                            "local_span_start": 305,
                            "local_span_end": 309
                        },
                        {
                            "instance_id": "T59",
                            "entity_type": "Gene",
                            "global_span_start": 12037,
                            "global_span_end": 12041,
                            "local_span_start": 378,
                            "local_span_end": 382
                        },
                        {
                            "instance_id": "T63",
                            "entity_type": "Gene",
                            "global_span_start": 12733,
                            "global_span_end": 12737,
                            "local_span_start": 1074,
                            "local_span_end": 1078
                        },
                        {
                            "instance_id": "T64",
                            "entity_type": "Gene",
                            "global_span_start": 12834,
                            "global_span_end": 12838,
                            "local_span_start": 1175,
                            "local_span_end": 1179
                        },
                        {
                            "instance_id": "T65",
                            "entity_type": "Gene",
                            "global_span_start": 12875,
                            "global_span_end": 12879,
                            "local_span_start": 1216,
                            "local_span_end": 1220
                        },
                        {
                            "instance_id": "T70",
                            "entity_type": "Gene",
                            "global_span_start": 13609,
                            "global_span_end": 13613,
                            "local_span_start": 1950,
                            "local_span_end": 1954
                        }
                    ]
                },
                {
                    "ner_mention": "CFP",
                    "appearance_count": 3,
                    "ner_instance_array": [
                        {
                            "instance_id": "T57",
                            "entity_type": "Gene",
                            "global_span_start": 11970,
                            "global_span_end": 11973,
                            "local_span_start": 311,
                            "local_span_end": 314
                        },
                        {
                            "instance_id": "T60",
                            "entity_type": "Gene",
                            "global_span_start": 12262,
                            "global_span_end": 12265,
                            "local_span_start": 603,
                            "local_span_end": 606
                        },
                        {
                            "instance_id": "T67",
                            "entity_type": "Gene",
                            "global_span_start": 12991,
                            "global_span_end": 12994,
                            "local_span_start": 1332,
                            "local_span_end": 1335
                        }
                    ]
                },
                {
                    "ner_mention": "wtGFP",
                    "appearance_count": 3,
                    "ner_instance_array": [
                        {
                            "instance_id": "T58",
                            "entity_type": "Gene",
                            "global_span_start": 11979,
                            "global_span_end": 11984,
                            "local_span_start": 320,
                            "local_span_end": 325
                        },
                        {
                            "instance_id": "T61",
                            "entity_type": "Gene",
                            "global_span_start": 12270,
                            "global_span_end": 12275,
                            "local_span_start": 611,
                            "local_span_end": 616
                        },
                        {
                            "instance_id": "T68",
                            "entity_type": "Gene",
                            "global_span_start": 13000,
                            "global_span_end": 13005,
                            "local_span_start": 1341,
                            "local_span_end": 1346
                        }
                    ]
                },
                {
                    "ner_mention": "polymerase",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T62",
                            "entity_type": "Gene",
                            "global_span_start": 12416,
                            "global_span_end": 12426,
                            "local_span_start": 757,
                            "local_span_end": 767
                        }
                    ]
                },
                {
                    "ner_mention": "YFP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T66",
                            "entity_type": "Gene",
                            "global_span_start": 12986,
                            "global_span_end": 12989,
                            "local_span_start": 1327,
                            "local_span_end": 1330
                        }
                    ]
                },
                {
                    "ner_mention": "RNase",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T69",
                            "entity_type": "Gene",
                            "global_span_start": 13577,
                            "global_span_end": 13582,
                            "local_span_start": 1918,
                            "local_span_end": 1923
                        }
                    ]
                }
            ]
        },
        {
            "text": "Translation with heat-treated and untreated purified mRNA for (A) eGFP, (B) CFP, and (C) wtGFP. (D) Final yields of all three proteins from translation of heat-treated (black squares) versus untreated mRNA (red circles). (E) Translation of DMSO treated eGFP mRNA (blue triangles) compared with untreated mRNA (red circles).",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "eGFP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T71",
                            "entity_type": "Gene",
                            "global_span_start": 14021,
                            "global_span_end": 14025,
                            "local_span_start": 250,
                            "local_span_end": 254
                        }
                    ]
                }
            ]
        },
        {
            "text": "In prokaryotic cells, translating ribosomes on an mRNA molecule prevent the inactivation of this mRNA. Thus, we hypothesized that the addition of ribosomes in our uncoupled in vitro system could also prevent the inactivation of mRNA. We added 3.6 μM of ribosomes, extracted from the lysate by centrifugation, to the in vitro transcription only reaction (Figure A) and observed that the uncoupled system is indeed rescued (Figure B). The key difference between the uncoupled system and uncoupled system with ribosomal extract (Figure B) is that in the uncoupled system all mRNA can fold into the respective secondary structures, encompassing the RBS and start codon, before the lysate is added. However, in the presence of ribosomal extract, some of the mRNA that is being produced can be bound and protected by ribosomes, which are present during the transcriptional process, preventing the secondary structure formation of a fraction of the mRNA. This distinct difference suggests that any mRNA that is left to fold without the interference of ribosomes becomes inactivated. Please note that the value of 3.6 μM was chosen because it was roughly estimated to be the ribosomal concentration in the cell lysate. We also verified that it was the added ribosomal extract that allowed for successful uncoupling (Figure S3) and not changes in buffer composition or any additional proteins present in the lysate.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph",
            "ner_annotations": []
        },
        {
            "text": "Uncoupled IVTT with the addition of ribosomal extract. (A) Uncoupled transcription and translation. In vitro transcription is carried out for approximately 20 min in the presence of ribosomal extract. Subsequently DNase is added to degrade the plasmid DNA. After incubation, the lysate is added to initiate translation, and protein production is followed over time. As a result transcription only occurs in the first 20 min, and translation only occurs in the remaining time. (B) Uncoupled IVTT with addition of ribosomal extract (3.6 μM ribosomes) during transcription (green dashed line). Coupled (red full line) and uncoupled (black dashed-dotted line) protein expression curves without added ribosomal extract are shown for comparison.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "DNase",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T72",
                            "entity_type": "Gene",
                            "global_span_start": 15714,
                            "global_span_end": 15719,
                            "local_span_start": 212,
                            "local_span_end": 217
                        }
                    ]
                }
            ]
        },
        {
            "text": "To determine whether there was a relationship between ribosome concentration and protein yield, we performed uncoupled in vitro transcription and translation for a range of different ribosome concentrations. We carried out the experiment displayed in Figure A using a range of ribosomal extract concentrations (from 0.6–5.4 μM). In short, we added the ribosomal extract at the start of the experiment in the presence of the in vitro transcription machinery. After the incubation with DNase, we added the E. coli lysate and followed protein expression. The negative control (−C), was the uncoupled IVTT system in the absence of ribosomes during the transcription step, as illustrated by Figure C. The positive control (+C), was coupled IVTT (Figure A) in the presence of 5 μM of ribosomes added to the cell lysate. The positive control was set to 100%, and the yields of uncoupled gene expression and the negative control were compared with this value. These sets of experiments were carried out for eGFP (Figure A), YFP (Figure B), and CFP (Figure C). For all three proteins, the yield increases with increasing amounts of ribosomal extract added. The addition of ribosomal extract during the transcriptional step fully rescues protein expression of the uncoupled system, yielding protein concentrations comparable to the positive control (86%, 106%, and 102% for eGFP, YFP, and CFP, respectively). We also compared the production rates for all three proteins in the presence of different concentrations of ribosomal extract (Figure D–F), and also here the rates of protein expression are recovered to a rate comparable to the coupled system (dotted line). We show evidence that when mRNA is synthesized in the absence of ribosomal extract, low yield of or no protein is produced. These are important results to take into consideration when using in vitro gene expression and modeling in the development of complex synthetic gene circuits. We show that yields of cell-free protein expression are strongly linked to the presence of ribosomes at the transcriptional level. Furthermore, we show that translational yields of the uncoupled system are rescued to levels comparable to a coupled gene expression system when we add ribosomal extract. We believe that, in the absence of synchronization, mRNA can form secondary structures, which prevent ribosomes from binding. The formation of secondary structures, in turn, strongly depends on the mRNA sequence, which explains why uncoupling is less detrimental for wtGFP, CFP, and YFP compared with eGFP. Therefore, the overproduction of mRNA should not be ignored in the nascent field of cell-free synthetic biology. In order to engineer in vitro synthetic gene circuits, the flow of information from DNA to mRNA to proteins should be predictable, and therefore it would be ideal to achieve a strong synchronization between transcription and translation or at least account for the production of nonfunctional mRNA via an appropriate kinetic analysis of gene expression rates.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "DNase",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T73",
                            "entity_type": "Gene",
                            "global_span_start": 16725,
                            "global_span_end": 16730,
                            "local_span_start": 483,
                            "local_span_end": 488
                        }
                    ]
                },
                {
                    "ner_mention": "eGFP",
                    "appearance_count": 3,
                    "ner_instance_array": [
                        {
                            "instance_id": "T74",
                            "entity_type": "Gene",
                            "global_span_start": 17240,
                            "global_span_end": 17244,
                            "local_span_start": 998,
                            "local_span_end": 1002
                        },
                        {
                            "instance_id": "T77",
                            "entity_type": "Gene",
                            "global_span_start": 17605,
                            "global_span_end": 17609,
                            "local_span_start": 1363,
                            "local_span_end": 1367
                        },
                        {
                            "instance_id": "T81",
                            "entity_type": "Gene",
                            "global_span_start": 18784,
                            "global_span_end": 18788,
                            "local_span_start": 2542,
                            "local_span_end": 2546
                        }
                    ]
                },
                {
                    "ner_mention": "YFP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T75",
                            "entity_type": "Gene",
                            "global_span_start": 17257,
                            "global_span_end": 17260,
                            "local_span_start": 1015,
                            "local_span_end": 1018
                        }
                    ]
                },
                {
                    "ner_mention": "CFP",
                    "appearance_count": 3,
                    "ner_instance_array": [
                        {
                            "instance_id": "T76",
                            "entity_type": "Gene",
                            "global_span_start": 17277,
                            "global_span_end": 17280,
                            "local_span_start": 1035,
                            "local_span_end": 1038
                        },
                        {
                            "instance_id": "T78",
                            "entity_type": "Gene",
                            "global_span_start": 17620,
                            "global_span_end": 17623,
                            "local_span_start": 1378,
                            "local_span_end": 1381
                        },
                        {
                            "instance_id": "T80",
                            "entity_type": "Gene",
                            "global_span_start": 18757,
                            "global_span_end": 18760,
                            "local_span_start": 2515,
                            "local_span_end": 2518
                        }
                    ]
                },
                {
                    "ner_mention": "wtGFP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T79",
                            "entity_type": "Gene",
                            "global_span_start": 18750,
                            "global_span_end": 18755,
                            "local_span_start": 2508,
                            "local_span_end": 2513
                        }
                    ]
                }
            ]
        },
        {
            "text": "Ribosome concentration range. (A–C) Yields for the ribosome concentration range for eGFP, YFP, and CFP, respectively. All three fluorescent proteins show recovery to approximately 100% of the coupled expression. The negative control (−C) was the uncoupled IVTT system in the absence of ribosomes during the transcription step, and the positive control (+C) was coupled IVTT. (D–F) Rates for the ribosome range for eGFP, YFP, and CFP, respectively. All three fluorescent proteins recover to a rate similar to coupled transcription and translation, which is shown by the dotted line.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "eGFP",
                    "appearance_count": 2,
                    "ner_instance_array": [
                        {
                            "instance_id": "T82",
                            "entity_type": "Gene",
                            "global_span_start": 19347,
                            "global_span_end": 19351,
                            "local_span_start": 83,
                            "local_span_end": 87
                        },
                        {
                            "instance_id": "T85",
                            "entity_type": "Gene",
                            "global_span_start": 19677,
                            "global_span_end": 19681,
                            "local_span_start": 413,
                            "local_span_end": 417
                        }
                    ]
                },
                {
                    "ner_mention": "YFP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T83",
                            "entity_type": "Gene",
                            "global_span_start": 19353,
                            "global_span_end": 19356,
                            "local_span_start": 89,
                            "local_span_end": 92
                        }
                    ]
                },
                {
                    "ner_mention": "CFP",
                    "appearance_count": 2,
                    "ner_instance_array": [
                        {
                            "instance_id": "T84",
                            "entity_type": "Gene",
                            "global_span_start": 19362,
                            "global_span_end": 19365,
                            "local_span_start": 98,
                            "local_span_end": 101
                        },
                        {
                            "instance_id": "T86",
                            "entity_type": "Gene",
                            "global_span_start": 19692,
                            "global_span_end": 19695,
                            "local_span_start": 428,
                            "local_span_end": 431
                        }
                    ]
                }
            ]
        },
        {
            "text": "Methods",
            "normalized_header": [
                "method"
            ],
            "section_header": "Methods",
            "type": "title"
        },
        {
            "text": "DNA Constructs",
            "normalized_header": [
                "method"
            ],
            "section_header": "DNA Constructs",
            "type": "title"
        },
        {
            "text": "The following plasmids were prepared. The pET plasmids with CFP and YFP sequences in the multiple clone sites were a kind gift from R. Y. Tsien. The sequences for CFP and YFP production in the pET plasmids were inserted into pRSET vectors (Life Technologies) with Nco I at the 5′end of the coding sequence (CDS) and a Xho I restriction site at the 3′end of the CDS. The plasmids were purified and purity was analyzed using gel electrophoresis and sequencing analysis (GATC Biotech, Germany). Concentration of plasmids was determined using a Nanodrop N1000 spectrophotometer. The pRSET vector has T7 RNAP promoter and terminator regions.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "DNA Constructs",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "CFP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T87",
                            "entity_type": "Gene",
                            "global_span_start": 19928,
                            "global_span_end": 19931,
                            "local_span_start": 59,
                            "local_span_end": 62
                        }
                    ]
                },
                {
                    "ner_mention": "Nco I",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T88",
                            "entity_type": "Gene",
                            "global_span_start": 20132,
                            "global_span_end": 20137,
                            "local_span_start": 263,
                            "local_span_end": 268
                        }
                    ]
                },
                {
                    "ner_mention": "Xho I",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T89",
                            "entity_type": "Gene",
                            "global_span_start": 20186,
                            "global_span_end": 20191,
                            "local_span_start": 317,
                            "local_span_end": 322
                        }
                    ]
                },
                {
                    "ner_mention": "RNAP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T90",
                            "entity_type": "Gene",
                            "global_span_start": 20467,
                            "global_span_end": 20471,
                            "local_span_start": 598,
                            "local_span_end": 602
                        }
                    ]
                }
            ]
        },
        {
            "text": "In Vitro Transcription Reaction",
            "normalized_header": [
                "method"
            ],
            "section_header": "In Vitro Transcription Reaction",
            "type": "title"
        },
        {
            "text": "To solely study gene transcription, a reaction buffer without any cell lysate was prepared. The reaction buffer consisted of 50 mM 4-(2-hydroxyethyl)-1-piperazineethanesulfonic acid (HEPES, pH 8.0), 10 mM magnesium glutamate, 86 mM potassium glutamate; 2.4 mM guanosine triphosphate (GTP); 1 mM each adenosine triphosphate (ATP), cytidine triphosphate (CTP), and uridine triphosphate (UTP), 0.66 mM spermidine, 0.5 mM cyclic adenosine monophosphate (cAMP), 0.22 mM nicotinamide adenine dinucleotide (NAD), 0.17 mM coenzyme A, 20 mM 3-phosphoglyceric acid (3-PGA), 0.045 mM folinic acid, 0.13 mg·mL –1 transfer ribonucleic acid (tRNA), 1 mM each amino acid, 1260 U mL –1 T7 RNAP, and plasmid (3 nM), as well as a molecular beacon for mRNA detection (0.5 μM). The final reaction volume was 30 μL, for experiments leading to Figure D.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "In Vitro Transcription Reaction",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "RNAP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T91",
                            "entity_type": "Gene",
                            "global_span_start": 21211,
                            "global_span_end": 21215,
                            "local_span_start": 673,
                            "local_span_end": 677
                        }
                    ]
                }
            ]
        },
        {
            "text": "The molecular beacon was used to follow mRNA production. Its backbone was composed of 2′-O-methylribonucleotides covalently attached to a fluorophore (AlexaFluor 488) and a quencher (IABkFQ). The molecular beacon was synthesized by DNA Technologies and diluted in Milli-Q (MQ) water to a final concentration of 50 μM. It binds to a 4 times repeat unit at the end of the eGFP mRNA sequence (Figure S1) and has the following sequence:/5Alex488N/mCm­CmGm­CmAmAm­AmUmAm­AmAmUm­UmUmAm­AmGmGm­GmUmAm­AmGmCm­GmG/3IABkFQ/.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "In Vitro Transcription Reaction",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "eGFP",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T92",
                            "entity_type": "Gene",
                            "global_span_start": 21740,
                            "global_span_end": 21744,
                            "local_span_start": 370,
                            "local_span_end": 374
                        }
                    ]
                }
            ]
        },
        {
            "text": "Cell Lysate (25 mg mL –1 ) Preparation",
            "normalized_header": [
                "method"
            ],
            "section_header": "Cell Lysate (25 mg mL –1 ) Preparation",
            "type": "title"
        },
        {
            "text": "E. coli Rosetta2 cells were grown at 37 °C to an OD 600 = 1.5 in 2YTPG broth. After cell growth, all the subsequent steps were kept on ice. The cells were collected (3000 g, 10 min, 4 °C), thoroughly dissolved in ice-cold 20% sucrose solution (16 mL for 3 g of wet pellet weight), and incubated on ice for 10 min. Cells were then collected (3000 g, 10 min, 4 °C), resuspended in ice cold MQ (4 × wet pellet weight), and immediately spun down (3000 g, 10 min, 4 °C). Next, cells were again resuspended in ice cold MQ (4 × wet pellet weight), allowed to incubate on ice for 10 min and spun down (3000 g, 10 min, 4 °C). Pellet was then carefully washed twice with ice-cold MQ (1.5 × volume). The cell pellet was stored at −80 °C.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Cell Lysate (25 mg mL –1 ) Preparation",
            "type": "paragraph",
            "ner_annotations": []
        },
        {
            "text": "Cells were thawed and resuspended in ice-cold MQ (0.8 × volume). Cells were lysed by 10 cycles of sonication (10 s at 10 μm amplitude followed by 30 s on ice). Cell debris was spun down (30000 g, 30 min, 4 °C), and the collected supernatant was dialyzed 1× against 50% dialysis buffer and 3× against 100% dialysis buffer, which consisted of 5 mM Tris (pH 8.2), 30 mM potassium glutamate, 7 mM magnesium glutamate, and 0.5 mM dithiothreitol (DTT), The protein concentration of the cell lysate was determined using a Pierce BCA Protein Assay Kit.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Cell Lysate (25 mg mL –1 ) Preparation",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "BCA",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T93",
                            "entity_type": "Gene",
                            "global_span_start": 23176,
                            "global_span_end": 23179,
                            "local_span_start": 525,
                            "local_span_end": 528
                        }
                    ]
                }
            ]
        },
        {
            "text": "In Vitro Transcription/Translation Reaction",
            "normalized_header": [
                "method"
            ],
            "section_header": "In Vitro Transcription/Translation Reaction",
            "type": "title"
        },
        {
            "text": "The in vitro transcription/translation protocol previously reported was used. The reaction mixture consisted of the in vitro transcription reaction (mentioned above), without the addition of molecular beacon and with the addition of cell lysate from Rosetta2 cells, making up a final concentration of 8.3 mg mL –1. The final reaction volume was 30 μL.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "In Vitro Transcription/Translation Reaction",
            "type": "paragraph",
            "ner_annotations": []
        },
        {
            "text": "In Vitro Translation Reaction",
            "normalized_header": [
                "method"
            ],
            "section_header": "In Vitro Translation Reaction",
            "type": "title"
        },
        {
            "text": "This was identical to the in vitro transcription/translation reaction, except that instead of 3 nM plasmid, 500 nM mRNA was added.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "In Vitro Translation Reaction",
            "type": "paragraph",
            "ner_annotations": []
        },
        {
            "text": "mRNA Production",
            "normalized_header": [
                "method"
            ],
            "section_header": "mRNA Production",
            "type": "title"
        },
        {
            "text": "The mRNA was prepared in bulk with 40 mM HEPES (pH 8.0), 3.7 mM DTT, 1 mM spermidine, 25 mM magnesium chloride, 4 mM each GTP, ATP, CTP, and UTP, 5 mM guanosine monophosphate (GMP), 1260 U mL –1 T7 RNA polymerase, and 3 nM DNA. The mixture was incubated for 3 h at 37 °C. DNase I (20 U mL –1, Sigma-Aldrich) was added to stop transcription, and the mixture was incubated for an additional 30 min at 37 °C. Then EDTA (100 mM) was added, and mRNA was purified by ethanol precipitation and resuspended in Milli-Q. Resulting mRNA was either added to the translation mixture (untreated), heated to 90 °C for 5 min, snap-cooled on ice–water, and then added to the translation mixture (treated), or added to the translation mixture (see Supporting Information for more detail) with 10% DMSO (DMSO treated).",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "mRNA Production",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "RNA polymerase",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T94",
                            "entity_type": "Gene",
                            "global_span_start": 23972,
                            "global_span_end": 23986,
                            "local_span_start": 203,
                            "local_span_end": 217
                        }
                    ]
                },
                {
                    "ner_mention": "DNase I",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T95",
                            "entity_type": "Gene",
                            "global_span_start": 24046,
                            "global_span_end": 24053,
                            "local_span_start": 277,
                            "local_span_end": 284
                        }
                    ]
                }
            ]
        },
        {
            "text": "Uncoupling",
            "normalized_header": [
                "method"
            ],
            "section_header": "Uncoupling",
            "type": "title"
        },
        {
            "text": "The appropriate plasmids were added to the prepared in vitro transcription/translation reagents (see above), without the addition of the crude cell extract. After 20 min of reaction at 30 °C, 20 U mL –1 DNase I (Sigma-Aldrich) was added to stop transcription. DNA digestion lasted 10 min at 30 °C. Subsequently E. coli lysate was added to continue with the translation, making up a final concentration of 8.3 mg mL –1. Protein expression was followed via fluorescence (Tecan’s Infinite 200 PRO plate reader) at 30 °C.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Uncoupling",
            "type": "paragraph",
            "ner_annotations": [
                {
                    "ner_mention": "DNase I",
                    "appearance_count": 1,
                    "ner_instance_array": [
                        {
                            "instance_id": "T96",
                            "entity_type": "Gene",
                            "global_span_start": 24787,
                            "global_span_end": 24794,
                            "local_span_start": 207,
                            "local_span_end": 214
                        }
                    ]
                }
            ]
        },
        {
            "text": "Ribosome Extraction",
            "normalized_header": [
                "method"
            ],
            "section_header": "Ribosome Extraction",
            "type": "title"
        },
        {
            "text": "To obtain ribosomal extract and a lysate without ribosomes (−lys), the procedure of cell lysate preparation was followed until after the final centrifugation step, then the following additional steps were performed. The supernatant was collected in ultracentrifuge tubes (10 mL), and the tubes were filled with S30 buffer (10 mM Tris-HCl pH 7.7, 10 mM magnesium acetate, 60 mM ammonium chloride). Then, the ribosomes were spun down (45000 rpm, 3 h, 4 °C, Ti90). The collected supernatant was dialyzed against S30 buffer, obtaining the lysate without ribosomes (−lys). The pellet from the ultracentrifugation was dissolved slowly in S30 buffer overnight at 4 °C. Afterward, 1.8 M sucrose was added to fill the ultracentrifuge tube, and the ribosomes were spun down again (45000 rpm, 20 h, 4 °C, Ti90). Finally, the pellets were redissolved in 500 μL of STB buffer (50 mM ammonium chloride, 10 mM magnesium chloride, 100 mM Tris-HCl pH 8.1, 6 mM β-mecaptoethanol), aliquoted, and flash-frozen in liquid nitrogen for storage at −80 °C.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Ribosome Extraction",
            "type": "paragraph",
            "ner_annotations": []
        }
    ],
    "issue_pub_date": "12/16/2016",
    "electron_pub_date": "06/15/2016",
    "article_id": "10.1021/acssynbio.6b00010",
    "internal_id": "d1896432",
    "history": [
        {
            "event": "received",
            "time": "01/13/2016"
        },
        {
            "event": "asap",
            "time": "07/05/2016"
        },
        {
            "event": "just-accepted",
            "time": "06/15/2016"
        }
    ],
    "type": "Research Article",
    "article_title": "Protein Synthesis in Coupled and Uncoupled Cell-Free Prokaryotic Gene Expression Systems",
    "suppl_files": [
        {
            "suppl_filename": "sb-2016-00010e_si_001.pdf",
            "rpath": "sb6b00010/suppl/sb-2016-00010e_si_001.pdf",
            "sequences": ">d1896432_sb-2016-00010e_si_001.pdf_0\nTAATACGACTCACTATAGGGAGACCACAACGGTTTCCCTCTAGAAATAATTTTGTTTAACTTTAAGAAGGAGATATACCATGGAGCTTTTCACTGGCGTTGTTCCCATCCTGGTCGAGCTGGACGGCGACGTAAACGGCCACAAGTTCAGCGTGTCCGGCGAGGGCGAGGGCGATGCCACCTACGGCAAGCTGACCCTGAAGTTCATCTGCACCACCGGCAAGCTGCCCGTGCCCTGGCCCACCCTCGTGACCACCCTGACCTACGGCGTGCAGTGCTTCAGCCGCTACCCCGACCACATGAAGCAGCACGACTTCTTCAAGTCCGCCATGCCCGAAGGCTACGTCCAGGAGCGCACCATCTTCTTCAAGGACGACGGCAACTACAAGACCCGCGCCGAGGTGAAGTTCGAGGGCGACACCCTGGTGAACCGCATCGAGCTGAAGGGCATCGACTTCAAGGAGGACGGCAACATCCTGGGGCACAAGCTGGAGTACAACTACAACAGCCACAACGTCTATATCATGGCCGACAAGCAGAAGAACGGCATCAAGGTGAACTTCAAGATCCGCCACAACATCGAGGACGGCAGCGTGCAGCTCGCCGACCACTACCAGCAGAACACCCCCATCGGCGACGGCCCCGTGCTGCTGCCCGACAACCACTACCTGAGCACCCAGTCCGCCCTGAGCAAAGACCCCAACGAGAAGCGCGATCACATGGTCCTGCTGGAGTTCGTGACCGCCGCCGGGATCTAACTCGAGTAGTAGAACTCTCTCAACGTGTACGCCATAGCTAGCTACAACTCTCTCAAC\n>d1896432_sb-2016-00010e_si_001.pdf_1\nGTAACGTACCTAACGCATCGAACTCTCTCAACGTTACTATACTAAACTACCTAACTCTCTCAACGTACTACTGGAAAACTACCTGAATTCGAAGCTTGATCCGGCTGCTAACAAAGCCCGAAAGGAAGCTGAGTTGGCTGCTGCCACCGCTGAGCAATAACTAGCATAACCCCTTGGGGCCTCTAAACGGGTCTTGAGGGGTTTTTTGCTGAAAGGAGGAACTATATCCGGAT\n>d1896432_sb-2016-00010e_si_001.pdf_2\nATGGGTAAAGGAGAAGAACTTTTCACTGGAGTTGTCCCAATTCTTGTTGAATTAGATGGTGATGTTAATGGGCACAAATTTTCTGTCAGTGGAGAGGGTGAAGGTGATGCAACATACGGAAAACTTACCCTTAAATTTATTTGCACTACTGGAAAACTACCTGTTCCGTGGCCAACACTTGTCACTACTTTCTCTTATGGTGTTCAATGCTTTTCCCGTTATCCGGATCATATGAAACGGCATGACTTTTTCAAGAGTGCCATGCCCGAAGGTTATGTACAGGAACGCACTATATCTTTCAAAGATGACGGGAACTACAAGACGCGTGCTGAAGTCAAGTTTGAAGGTGATACCCTTGTTAATCGTATCGAGTTAAAAGGTATTGATTTTAAAGAAGATGGAAACATTCTCGGACACAAACTCGAGTACAACTATAACTCACACAATGTATACATCACGGCAGACAAACAAAAGAATGGAATCAAAGCTAACTTCAAAATTCGCCACAACATTGAAGATGGATCCGTTCAACTAGCAGACCATTATCAACAAAATACTCCAATTGGCGATGGCCCTGTCCTTTTACCAGACAACCATTACCTGTCCACACAATCTGCCCTTTCGAAAGATCCCAACGAAAAGAGAGACCACATGGTCCTTCTTGAGTTTGTAACAGCTGCTGGGATTACACATGGCATGGATGAACTATACAAGGGTCACCACCATCACCATCACTAG\n>d1896432_sb-2016-00010e_si_001.pdf_3\nATGGTGAGCAAGGGCGAGGAGCTGTTCACCGGGGTGGTGCCCATCCTGGTCGAGCTGGACGGCGACGTAAACGGCCACAGGTTCAGCGTGTCCGGCGAGGGCGAGGGCGATGCCACCTACGGCAAGCTGACCCTGAAGTTCATCTGCACCACCGGCAAGCTGCCCGTGCCCTGGCCCACCCTCGTGACCACCCTGACCTGGGGCGTGCAGTGCTTCAGCCGCTACCCCGACCACATGAAGCAGCACGACTTCTTCAAGTCCGCCATGCCCGAAGGCTACGTCCAGGAGCGTACCATCTTCTTCAAGGACGACGGCAACTACAAGACCCGCGCCGAGGTGAAGTTCGAGGGCGACACCCTGGTGAACCGCATCGAGCTGAAGGGCATCGACTTCAAGGAGGACGGCAACATCCTGGGGCACAAGCTGGAGTACAACTACATCAGCCACAACGTCTATATCACCGCCGACAAGCAGAAGAACGGCATCAAGGCCCACTTCAAGATCCGCCACAACATCGAGGACGGCAGCGTGCAGCTCGCCGACCACTACCAGCAGAACACCCCCATCGGCGACGGCCCCGTGCTGCTGCCCGACAACCACTACCTGAGCACCCAGTCCAAGCTGAGCAAAGACCCCAACGAGAAGCGCGATCACATGGTCCTGCTGGAGTTCGTGACCGCCGCCGGGATCACTCACGGCATGGACGAGCTGTACAAGGCTGGTAAGCTTGCGGCCGCACTCGAGCAAGAATTCGAAGCTTGA\n>d1896432_sb-2016-00010e_si_001.pdf_4\nATGGTGAGCAAGGGCGAGGAGCTGTTCACCGGGGTGGTGCCCATCCTGGTCGAGCTGGACGGCGACGTAAACGGCCACAAGTTCAGCGTGTCCGGCGAGGGCGAGGGCGATGCCACCTACGGCAAGCTGACCCTGAAGTTCATCTGCACCACCGGCAAGCTGCCCGTGCCCTGGCCCACCCTCGTGACCACCTTCGGCTACGGCCTGAAGTGCTTCGCCCGCTACCCCGACCACATGAAGCAGCACGACTTCTTCAAGTCCGCCATGCCCGAAGGCTACGTCCAGGAGCGCACCATCTTCTTCAAGGACGACGGCAACTACAAGACCCGCGCCGAGGTGAAGTTCGAGGGCGACACCCTGGTGAACCGCATCGAGCTGAAGGGCATCGACTTCAAGGAGGACGGCAACATCCTGGGGCACAAGCTGGAGTACAACTACAACAGCCACAACGTCTATATCATGGCCGACAAGCAGAAGAACGGCATCAAGGTGAACTTCAAGATCCGCCACAACATCGAGGACGGCAGCGTGCAGCTCGCCGACCACTACCAGCAGAACACCCCCATCGGCGACGGCCCCGTGCTGCTGCCCGACAACCACTACCTGAGCTACCAGTCCAAGCTGAGCAAAGACCCCAACGAGAAGCGCGATCACATGGTCCTGCTGGAGTTCGTGACCGCCGCCGGGATCACTCACGGCATGGACGAGCTGTACAAGGCTGGTAAGCTTGCGGCCGCACTCGAGCAAGAATTCGAAGCTTGA\n"
        }
    ]
}