{
    "pub_num": "sb5b00012",
    "is_research": true,
    "keywords": [
        "CRISPR/dCas9",
        "metabolic engineering",
        "gene regulation",
        "naringenin",
        "heparosan",
        "CRISPR array assembly"
    ],
    "abstract": [
        "Programmable control over an addressable global regulator would enable simultaneous repression of multiple genes and would have tremendous impact on the field of synthetic biology. It has recently been established that CRISPR/Cas systems can be engineered to repress gene transcription at nearly any desired location in a sequence-specific manner, but there remain only a handful of applications described to date. In this work, we report development of a vector possessing a CRISPathBrick feature, enabling rapid modular assembly of natural type II-A CRISPR arrays capable of simultaneously repressing multiple target genes in. Iterative incorporation of spacers into this CRISPathBrick feature facilitates the combinatorial construction of arrays, from a small number of DNA parts, which can be utilized to generate a suite of complex phenotypes corresponding to an encoded genetic program. We show that CRISPathBrick can be used to tune expression of plasmid-based genes and repress chromosomal targets in probiotic, virulent, and commonly engineered strains. Furthermore, we describe development of pCRISPReporter, a fluorescent reporter plasmid utilized to quantify dCas9-mediated repression from endogenous promoters. Finally, we demonstrate that dCas9-mediated repression can be harnessed to assess the effect of downregulating both novel and computationally predicted metabolic engineering targets, improving the yield of a heterologous phytochemical through repression of endogenous genes. These tools provide a platform for rapid evaluation of multiplex metabolic engineering interventions."
    ],
    "body": [
        {
            "text": "Selective and tunable perturbation of gene expression is a fundamental enabling technology in the fields of systems biology and synthetic biology, allowing the design of intricate synthetic circuits and the interrogation of complex natural biological systems. Until recently, however, there has been a paucity of tools to dynamically regulate transcription at the DNA level in a rapid, predictable, and specific manner. In the past, natural DNA-binding proteins have been harnessed by targeting to their cognate protein-binding sequences, artificially placed upstream or downstream of natural promoter sequences, to achieve transcriptional activation or repression; however, this method necessitates the addition of a static DNA element, or operator, near the promoter of interest. This is especially problematic for regulation of endogenous genes since it requires genome engineering, a burdensome task for simultaneous manipulation of multiple targets. Conversely, programmable transcription factor (TF) proteins like zinc fingers and transcription activator like effectors (TALEs) have been utilized to target both natural and artificial DNA sequences for transcription modulation, but construction and selection of TFs are cumbersome processes that yield a TF capable of binding only a single target site. More elegant solutions for transcriptional regulation have been engineered using noncoding RNA (ncRNA) in a few noteworthy instances, but, with the exception of a recent report, these systems have suffered from limited predictability, design complexity, and a small dynamic range. While translational repression can be achieved with other technologies like antisense RNA (asRNA), complex biological programs can benefit from, and might necessitate, multilevel interactions among RNA, DNA, and regulatory proteins, providing a strong argument for developing tools that can readily control transcription.",
            "normalized_section_header": [],
            "section_header": null,
            "type": "paragraph"
        },
        {
            "text": "One such tool, based on an engineered CRISPR (clustered regularly interspaced short palindromic repeats)/Cas system, has recently been shown to achieve highly selective transcriptional modulation over a significant dynamic range. Natural CRISPR/Cas systems are prokaryotic adaptive immune systems that target foreign DNA for cleavage, mediated by a class of endonucleases whose nuclease specificity is guided by Watson–Crick base-pairing complementarity of a ncRNA guide with the target nucleic acid. This highly specific and predictable targeting mechanism has been exploited to convert CRISPR nucleases into ncRNA-guided DNA-binding proteins through mutation of catalytic residues in endonuclease domains, yielding addressable protein–RNA platforms for engineering artificial transcription factors and other devices. Due to the limited number of interacting parts required at the targeting stage of immunity compared to type I and type III CRISPR/Cas systems, the model type II-A system from was the first to be engineered for transcriptional silencing. Mutations D10A of RuvC and H840A of HNH endonuclease domains in Cas9 (forming mutant dCas9), the sole RNA-guided dsDNA endonuclease in this system, abolished nuclease activity but maintained sequence-specific dsDNA-binding capability, a property of dCas9 that has been utilized to achieve transcriptional repression at endogenous promoters through promoter occlusion from RNA polymerase (RNAP) and abortion of transcription elongation (referred to as CRISPR interference, or CRISPRi). Two recent reports also demonstrated engineering of the orthogonal type I-E CRISPR/Cas system from for gene silencing.",
            "normalized_section_header": [],
            "section_header": null,
            "type": "paragraph"
        },
        {
            "text": "The type II-A CRISPR/Cas system is composed of interacting elements that can be generally classified by their involvement in either the adaptation or targeting stage of immunity. Elements involved in the adaptive immunity stage, where natural target DNA sequences are detected and incorporated into a genomic locus known as the CRISPR array, are described in detail elsewhere. The following constituents of the targeting stage of immunity are required for targeted cleavage of foreign dsDNA in the natural system: Cas9, precursor CRISPR RNA (pre-crRNA), transactivating crRNA (tracrRNA), and RNase III. Pre-crRNA is a ncRNA transcript of the CRISPR array, an ordered arrangement of ∼30 bp “spacer” sequences (memory of challenge from exogenous nucleic acid) uniformly interspersed with a 36 bp “repeat” sequence (Figure). Spacer sequences are identical to the complement of the 30 bp target dsDNA sequence known as the protospacer, which must be immediately flanked at the 3′ end by a 3 bp NGG sequence referred to as the protospacer adjacent motif (PAM) in order to anchor Cas9 to the target site. Protospacers are sampled from exogenous DNA and incorporated as novel spacers in CRISPR arrays through a process called adaptation, where spacer acquisition is controlled by many factors including an indispensable AT-rich region known as the leader sequence and encoded immediately upstream of the first spacer. In a process referred to as biogenesis, an antirepeat sequence within tracrRNA molecules base pairs with pre-crRNA repeats, forming RNA duplexes that are subsequently cleaved into stable crRNA:tracrRNA duplexes by RNase III and trimmed in a less well-characterized process called maturation. Complexes of Cas9 with individually processed, mature crRNA:tracrRNA duplexes possessing 20 bp of spacer sequence are then guided to cognate dsDNA for target cleavage by Cas9 (or target binding in the case of dCas9). Maturation of crRNA:tracrRNA is presumably unaffected by replacement of Cas9 with dCas9, and in such a system, the dCas9:crRNA:tracrRNA complex binds to its cognate target without cleavage. In the CRISPRi system, dCas9 is guided to its target by an artificial ncRNA that mimics the crRNA:tracrRNA duplex, known as a single-guide RNA (sgRNA); each sgRNA must be transcribed under control of its own promoter and terminator, although creative cloning strategies have been devised to achieve expression of multiple sgRNAs. Notably, Cas9-mediated cleavage and dCas9-mediated repression at spacer sequences within the CRISPR array are not possible because of the absence of the requisite PAM at the 3′ end of each spacer.",
            "normalized_section_header": [],
            "section_header": null,
            "type": "paragraph"
        },
        {
            "text": "CRISPathBrick feature and assembly strategy. (a) pCRISPathBrick harbors a type II-A CRISPR array and leader sequence (not shown) under control of the native promoter. The nontargeting (NT) spacer (rectangle) possesses a single BsaI recognition site (red font), with the corresponding cut site located inside the anterior repeat (diamond). Each 66 bp spacer–repeat brick (SRB) is assembled by 5′ phosphorylation and annealing of two offset complementary ssDNA oligos. Ligation of SRB with pCRISPathBrick backbone creates a scarless junction between the new spacer (red highlighted text) and its upstream repeat, leaving the original BsaI site in place. (b) Depiction of combinatorial assembly of complete library of 7 CRISPR arrays, starting with a pool of three unique SRBs. Dashed arrows represent BsaI digestion and gel purification of backbone, followed by ligation with SRB.",
            "normalized_section_header": [],
            "section_header": null,
            "type": "paragraph"
        },
        {
            "text": "Here, we present CRISPathBrick, a combinatorial cloning strategy to construct sets of functional type II-A CRISPR arrays bearing multiple synthetic spacers, accompanied by development of set of vectors capable of achieving and quantifying targeted, simultaneous transcriptional repression of multiple genes under the control of a single master regulator, dCas9. We demonstrate, through phenotypic analysis, concurrent repression of distinct genomic targets, and we construct a novel reporter device to show that dCas9-mediated repression enables partial downregulation of essential genes without causing lethality, a property that will be extremely valuable for metabolic engineering requiring throttled flux through essential pathways. Finally, we utilize CRISPathBrick as a metabolic engineering tool to increase production of a heterologous product through targeted endogenous gene downregulations.",
            "normalized_section_header": [],
            "section_header": null,
            "type": "paragraph"
        },
        {
            "text": "Results and Discussion",
            "normalized_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "title"
        },
        {
            "text": "CRISPathBrick Assembly Strategy",
            "normalized_header": [
                "result",
                "discussion"
            ],
            "section_header": "CRISPathBrick Assembly Strategy",
            "type": "title"
        },
        {
            "text": "Recently, Bikard et al. described construction of a type II-A CRISPR/dCas9 (specifically, CRISPR02 from SF370) system capable of targeting only a single site in at a time. The topology of natural CRISPR arrays imposes unique design constraints that are irrelevant in most other cloning procedures but that must be given careful attention here to ensure modularity, to prevent improper biogenesis, and to guarantee successful targeting of dCas9:crRNA:tracrRNA complexes. As the target address is encoded within the 30 bp spacer region, this DNA element must maintain fidelity and cannot be altered to incorporate restriction enzyme cut sites. Furthermore, effects of varying the 36 bp repeat sequence are not completely understood; alterations in the crRNA:tracrRNA complementarity region would presumably have deleterious effects on maturation and would likely hinder dCas9 functionality and perturb orthogonality. We therefore sought to devise an assembly strategy that leaves all repeat regions and targeting spacers intact. Another constraint, which complicates modular construction with newer sequence homology-directed assembly techniques, like Gibson Assembly, sequence-and ligase-independent cloning (SLIC), and circular polymerase extension cloning (CPEC), is that CRISPR repeat sequences within all DNA parts are identical and would likely make maintenance of intended order difficult to achieve, leading to an intolerable degree of misassemblies. Moreover, an added disadvantage of such assembly methods is that part termini (overlap regions) should not possess palindromic sequences or thermodynamically stable ssDNA secondary structure, a property that could prove to be problematic when constructing CRISPR arrays in a modular manner due to the presence of stable hairpins in some type I and II CRISPR repeats. Finally, despite rapidly decreasing costs for DNA synthesis, parts containing complexity (repeated sequences, elements with high propensity for hairpin formation, or highly negative Δ G) are not amenable to many synthesis technologies; thus, even short repetitive parts like CRISPR arrays cannot yet be synthesized as inexpensive, on-demand products like gBlocks (IDT), and the cost of direct synthesis of combinatorial libraries is likely prohibitive for many laboratories. The procedure, presented herein, avoids the aforementioned obstacles for assembly of CRISPR arrays that are indistinguishable from those in natural type II-A systems with respect to organization and preservation of the wild-type leader sequence, natural repeat sequences, and user-specified spacer sequences.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "CRISPathBrick Assembly Strategy",
            "type": "paragraph"
        },
        {
            "text": "Specifically, we have designed CRISPathBrick as a restriction–ligation cloning procedure that takes advantage of a unique nontargeting spacer, in the last position of the array, possessing a single BsaI (Type IIS endonuclease with a nonpalindromic, directional recognition sequence) recognition site near the 3′ end of the bottom strand. As seen in Figure, the BsaI cut site lies outside of its recognition site and instead directs cleavage to the anterior repeat. New spacer–repeat elements are synthesized in offset complementary pairs of ssDNA oligonucleotides (66 bp), where the 5′ phosphorylated and annealed spacer–repeat oligos, hereto referred to as spacer–repeat brick (SRB), possess incompatible 4 bp overhangs (sticky ends) to facilitate directional cloning as popularized by assembly methods like Golden Gate cloning that use Type IIS endonucleases to maintain orientation of inserts. Ligation of the pCRISPathBrick vector backbone with the upstream end of the SRB creates a scarless junction that remains permanently locked; conversely, ligation of the backbone with the downstream end of the SRB reforms the entry junction, identical to that of the original destination vector, which can be cyclically redigested by BsaI. In this manner, single SRBs can be iteratively incorporated into the growing array in a modular fashion analogous to ePathBrick (Figure), furnishing expandable arrays with no intervening restriction sites. Importantly, CRISPathBrick arrays are identical to natural Type II-A CRISPR arrays with the exception of the final, nontargeting BsaI spacer that facilitates cloning, an advantage that this procedure holds over other potential assembly methods. Although our intent is to study effects of transcriptional repression, we expect that this methodology could prove to be useful for others seeking to study adaptation and spacer acquisition in engineered arrays.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "CRISPathBrick Assembly Strategy",
            "type": "paragraph"
        },
        {
            "text": "Design of pCRISPathBrick and Modular Assembly of Type II-A CRISPR Arrays",
            "normalized_header": [
                "result",
                "discussion"
            ],
            "section_header": "Design of pCRISPathBrick and Modular Assembly of Type II-A CRISPR Arrays",
            "type": "title"
        },
        {
            "text": "Plasmid pCRISPathBrick was modified from pdCas9 (developed by Bikard and colleagues), a low-copy plasmid encoding dCas9, tracrRNA, and a minimal type II-A CRISPR array, all elements under transcriptional control of their native SF370 constitutive promoters. To facilitate the CRISPathBrick cloning procedure, as described above, the original junk (placeholder) spacer was swapped with a new nontargeting spacer possessing a single BsaI recognition site. It is important to note that this nontargeting spacer was designed so that no significant matches were found in the genomes of commonly engineered chassis strains BL21 and K-12 MG1655 to preclude inadvertent repression caused by guidance of dCas9 by the nontargeting crRNA. Spacers intended for repression were designed with two simple constraints: the corresponding 30 bp protospacer must be followed by the NGG PAM, a motif that is ubiquitous throughout the genome of all strains and within or in close proximity to most promoters (especially if both strands are considered), and, whenever possible, the protospacers should be matching in all strains that will be tested. SRBs identical to individual protospacers of interest were sequentially incorporated into the expanding pCRISPathBrick array and combined as desired through iterative rounds of restriction digestion and ligation, enabling customizable configuration of target sets and rapid manufacture of defined libraries. For example, three SRBs targeting distinct promoters can be assembled into an exhaustive array library composed of all seven (2 n – 1; the sum of combinations excluding the empty set and ignoring order) possible combinations in only three rounds of cloning (Figure). In this case, three constructs targeting three different promoters are assembled during the first round of cloning. For the second round of cloning, a subset of these arrays are appended with a unique SRB to form all possible double combinations, while the full three-target array is assembled in the third and final round from a double-target array and the last SRB. Construction of three-target comprehensive libraries can be achieved in less than 1 week using colony PCR (cPCR) to screen for positive clones from each round of ligation. As each stage of cloning builds upon constructs from the previous round, however, sequencing each round is advisible to ensure insert fidelity throughout the process. Given the small insert size and low plasmid copy number, we opted to screen ligations using cPCR. Incorporation of a single SRB was accompanied by a concomitant increase in cPCR amplicon size of 66 bp (Figure).",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Design of pCRISPathBrick and Modular Assembly of Type II-A CRISPR Arrays",
            "type": "paragraph"
        },
        {
            "text": "Colony PCR (cPCR) screen for CRISPathBrick constructs, demonstrating sequential insertion of five synthetic SRBs. (a) Small insert size precludes ligation screening by restriction analysis, so cPCR is performed with a forward primer (red, top strand) designed to bind the first spacer and a reverse primer (red, bottom strand) designed to bind inside the nontargeting (NT) spacer. Each new SRB causes a 66 bp increase in PCR amplicon (red bar) length. (b) Representative 2% agarose gel with 1 kb Plus ladder (1kb+) showing amplicons obtained from positive clones of CRISPathBrick arrays assembled with up to five SRBs.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Design of pCRISPathBrick and Modular Assembly of Type II-A CRISPR Arrays",
            "type": "paragraph"
        },
        {
            "text": "Repression of Plasmid-Borne and Chromosomally Integrated Fluorescent Reporter in Divergent Strains",
            "normalized_header": [
                "result",
                "discussion"
            ],
            "section_header": "Repression of Plasmid-Borne and Chromosomally Integrated Fluorescent Reporter in Divergent Strains",
            "type": "title"
        },
        {
            "text": "Plasmid-based gene expression has been a fundamental tool in the fields of microbiology and molecular biology for decades, owing to the ease of construction and ability to transfer the same plasmid to multiple strains and observe, often, qualitatively similar results. In certain instances, however, strain background can cause unexpected device output, so the option to quickly transfer a single device between distinct chassis is advantageous in the search for a suitable system. More recent assembly methods that enable overexpression of multiple genes and entire biosynthetic pathways from a single plasmid would be ideally complemented by a system enabling facile repression of numerous targets that can be rapidly programmed on a single plasmid and transferred to any strain of interest. Thus, to determine if CRISPathBrick is capable of achieving high levels of transcriptional repression in diverse strain backgrounds, we first assessed dCas9-mediated transcriptional repression of a plasmid-borne fluorescent reporter in two different strains (Figure b). Subsequently, repression was compared between plasmid-borne and genome-integrated fluorescent reporter in a single strain (Figure c). In each case, we utilized the same model fluorescent reporter cassette, T7-mCherry, previously built in our lab and composed of codon-optimized mCherry under transcriptional control of the IPTG-inducible P T7lac promoter and T7 terminator; this cassette was constructed using ePathBrick to facilitate transfer between platforms (plasmid vs genome) and chassis, keeping all transcriptional and translational control elements constant. Notably, transcription from T7 promoters is controlled by T7 RNA polymerase, a single-subunit polymerase that is structurally and evolutionarily divergent from the larger, multisubunit prokaryotic and eukaryotic RNA polymerases. As genes under transcriptional control of T7 promoters are known to be expressed at a very high rate in relative to endogenous genes, we sought to determine the capacity of CRISPathBrick to repress transcription from this commonly utilized, high-strength promoter.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Repression of Plasmid-Borne and Chromosomally Integrated Fluorescent Reporter in Divergent Strains",
            "type": "paragraph"
        },
        {
            "text": "Repression of fluorescent reporter using CRISPathBrick. (a) Illustration of T7-mCherry, a cassette composed of codon-optimized mCherry under IPTG-inducible transcriptional control of P T7lac and a T7 terminator. T7-mCherry was cloned into plasmid pETM6 and into the genome of K-12 MG1655. Selected protospacers (purple or orange line) and PAMs (circle at end of protospacer) are indicated on top or bottom strand. crRNA identical to a purple protospacer binds the bottoms strand, whereas crRNA identical to an orange protospacer binds the top strand. (b) Interstrain assessment of CRISPathBrick in BL21 Star (DE3) and K-12 MG1655 (DE3). Repression is displayed relative to the negative control strain possessing pCRISPathBrick with a nontargeting spacer (gray bars). Relative reporter expression (red bars) was comparable between strains, and synergistic repression augmentation occurred when the CRISPathBrick array possessed two spacers targeting nearby target sites (hatched bars). (c) Repression of chromosomal (left) versus plasmid-encoded (right) target. Nearly complete silencing was demonstrated with a spacer targeting the chromosomal T7 consensus promoter sequence. Attenuated repression was achieved against the reporter expressed from a high-copy plasmid pETM6 relative to the genomic reporter. Choice of target strand and distance from the promoter leads to different repression levels, enabling tunable repression. Values represent mean and SEM of biological duplicates (BL21) or five biological replicates from two independent experiments performed on different days (MG1655).",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Repression of Plasmid-Borne and Chromosomally Integrated Fluorescent Reporter in Divergent Strains",
            "type": "paragraph"
        },
        {
            "text": "Plasmid-based repression was assessed against T7-mCherry in the high-copy plasmid pETM6-mCherry through cotransformation with pCRISPathBrick programmed to target distinct locations at the promoter and near the start of the mCherry coding sequence (CDS). Various spacers were designed because it has been shown that dCas9-mediated repression can be tuned by changing target location. The most common strategies for tuning dCas9-mediated repression include the following: titrating expression level of CRISPR machinery using an inducer, where higher levels of expression can lead to higher repression activity but can also cause toxicity; altering target location, where distance from promoter and repression activity generally have an inverse relationship; targeting the coding or noncoding strand, where targeting the coding strand typically achieves better repression; and encoding mismatches in the crRNA with respect to its target, which relieves repression relative to a crRNA that is identical to its protospacer. As shown in Figure b, comparable repression levels were achieved against IPTG-induced, T7 polymerase driven transcription in both chassis, and dual targeting of two nearby sites with a double-target array increased repression of the reporter. This is consistent with previous reports indicating that dCas9-mediated repression, at two nearby sites, enhances repression compared to targeting each site separately. Critical to the value of CRISPathBrick, this augmented repression indicates successful processing of multispacer synthetic type II-A arrays in divergent strains and simultaneous binding of dCas9 at two distinct locations within the same nucleic acid. It is noteworthy that the effective number of simultaneous binding sites in a single cell for a double-target array is much higher than two since the reporter is expressed from a high-copy plasmid (∼40 copies per cell); thus, the synergistic repression with the dual-targeting constructs suggests that dCas9 was successfully guided to approximately ∼80 physical binding sites.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Repression of Plasmid-Borne and Chromosomally Integrated Fluorescent Reporter in Divergent Strains",
            "type": "paragraph"
        },
        {
            "text": "The T7-mCherry cassette was then integrated into the genome of MG1655 (DE3) in order to compare repression against an identical plasmid-borne and genome-based reporter construct in the same chassis. Two additional arrays were constructed to bind other target sites in T7-mCherry, specifically altering either the targeted strand or the distance from the promoter (Figure a), with the intention of achieving intermediate repression levels. Significantly higher repression was achieved against the single chromosomal reporter than that against the reporter expressed from a high-copy plasmid, which might suggest that the ternary dCas9:crRNA:tracrRNA complex could become limiting as many sites are targeted. Figure c further demonstrates that CRISPathBrick can be used to tune expression through site selection and combination of targets.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Repression of Plasmid-Borne and Chromosomally Integrated Fluorescent Reporter in Divergent Strains",
            "type": "paragraph"
        },
        {
            "text": "Attenuation of Capsular Polysaccharide in Virulent and Probiotic E. coli Strains",
            "normalized_header": [
                "result",
                "discussion"
            ],
            "section_header": "Attenuation of Capsular Polysaccharide in Virulent and Probiotic E. coli Strains",
            "type": "title"
        },
        {
            "text": "Building on the previous results demonstrating repression of an artificial, heterologous reporter in two commonly engineered strains, we sought to further evaluate device reusability and functional utility by building a single CRISPathBrick plasmid to silence the same endogenous virulence factor in two divergent wild-type strains, generating the same medically relevant phenotype. Uropathogenic (UPEC) serovar O10:K5:H4, commonly referred to as K5, is a virulent strain, whereas commensal strain Nissle 1917 (serovar O6:K5:H1) is one of the oldest, most well-characterized probiotic strains. Despite their differences, K5 and Nissle 1917, as well as many other virulent strains, share a similar capsular gene cluster responsible for biosynthesis and export of the K5 antigen, an acidic, linear polysaccharide known as heparosan that forms a viscous coating around the bacteria (Figure a). Many pathogens biosynthesize capsular polysaccharides (CPSs), polysaccharides that are synthesized in the cytosol and transported to the cell surface, which are known virulence factors that shield the bacteria from host immune response by hiding cell surface antigens during infection. Deletion of genes involved in CPS biosynthesis and export has been utilized to create acapsular mutants for study of pathogenicity and immunogenicity, but a tunable system like CRISPathBrick might yield insight on host immune response to a range of intermediate capsule coverage levels.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Attenuation of Capsular Polysaccharide in Virulent and Probiotic E. coli Strains",
            "type": "paragraph"
        },
        {
            "text": "Repression of capsular polysaccharide (heparosan) secretion in two strains of, virulent strain K5 and probiotic strain Nissle 1917. (a) Schematic representation of capsular polysaccharide secretion model, where export is blocked by repression of the promoter transcribing the kpsM – kpsT operon (genes encoding the inner membrane transporter). (b) Capsular polysaccharide secretion is significantly attenuated in both strains. Heparosan, which is naturally shed from the cell well of these strains in planktonic culture due to shear force and natural hydrolysis, is quantified in the supernatant. Values represent mean and SEM of biological duplicates.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Attenuation of Capsular Polysaccharide in Virulent and Probiotic E. coli Strains",
            "type": "paragraph"
        },
        {
            "text": "Therefore, we attenuated capsule formation through transcriptional repression of promoter P kpsM (PR3), which controls expression of genes kpsM and kpsT. Deletion from the genome of kpsT, part of an ABC membrane transporter required for translocation of certain CPSs to the outer membrane, is known to prevent export and to cause accumulation of CPS in the cytoplasm. Furthermore, the promoter P kpsM has been shown to transcribe through the heparosan biosynthetic gene cluster, so we anticipated that repression of this promoter would lead to reduction of heparosan production and secretion, qualitatively assessed as loss of capsule. It is noteworthy that dCas9-mediated repression should block expression of all proteins encoded in the operon downstream of the target site, unless there are intermediate promoters located downstream that can drive transcription of the following genes in the operon. The genomes of K5 and Nissle 1917 were sequenced, and a single spacer targeting P kpsM was designed in a region conserved between the two strains as determined by pairwise alignment in the promoter region. This spacer was incorporated into pCRISPathBrick, which was then transformed into K5 and Nissle 1917. pCRISPathBrick possessing only the nontargeting BsaI spacer was transformed into both strains as a negative control. While K5 and Nissle 1917 grow in planktonic culture, heparosan is shed into the media by a combination of shear force and natural hydrolysis, enabling quantification of CPS production and export by analysis of the culture supernatant. As exhibited in Figure, significant attenuation of capsule production was achieved for both K5 and Nissle 1917 compared to their respective control strains. These important results suggest that a single CRISPathBrick plasmid could be used as a tool to study host–pathogen and host–commensal interactions in a set of distinct wild-type strains sharing a particular virulence factor. We also expect that variations of this technology incorporating inducible or dynamically controlled arrays will create new paradigms for transient studies of host–pathogen interactions mediated by panels of virulence factors.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Attenuation of Capsular Polysaccharide in Virulent and Probiotic E. coli Strains",
            "type": "paragraph"
        },
        {
            "text": "Combinatorial Repression of Growth by Targeting Amino Acid Biosynthesis",
            "normalized_header": [
                "result",
                "discussion"
            ],
            "section_header": "Combinatorial Repression of Growth by Targeting Amino Acid Biosynthesis",
            "type": "title"
        },
        {
            "text": "Next, we synthesized a set of four SRBs with spacers designed to target promoters driving transcription of amino acid biosynthetic genes. Targeted genes were selected because their deletions have been previously characterized to cause auxotrophy, creating mutants that require supplementation with the cognate amino acid for growth. The first SRB targets promoter P cysH to repress transcription of monocistronic mRNA encoding CysH, required for production of cysteine from sulfate, whereas the second SRB targets promoter P trpC controlling transcription of operon trpCBA encoding genes involved in tryptophan biosynthesis. The third SRB targets promoter P aroF to limit tyrosine biosynthesis through repression of the aroF–tyrA operon. The final SRB binds to P hisB, a promoter that drives transcription of the histidine biosynthetic operon, HisBHAFI. The CRISPathBrick assembly method was utilized to construct seven plasmids constituting a subset of possible target combinations, and all constructs were transformed to assess dCas9-mediated growth repression.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Combinatorial Repression of Growth by Targeting Amino Acid Biosynthesis",
            "type": "paragraph"
        },
        {
            "text": "It is important to consider that, unless nearly complete transcriptional repression is achieved, it would be expected that cells would eventually grow as the pool of mRNA and protein accumulates. Indeed, some growth in defined minimal media without amino acid supplementation (AuxMM) is observed for the strains harboring a single-spacer CRISPR array targeting amino acid biosynthesis, although clear repression compared to growth (OD 600) in AuxMM supplemented with the cognate amino acid is exhibited in all cases (Figure). We did not assess other potential protospacers, although it is possible that some might have yielded greater repression than our first set of selected targets. Double-target strains were then supplemented with individual requisite amino acids to phenotypically assess if double-target arrays achieved simultaneous repression of both amino acid biosynthetic pathways. Significant growth repression was observed for all double-target strains in media supplemented with only one of two cognate amino acids, which was sufficient to restore growth of each complementary single-target strain. Thus, we have established that modular construction of CRISPathBrick from a finite pool of SRBs can be utilized to rapidly generate a suite of complex phenotypes.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Combinatorial Repression of Growth by Targeting Amino Acid Biosynthesis",
            "type": "paragraph"
        },
        {
            "text": "Growth suppression of through dCas9-mediated repression of amino acid biosynthesis. A subset of four single-target arrays and three double-target arrays was constructed from four SRBs targeting individual amino acid biosynthetic genes or operons. Cys, cysteine; Trp, tryptophan; Tyr, tyrosine; and His, histidine. Single-target strains were deficient in growth when minimal media was not supplemented with the cognate amino acid. Specifically, growth (OD 600) of each single-target strain without supplementation (white fill) was normalized relative to growth of the control (solid fill), the same strain with supplementation of its cognate amino acid. Furthermore, all double-target strains (Cys–Trp, Cys–Tyr, Cys–His; hatched fill) were deficient in growth when media was supplemented with only one of the two required amino acids. Relative growth of each double-target strain was assessed for each of its two cognate amino acids, separately, by normalizing relative to growth of each complementary single-target, single-supplement control. Values represent mean and SEM of biological duplicates.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Combinatorial Repression of Growth by Targeting Amino Acid Biosynthesis",
            "type": "paragraph"
        },
        {
            "text": "Design of pCRISPReporter and Quantification of Transcriptional Repression of Endogenous Genes",
            "normalized_header": [
                "result",
                "discussion"
            ],
            "section_header": "Design of pCRISPReporter and Quantification of Transcriptional Repression of Endogenous Genes",
            "type": "title"
        },
        {
            "text": "Rigorous part characterization is an integral element of the synthetic device assembly process, and precise control over expression of multiple proteins simultaneously using CRISPR arrays is predicated on the reliability of all individual spacers utilized during construction. In the absence of an observable or quantifiable phenotype corresponding to repression by a defined part, such as a single SRB, synthetic biologists must devise some metric to assess part quality. To date, dCas9-mediated repression of endogenous genes and promoters has primarily been evaluated by quantification of mRNA from the CDS of interest using qRT-PCR or RNA-seq. It is likely, however, that mRNA quantification is not accurate for assessment of functional protein expression in some cases because it accounts for neither translation initiation rate, thought to be the rate-limiting step in protein expression, nor unforeseen translational regulatory elements. Indeed, for many applications it would be more useful to evaluate repression in terms of protein quantity. Therefore, we have developed the fluorescent reporter plasmid pCRISPReporter along with a simple workflow to characterize individual SRBs in terms of protein abundance repression, a metric that should be more meaningful for immediately practical applications like metabolic engineering and for building predictable devices with protein-based parts. The procedure outlined here involves transfer of the promoter of interest and all surrounding endogenous transcriptional and translational control elements, from the start of the known operon through several N-terminal amino acids encoded in the CDS of interest, to the reporter plasmid to create a translational fusion of the front of the protein of interest with a fluorescent reporter protein. Assessment of repression of a gene in its genomic context is imperative when dealing with uncharacterized operons where potential for transcriptional read-through from unknown upstream promoters exists. Moreover, encompassing regions around the promoter leaves natural transcriptional regulator protein binding sites intact. The primary advantage over other methodologies that simply clone the promoter of interest upstream of an artificial CDS is that, with the CRISPReporter approach, translation initiation rate of the fluorescent reporter fusion should more accurately match that of the endogenous protein since the ribosome binding site (RBS) and regions primarily controlling translation initiation rate (5′ untranslated region through the N-terminal region of the CDS) are captured in the cloning process.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Design of pCRISPReporter and Quantification of Transcriptional Repression of Endogenous Genes",
            "type": "paragraph"
        },
        {
            "text": "The CRISPReporter cassette is illustrated in Figure. Key design features include transcriptional insulation with flanking high-strength, rho-independent transcriptional terminators; a novel multiple cloning site (MCS) including rare cut sites for cloning of the endogenous target region; a (GGGGS) 3 flexible linker peptide in-frame with adjacent NdeI and KpnI restriction sites for insertion of a user-defined reporter gene; and flanking isocaudamer (AvrII, XbaI, SpeI, and NheI) and SalI sites for assembling multiple CRISPReporter cassettes in a manner analogous to the ePathBrick assembly method. The CRISPReporter cassette can be placed on any plasmid that is compatible with pCRISPathBrick but was inserted into pETM6 for this study, and mCherry was inserted as the reporter. The manually curated online database EcoCyc was used to visualize target genes in their genomic contexts, to guide selection of genomic regions for cloning into pCRISPReporter, and to identify characterized promoters for design of spacers. Plasmids pCRISPReporter and pCRISPathBrick, harboring compatible origins of replication and resistance cassettes, are then cotransformed to characterize SRBs against targets encoded within pCRISPReporter.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Design of pCRISPReporter and Quantification of Transcriptional Repression of Endogenous Genes",
            "type": "paragraph"
        },
        {
            "text": "CRISPReporter feature and cloning strategy. A reporter gene is first cloned into NdeI and KpnI sites. Then a genomic region, containing a promoter of interest (P x) with the 5′ end of the gene of interest (geneX) and any surrounding transcriptional and translational control elements, is amplified from the genome with primers REI and REII, designed for cloning into the novel MCS (including rare cut-sites) to form a translational fusion of geneX with the (GGGGS) 3 flexible peptide linker and reporter. High-strength, rho-independent transcriptional terminators flanking this feature minimize transcriptional read-through into the reporter region from upstream on the plasmid and ensure proper termination of the reporter transcript. Finally, external isocaudomer sites (AvrII, XbaI, SpeI, and NheI), in combination with SalI, facilitate iterative combination of assembled CRISPReporter cassettes in a manner similar to ePathBrick for simultaneous quantification of repression at multiple target sites, where all CRISPReporter cassettes must carry unique, noninterfering reporters.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Design of pCRISPReporter and Quantification of Transcriptional Repression of Endogenous Genes",
            "type": "paragraph"
        },
        {
            "text": "We demonstrated the characterization of an SRB targeting an essential gene and another SRB targeting a nonessential gene. As we expect that tuning flux through major pathways using constitutive repression of essential enzymes to balance growth and production will be one of the most important uses of dCas9-mediated repression for metabolic engineering, we selected the essential gene pgk (encoding phosphoglycerate kinase) of the glycolytic pathway as a test case. A PCR amplicon containing the N-terminal region of pgk downstream of gene epd and its promoter, P epd, was cloned into the MCS of pCRISPReporter-mCherry because no intervening terminator is known to exist between epd and pgk. Although there are three known promoters (P pgk1–3) immediately preceding the pgk CDS, PGK is also encoded as part of the bicistronic transcript epd–pgk. Thus, accurate characterization of an SRB targeted to pgk requires accounting repression of lumped transcription from all of these promoters. A spacer was designed to bind the pgk CDS rather than the promoter, with the intent of achieving only intermediate transcriptional repression of this essential gene without significantly hindering growth. As seen in Figure, the selected spacer achieved 2-fold repression of the PGK reporter, indicating that CRISPathBrick could be a useful tool when gene essentiality precludes deletion from the genome.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Design of pCRISPReporter and Quantification of Transcriptional Repression of Endogenous Genes",
            "type": "paragraph"
        },
        {
            "text": "Quantification of dCas9-mediated repression of protein expression with CRISPReporter system. A user-defined CRISPathBrick array is cotransformed with pCRISPReporter harboring the cognate target region with 5′ end of gene of interest translationally fused to mCherry. Protospacers and PAMs are indicated as described for Figure. (a) Top: Schematic representation of the dual-plasmid reporter system, where essential glycolytic pathway gene pgk is targeted for repression in the CDS and rather than at the promoter to permit intermediate expression level. Bottom: End point repression (RFU/OD 650) of PGK-mCherry fusion reporter using nontargeting (NT) spacer array as a negative control. Approximately 2-fold repression compared to control is achieved during growth on all carbon sources tested (LB or minimal media supplemented with glucose or glycerol) and irrespective of total reporter expression level. (b) Top: Repression of nonessential dual-regulator gene fadR with spacer overlapping both known +1 sites. Bottom: End point repression of FadR-mCherry fusion reporter; approximately 10-fold repression is achieved in all medias despite significant variation in total reporter expression level. (c) Time-course study of FadR repression using CRISPReporter system in minimal media supplemented with glucose. Circle and square symbols represent OD 650, and bars represent RFU or RFU/OD 650. Top: Total reporter fluorescence (RFU) indicates significant increase in FadR expression after transition from log phase to stationary phase (marked by vertical red dashed line). Bottom: Relative FadR repression (RFU/OD 650) compared to nontargeting control; approximately 10–15-fold repression was sustained throughout the experiment. All values represent mean and SEM of biological duplicates.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Design of pCRISPReporter and Quantification of Transcriptional Repression of Endogenous Genes",
            "type": "paragraph"
        },
        {
            "text": "One potential application of CRISPathBrick is simultaneous repression of distinct native regulatory proteins, where targeting a small number of regulators would lead to synchronized activation and repression of a much larger pool of genes and, in turn, engender large coordinated perturbations of metabolism. We chose FadR as one such target because it is nonessential and because it controls a large regulon consisting of at least 13 promoters involved in transcription of at least 18 genes, enabling creation of a complex phenotype through manipulation of a single target. As the sole gene in its transcript, FadR is monocistronic and is immediately preceded by promoter P fadR, although experimental evidence exists for a second transcriptional start site 10 bp downstream of the +1 site of P fadR. Thus, the region sufficiently far upstream of the first promoter P fadR through several amino acids into the front end of the fadR CDS was cloned into the MCS of pCRISPReporter-mCherry, and an SRB designed to bind the top strand at a site overlapping both experimentally characterized +1 sites was cloned into pCRISPathBrick. Using this spacer, approximately 10-fold repression of protein expression was achieved throughout the duration of the time-course, but it is possible that higher repression could be achieved using other target sites in the promoter region. Notably, similar FadR repression levels were achieved irrespective of the rate of expression in the control strain, as demonstrated by consistent repression of approximately 10-fold before and after the apparent expression rate increase observed after the transition from exponential growth to stationary phase (Figure).",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Design of pCRISPReporter and Quantification of Transcriptional Repression of Endogenous Genes",
            "type": "paragraph"
        },
        {
            "text": "dCas9-Mediated Repression for Metabolic Engineering of E. coli",
            "normalized_header": [
                "result",
                "discussion"
            ],
            "section_header": "dCas9-Mediated Repression for Metabolic Engineering of E. coli",
            "type": "title"
        },
        {
            "text": "An overarching challenge in metabolic engineering is to successfully balance biomass production with conversion of raw materials into high-value products. The prevailing strategy to accomplish this goal has been rational selection of gene overexpression and deletion targets guided by pathway inspection. Increasingly, however, metabolic models are used to computationally identify genetic interventions required to meet a mathematically defined objective function, such as increased production of a target metabolite. CRISPathBrick is ideally suited as an alternative to achieving multiple gene deletions in a single strain for metabolic engineering because exploratory and model-guided repression of a set of endogenous genes (and all combinations) can be rapidly assessed in different chassis. Moreover, CRISPathBrick is particularly suitable for validation of predictions from contemporary algorithms that are formulated to specify intermediate gene downregulation levels required for maximum production. Another potential benefit of dCas9-mediated transcriptional repression over translational silencing strategies like antisense RNA is the polarity of CRISPR repression; that is, all genes downstream and under control of the silenced promoter are similarly repressed. As genes encoding related enzymes in metabolic pathways are often grouped into operons, which are frequently transcribed as polycistronic mRNA due to the lack of intervening terminators, targeting a single promoter could silence many or all of the critical enzymes in a biosynthetic pathway. Conversely, the disadvantage is that genes downstream of the target will be repressed if there is no intervening promoter, which could be problematic when downstream genes are essential, unrelated to the pathway of interest, or required for any other reason.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "dCas9-Mediated Repression for Metabolic Engineering of E. coli",
            "type": "paragraph"
        },
        {
            "text": "Encouraged by the feasibility of repressing endogenous regulator proteins and disparate targets simultaneously, we examined CRISPathBrick as a metabolic engineering tool for production of the plant flavonoid naringenin in. Three genes from the heterologous flavonoid pathway encoding the enzymes 4-coumaroyl-coenzyme A (CoA) ligase (4CL) from and chalcone synthase (CHS) and chalcone isomerase (CHI) from were synthesized and assembled into a single vector using the ePathBrick assembly procedure for conversion of p-coumaric acid to naringenin in (Figure a). This is an interesting pathway (Supporting Information Figure S1) because endogenous pools of free CoA and malonyl-CoA must be co-opted by 4CL and CHS, respectively, drawing valuable precursors away from large endogenous sink pathways like fatty acid biosynthesis. Indeed, malonyl-CoA has been proven to be the limiting factor in microbial flavonoid production. We first selected FadR as a novel target for improving naringenin production because it is a DNA-binding transcriptional dual-regulator that exerts negative control over fatty acid degradation (β-oxidation) and positively regulates fatty acid biosynthesis. Therefore, we speculated that 10-fold repression of FadR as exhibited by CRISPReporter would lead to increased accumulation of malonyl-CoA through reduction in fatty-acid production and of acetyl-CoA, the precursor of malonyl-CoA, as a β-oxidation product, thus driving greater yield of naringenin. Recently published work using evolution-guided genome mutagenesis to select for high-production phenotypes supports this notion, as strains with improved naringenin production capacity exhibited a propensity for mutations attenuating translation rate of genes in the fatty acid biosynthetic pathway. As hypothesized, FadR repression improved naringenin production by approximately 64% (from 7.6 to 12.5 mg/L) over the control strain possessing pCRISPathBrick with a nontargeting array (Figure d).",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "dCas9-Mediated Repression for Metabolic Engineering of E. coli",
            "type": "paragraph"
        },
        {
            "text": "Application of CRISPathBrick for metabolic engineering of naringenin production in. (a) Naringenin production plasmid pETM6-Vv4CL-m-CmCHS-m-CmCHI was cotransformed with pCRISPathBrick encoding metabolic engineering downregulation targets. (b) Investigation of a novel metabolic engineering target: schematic representation of CRISPathBrick array targeting dual-transcriptional regulator FadR. Repression of fadR transcription should lead to an increase in the intracellular malonyl-CoA (limiting metabolite in naringenin biosynthesis) pool through coordinated decrease in expression of fatty acid biosynthetic genes (green) and increase in expression of fatty acid degradation (β-oxidation) genes (red) belonging to the FadR regulon. (c) Simultaneous repression of three computationally predicted downregulation or deletion targets, P sucA, P fumC, and the start of the scpC CDS, that should lead to increased malonyl-CoA production through decreased flux through the TCA cyle and increased availability of free CoA. (d) Volumetric production of naringenin improves approximately 2-fold for each strategy tested, with the triple-target CRISPathBrick array leading to the highest production. Values represent mean and SEM of biological quadruplicates (duplicates from two independent experiments performed on different days).",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "dCas9-Mediated Repression for Metabolic Engineering of E. coli",
            "type": "paragraph"
        },
        {
            "text": "Next, in order to validate computationally predicted targets, we constructed a triple-target CRISPR array repressing expression of three enzymes as predicted by OptForce and previously described by our lab to augment naringenin production. Specifically, repression of fumarase (FumC) is thought to reduce carbon flux through the TCA cycle, whereas repression of succinyl-CoA synthetase (SucC or SucD) and propionyl-CoA:succinyl-CoA transferase (ScpC) should limit consumption of CoA for byproduct formation, freeing CoA for utilization by pyruvate dehydrogenase during oxidation of pyruvate to acetyl-CoA. The spacer of the first SRB was designed to target the promoter P sucA, which drives expression of operon sucABCD encoding subunits of both the succinyl-CoA synthetase complex and the 2-oxoglutarate dehydrogenase complex (SucAB). Repression of the entire operon is expected to be consistent with the objective, as both encoded enzymes utilize CoA for undesired formation of succinyl-CoA. The second spacer targets promoter P fumC1 to repress the monocistronic fumC transcript, and the third spacer targets the start of the scpC CDS, which, as the last gene in its operon, should not affect transcription of surrounding genes. Simultaneous repression of all three targets from a single CRISPR array yielded 18.9 mg/L naringenin, a 2.5-fold improvement in production over the nontargeting control strain (Figure d). Hence, we have shown, to the best of our knowledge, the first application of CRISPR/dCas9-mediated repression of endogenous targets for metabolic engineering.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "dCas9-Mediated Repression for Metabolic Engineering of E. coli",
            "type": "paragraph"
        },
        {
            "text": "In summary, we have presented CRISPathBrick, an assembly method to build functional type II-A CRISPR arrays capable of multiplex dCas9-mediated repression in divergent strains, and we demonstrate its utility for repressing transcription of endogenous genes. We have also developed the CRISPReporter system to characterize repression activity of individual SRB modules. The selective, predictable nature of CRISPR/dCas9-mediated repression will undoubtedly make it an integral component of synthetic circuits for the foreseeable future, but the capacity to effortlessly perturb multiple endogenous targets simultaneously will be pivotal for studies in many disciplines, from the basic sciences to systems biology and metabolic engineering. Although our intent in this work was to direct dCas9 to unique target sites, it is conceivable that a single spacer could be designed to target more than one genomic site, each with a slightly different sequence, where binding strength and repression level would differ between sites as controlled by the number and location of mismatches between the mature crRNA spacer and similar target sequences. If such sites can be found proximal to PAMs, then dCas9-mediated repression at these locations could be an intriguing tool to explore metabolic space, and CRISPathBrick could be used to build arrays of anticonsensus spacers for synergistic repression at multiple disparate consensus sequence families. We further envision that the CRISPathBrick design principle can be extrapolated to build arrays for evolutionarily distinct CRISPR systems, enabling selective transient control over user-defined sets of endogenous genes, where each synthetic regulon is controlled by its own orthogonal master regulator. Cloning vectors pCRISPathBrick, pCRISPReporter, and pCRISPReporter-mCherry are available to the community through Addgene (plasmids #65006-65008).",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "dCas9-Mediated Repression for Metabolic Engineering of E. coli",
            "type": "paragraph"
        },
        {
            "text": "Methods",
            "normalized_header": [
                "method"
            ],
            "section_header": "Methods",
            "type": "title"
        },
        {
            "text": "Strain and Plasmid Construction",
            "normalized_header": [
                "method"
            ],
            "section_header": "Strain and Plasmid Construction",
            "type": "title"
        },
        {
            "text": "Plasmids and strains used in this study are listed in Supporting Information Tables S1 and S2, respectively. PCR primers utilized for gene amplification and cloning are listed in Supporting Information Table S3 and were synthesized by Integrated DNA Technologies (IDT). pCRISPathBrick was modified from pdCas9, a gift from Luciano Marraffini (Addgene plasmid #46569), by double digestion with BsaI followed by ligation with the nontargeting spacer composed of two phosphorylated, annealed 35 bp offset ssDNA oligonucleotides with overhangs as previously described elsewhere (1xBsaI_F and 1xBsaI_R). Specifically, BLASTN of all potential protospacers of the nontargeting spacer (the spacer sequence concatenated with each of four NGG PAMs: 5′-TGAGAC­CTGTCTC­GGAAGC­TCATAG­GAC­TC N GG-3′, where N represents A/T/C/G) finds no BL21 or K-12 MG1655 genomic hits that are contiguous with the requisite PAM. The CRISPReporter cassette was synthesized as a gBlock (IDT; Supporting Information Table S5) and amplified with primers CRISPReporter_ApaI_F and CRISPReporter_SalI_R for ligation into ApaI/SalI sites of pETM6, inactivating the unneeded lacI, to form pCRISPathBrick. Codon-optimized mCherry was subcloned from pETM6-mCherry into NdeI/KpnI sites of the pCRISPReporter to form plasmid pCRISPReporter-mCherry. BL21 Star (DE3) genomic DNA (gDNA) was purified with an Invitrogen PureLink Genomic DNA minikit and used as a template for PCR amplification of genomic promoter regions. pCRISPReporter-FadR_mCherry_fusion was generated by cloning of the fadR promoter region, PCR amplified with primers fadR_prom_PacI_F and fadR_prom_XhoI_R, into PacI/XhoI sites of the MCS of pCRISPReporter-mCherry. Similarly, the epd–pgk region was PCR amplified with primers pgk_prom_PacI_F and pgk_prom_XhoI_R for insertion into PacI/XhoI sites of the pCRISPReporter-mCherry MCS to create plasmid pCRISPReporter-PGK_mCherry_fusion. Three genes from the flavonoid pathway, 4-coumaroyl-CoA ligase (from, GenBank accession no. JN858959), chalcone synthase and chalcone isomerase (both from, GenBank accession nos. GQ892059 and GU323285, respectively), were codon-optimized for expression in and synthesized by GenScript as shown in Supporting Information Table S5. These genes were sequentially subcloned from pUC57 to pETM6 in monocistronic configuration using the ePathBrick procedure as described by Xu and co-workers to yield plasmid pETM6-Vv4CL-m-CmCHS-m-CmCHI.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Strain and Plasmid Construction",
            "type": "paragraph"
        },
        {
            "text": "All plasmids were propagated and maintained in DH5α, and experiments were carried out using strains DH5α (Novagen), BL21 Star (DE3) (Invitrogen), BLΔ sucC, K-12 MG1655 (DE3), K-12 MG1655 JE1 (DE3), serovar O10:K5:H4, and Nissle 1917. K-12 MG1655 was obtained from the Coli Genetic Stock Center and lysogenized following commercial protocols with the λDE3 Lysogenization Kit (EMD Millipore) to integrate IPTG-inducible T7 polymerase into the genome. K-12 MG1655 JE1 (DE3) was created by integration of cassette T7-mCherry from pETM6-mCherry into the genome of K-12 MG1655 (DE3) using a previously reported method, modified slightly as described in Supporting Information Methods. BLΔ sucC, serovar O10:K5:H4, and Nissle 1917 were obtained from lab stock from previous studies. All restriction enzymes (FastDigest) were purchased from Thermo Scientific.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Strain and Plasmid Construction",
            "type": "paragraph"
        },
        {
            "text": "Construction of Spacer–Repeat Bricks",
            "normalized_header": [
                "method"
            ],
            "section_header": "Construction of Spacer–Repeat Bricks",
            "type": "title"
        },
        {
            "text": "All ssDNA oligonucleotides (IDT) utilized for construction of SRBs are listed in Supporting Information Table S4. Protospacers possessing the requisite 3′ PAM sequence (AGG, TGG, CGG, or GGG) were identified near promoters, and 30 nucleotides upstream of the PAM were selected as the spacer. For spacers designed to target in two strains, promoter regions were aligned in pairwise fashion, and a conserved protospacer + PAM sequence was selected. ssDNA oligos were designed as shown in Figure a, where the top strand was designed as follows: 5′-AAAC-[30 bp spacer sequence]-[GTTTTA­GAGCTA­TGCTGTT­TTGAAT­GGTCCCA]-3′. The bottom strand was designed as follows: 5′-[GTTTTG­GGACCAT­TCAAA­ACAGCA­TAGCT­CTAAAAC]-[30 bp reverse complement of spacer sequence]-3′. Both oligos were 5′ phosphorylated with polynucleotide kinase (New England Biolabs) and annealed overnight. Assembled SRBs were ligated into BsaI-digested, dephosphorylated, gel-purified pCRISPathBrick backbone and verified with cPCR. Prior to testing repression, CRISPathBrick arrays possessing synthetic SRBs were verified by sequencing.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Construction of Spacer–Repeat Bricks",
            "type": "paragraph"
        },
        {
            "text": "Growth Conditions",
            "normalized_header": [
                "method"
            ],
            "section_header": "Growth Conditions",
            "type": "title"
        },
        {
            "text": "Unless otherwise specified, all strains were cultured in rich semidefined media known as AMM and described previously (3.5 g/L KH 2 PO 4, 5.0 g/L K 2 HPO 4, 3.5 g/L (NH 4) 2 HPO 4, 2 g/L casamino acids, 100 mL 10× MOPS mix, 1 mL 1 M MgSO 4, 0.1 mL 1 M CaCl 2, 1 mL 0.5 g/L thiamine HCL, and 20 g/L glucose). 10× MOPS mix is composed of 83.72 g/L MOPS, 7.17 g/L tricine, 28 mg/L FeSO 4 ·7H 2 O, 29.2 g/L NaCl, 5.1 g/L NH 4 Cl, 1.1 g/L MgCl 2, 0.48 g/L K 2 SO 4, and 0.2 mL micronutrient stock. Micronutrient stock contains 0.18 g/L (NH 4) 6 Mo 7 O 24, 1.24 g/L H 3 BO 3, 0.12 g/L CuSO 4, 0.8 g/L MnCl 2, and 0.14 g/L ZnSO 4. Unless otherwise noted, all experiments were started by inoculating individual colonies in 1 mL of AMM with appropriate antibiotics (80 μg/mL of ampicillin, 25 μg/mL of chloramphenicol) in polypropylene 48-well plates (5 mL, VWR) and growing overnight in an orbital shaker incubator at 250 rpm and 37 °C. 48-well plates were always covered with sterile, breathable rayon adhesive film (VWR) to prevent contamination and limit evaporation. After 12–16 h, cultures were back-diluted to an OD 600 of 0.1 in 2 mL AMM in fresh 48-well plates and allowed to grow at 250 rpm and 37 °C. Media for pCRISPReporter strains was altered for overnights and inoculums, depending on specified carbon source. Specifically, Luria Broth (LB) Lennox modification (Sigma) was used for growth on undefined rich media, AMM was used for growth on glucose, and AMM with 20 g/L glycerol substituted in place of glucose was utilized for growth on glycerol. Defined minimal media, AuxMM, used for growth repression studies was prepared as described above for AMM but excluding casamino acids and MOPS. Amino acid (l-tryptophan, l-tyrosine, l-histidine, and l-cysteine, BioUltra, Sigma) stock solutions (100 mM) were filter sterilized and added to AuxMM as required to a final concentration of 62.5 μM.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Growth Conditions",
            "type": "paragraph"
        },
        {
            "text": "Fluorescence Assays",
            "normalized_header": [
                "method"
            ],
            "section_header": "Fluorescence Assays",
            "type": "title"
        },
        {
            "text": "Reporter strains were constructed by cotransformation of the reporter plasmid and the complementary pCRISPathBrick plasmid possessing the cognate SRB. For the chromosomally integrated T7-mCherry reporter, no reporter plasmid transformation was required. All T7-mCherry cultures were simultaneously induced with 0.1 mM IPTG after 4–4.5 h, at early mid log phase (OD 650 of 1–1.5). CRISPReporter constructs, which did not require induction, were characterized in BL21 Star (DE3). Fluorescence and OD 650 measurements were collected with a BioTek Synergy 4 plate reader using black-walled 96-well polystyrene plates (Greiner Bio One) after dilution into the linear range of the detector. mCherry fluorescence was measured at an excitation wavelength of 588 nm and emission wavelength of 618 nm. In all cases, fluorescence was normalized by OD 650, and repression was calculated relative to a control strain possessing the identical reporter and pCRISPathBrick with a single, nontargeting spacer. End point reporter values were obtained approximately 20 h after inoculation.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Fluorescence Assays",
            "type": "paragraph"
        },
        {
            "text": "Growth Assays",
            "normalized_header": [
                "method"
            ],
            "section_header": "Growth Assays",
            "type": "title"
        },
        {
            "text": "pCRISPathBrick plasmids containing the specified amino acid biosynthetic targets were transformed into DH5α. Individual colonies were inoculated in 5 mL of LB supplemented with 25 μg/mL chloramphenicol and grown at 250 rpm and 37 °C overnight in 15 mL conical tubes. After 12–16 h of growth, cultures were pelleted and gently washed twice with 5 mL of AuxMM without supplements to remove residual amino acids. The washed cultures were back-diluted to OD 600 of 0.01 in 2 mL of AuxMM supplemented with the indicated amino acid. The cultures were grown in polypropylene 48-well plates (5 mL) covered with sterile, breathable rayon film at 250 rpm and 37 °C for approximately 20 h, when the OD 600 was measured.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Growth Assays",
            "type": "paragraph"
        },
        {
            "text": "Metabolite Production and Quantification",
            "normalized_header": [
                "method"
            ],
            "section_header": "Metabolite Production and Quantification",
            "type": "title"
        },
        {
            "text": "All strains were transformed with pCRISPathBrick possessing either a nontargeting array (negative control) or the targeting arrays as described. K5 and Nissle 1917 cultures were inoculated from individual colonies into AMM and grown overnight. Cultures were back-diluted to an OD 600 of 0.1 in 3 mL of AMM with appropriate antibiotics in 48-well plates and were grown at 37 °C. Samples were harvested after 6 h by centrifugation for 15 min at 5000 g. Heparosan was quantified in the supernatant using disaccharide analysis as reported elsewhere with modifications as described in Supporting Information Methods. Naringenin fermentation was performed according to Xu et al. with modifications using BLΔ sucC. Individual colonies were preinoculated in LB broth with required antibiotics and grown at 250 rpm and 37 °C overnight. The overnight culture was inoculated into 40 mL of LB supplemented with 0.4% (w/v) d-glucose in 125 mL shake-flasks and grown at 30 °C and 225 rpm. When the culture reached OD 600 of 2.0, it was further grown at 20 °C and 225 rpm for 1 h for acclimatization before induction with 1.0 mM of IPTG to induce the protein expression under same conditions for an additional 4 h. The bacterial pellet was then harvested by centrifugation and resuspended in 16 mL of M9 modified medium (1× M9 salts, 8 g/L glucose, 1 mM MgSO 4, 0.1 mM CaCl 2, 6 μM biotin, 10 nM thiamine, 0.6 mM p-coumaric acid, 1 mM IPTG). Fermentation was performed in 125 mL flasks with orbital shaking at 300 rpm and 30 °C. Cell cultures were extracted with 50% ethanol after 36 h of fermentation; then, the cell pellet was removed by centrifugation (14 000 rpm for 5 min). The supernatant was analyzed for naringenin as described previously with slight modifications as described in Supporting Information Methods.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Metabolite Production and Quantification",
            "type": "paragraph"
        }
    ],
    "issue_pub_date": null,
    "electron_pub_date": "09/18/2015",
    "article_id": "10.1021/acssynbio.5b00012",
    "internal_id": "a356511131",
    "history": [
        {
            "event": "received",
            "time": "01/26/2015"
        },
        {
            "event": "asap",
            "time": "04/20/2015"
        },
        {
            "event": "issue-pub",
            "time": "09/18/2015"
        },
        {
            "event": "just-accepted",
            "time": "03/30/2015"
        }
    ],
    "type": "Research Article",
    "article_title": "CRISPathBrick: Modular Combinatorial Assembly of Type II‑A CRISPR Arrays for dCas9-Mediated Multiplex Transcriptional Repression in E. coli",
    "suppl_files": [
        {
            "suppl_filename": "sb-2015-00012q_si_001.pdf",
            "rpath": "sb5b00012/suppl/sb-2015-00012q_si_001.pdf",
            "sequences": ">a356511131_sb-2015-00012q_si_001.pdf_0\nAAACCGATCCCGCGAAATTAATACGACTCACTATGTTTTAGAGCTATGCTGTTTTGAATGGTCCCACGATCCCGCGAAATTAATACGACTCACTAT\n>a356511131_sb-2015-00012q_si_001.pdf_1\nAAACTTCCCCTATAGTGAGTCGTATTAATTTCGCGTTTTAGAGCTATGCTGTTTTGAATGGTCCCATTCCCCTATAGTGAGTCGTATTAATTTCGC\n>a356511131_sb-2015-00012q_si_001.pdf_2\nAAACATATGGTTTCAAAAGGCGAAGAAGACAACAGTTTTAGAGCTATGCTGTTTTGAATGGTCCCAATATGGTTTCAAAAGGCGAAGAAGACAACA\n>a356511131_sb-2015-00012q_si_001.pdf_3\nAAACAATTCGTGACCATTGACGCTGCCTTCCATGGTTTTAGAGCTATGCTGTTTTGAATGGTCCCAAATTCGTGACCATTGACGCTGCCTTCCATG\n>a356511131_sb-2015-00012q_si_001.pdf_4\nAAACGCAGTTCGTTCAGGGCGTTTAGATCGAGTTGTTTTAGAGCTATGCTGTTTTGAATGGTCCCAGCAGTTCGTTCAGGGCGTTTAGATCGAGTT\n>a356511131_sb-2015-00012q_si_001.pdf_5\nAAACGATCTTCATGGCCATGCAGGCGCATTAACAGTTTTAGAGCTATGCTGTTTTGAATGGTCCCAGATCTTCATGGCCATGCAGGCGCATTAACA\n>a356511131_sb-2015-00012q_si_001.pdf_6\nAAACGACGGTAATTCGCAGGCAGCCGCTTAAAGAGTTTTAGAGCTATGCTGTTTTGAATGGTCCCAGACGGTAATTCGCAGGCAGCCGCTTAAAGA\n>a356511131_sb-2015-00012q_si_001.pdf_7\nAAACTTATTTGAAATTCCCTTTCTGATTATCTCCGTTTTAGAGCTATGCTGTTTTGAATGGTCCCATTATTTGAAATTCCCTTTCTGATTATCTCC\n>a356511131_sb-2015-00012q_si_001.pdf_8\nAAACTGAGATTTCCATAACACAGCAAAACAAAGTGTTTTAGAGCTATGCTGTTTTGAATGGTCCCATGAGATTTCCATAACACAGCAAAACAAAGT\n>a356511131_sb-2015-00012q_si_001.pdf_9\nAAACAGGAACCTTTAAAAACTGTCTTAGTGTCAGGTTTTAGAGCTATGCTGTTTTGAATGGTCCCAAGGAACCTTTAAAAACTGTCTTAGTGTCAG\n>a356511131_sb-2015-00012q_si_001.pdf_10\nAAACCTTATTATTTACCATTTGATAACAAATGTTGTTTTAGAGCTATGCTGTTTTGAATGGTCCCACTTATTATTTACCATTTGATAACAAATGTT\n>a356511131_sb-2015-00012q_si_001.pdf_11\nAAACTATGCTGGATAATTTCTGCCGCTTCATTGGGTTTTAGAGCTATGCTGTTTTGAATGGTCCCATATGCTGGATAATTTCTGCCGCTTCATTGG\n>a356511131_sb-2015-00012q_si_001.pdf_12\nGGAAAGGGCCCGCTGGGAGTTCGTAGACGGACCTAGGTCTAGATTCAGCCAAAAAACTTAAGACCGCCGGTCTTGTCCACTACCTTGCAGTAATGCGGTGGACAGGATCGGCGGTTTTCTTTTCTCTTCTCAACATTACTCGCATCCATTCTCGGCGATCGCGCGGCCGCTTTAATTAAGAATTCAAGCTTAGATCTCAATTGCTCGAGGGCGGTGGCGGTAGTGGCGGTGGCGGTTCCGGCGGTGGCGGTTCACATATGGCACTGAAGGTCCTCAATCGCACTGGAAACATCAAGGTCGGGTACCGGAAACACAGAAAAAAGCCCGCACCTGACAGTGCGGGCTTTTTTTTTCGACCAAAGGAGGCTGTCTCGTCTCGTCTCACTAGTGCTAGCAACAAACGCAGAATCCAAGCGTCGACAAGGG\n>a356511131_sb-2015-00012q_si_001.pdf_13\nATGATTAGTATTGAAACGCAAAACCCGGATGTTAGCAACCTGGACACCTCGCACTCTATTCCGAAAATGGCAAACCGTATTGATGACCATGTGTTTCGTTCTAAACTGCCGGAAATTCCGATCAGTAACCATCTGCCGCTGCACACGTATTGCTTCGAAAATTACTCGCAGTTTGCAGACCGTCCGTGTCTGATTGTTGGCTCGACGAACAAAACCTATAGCTTCGCTGAAACCCATCTGATCTCTCGCAAAGTGGGCGCAGGTTTTGCTCACCTGGGTCTGAAACAGGGCGATGTGGTTATGATTCTGCTGCAAAATTGCGCGGAATTTGCCTTCAGCTTTCTGGGTGCGTCTATGGTTGGCGCCGTCACCACGACCGCAAACCCGTTCTACACGTCCGCGGAAATCTTCAAACAGCTGAACGCATCAAAAGCTAAAATCGTCGTGACCCAGGCGCAATATGTGGATAAACTGCGCGACTACCCGGATGGTCAAGTTGCCAAAATTGGCGAAGGTTTCACGGTCATTACCATCGATGACCCGCCGGAAAACTGTATGCATTTTAGTGTTGTCTCCGAAGCGAACGAAAGCGAACTGCCGGAAGTCTCAATTAATTCGGATGACCCGGTGGCCCTGCCGTTTAGCTCTGGTACGACCGGCCTGCCGAAAGGCGTGGTTCTGACGCACAAATCACTGATCACCTCGGTCGCCCAGCAAGTGGATGGTGAAAACCCGAATCTGCATCTGACCCCGGATGACGTCGTGCTGTGCGTGCTGCCGCTGTTCCACATTTATAGCCTGAACTCTGTTCTGCTGTGTAGTCTGCGTGCAGGTGCAGCAGTGCTGCTGATGCAGAAATTTGAAATTGGTACCCTGCTGGAACTGATCCAACGTTACCGCGTGAGCGTTGCAGCTGTTGTCCCGCCGCTGGTTCTGGCACTGGCTAAAAATCCGATGGTGGAATCGTTTGATCTGAGTTCCATCCGTGTGGTTCTGAGCGGTGCAGCACCGCTGGGCAAAGAACTGGAAGCAGCTCTGCGTTCCCGCGTTCCGCAGGCAGTCCTGGGCCAAGGTTATGGCATGACGGAAGCAGGCCCGGTGCTGTCAATGTGCCTGGGTTTCGCTAAACAGCCGTTTCCGACGAAATCAGGTTCGTGTGGCACCGTCGTGCGTAACGCGGAACTGAAAGTTGTGGATCCGGAAACCGGTTGCTCCCTGGGCCGTAATCAGCCGGGTGAAATTTGTATCCGCGGCCAGCAAATTATGAAAGGTTATCTGAATGATCCGGAAGCGACGGCCTCTACCATTGACGTTGATGGCTGGCTGCATACCGGTGACATCGGCTACGTGGATGACGATGAAGAAGTGTTCATTGTTGATCGCGTCAAAGAACTGATCAAATTCAAAGGTTTTCAGGTTCCGCCGGCAGAACTGGAAGCTCTGCTGGTGTCTCACCCGTCCATTGCCGATGCGGCCGTGGTTCCGCAAAAAGACGATGTTGCTGGCGAAGTCCCGGTGGCGTTCGTCGTGCGTTCTAACGGTTTTGAACTGACCGAAGAAGCAGTGAAAGAATTCATCAGTAAACAGGTTGTCTTTTATAAACGCCTGCATAAAGTGTACTTTGTTCACGCGATTCCGAAAAGCCCGTCTGGCAAAATCCTGCGTAAAGATCTGCGCGCGAAACTGGCCGAAAAAACCCCGGAACCGAAC\n>a356511131_sb-2015-00012q_si_001.pdf_14\nATGGCTACGGTCCAAGAAATCCGCAACGCTCAACGCGCAGATGGTCCGGCGACGGTCCTGGCAATCGGCACGGCAACCCCGGCTCATAGCGTGAACCAGGCAGATTATCCGGACTATTACTTTCGTATTACCAAATCTGAACACATGACGGAACTGAAAGAAAAATTCAAACGTATGTGCGATAAAAGTATGATTAAAAAACGCTACATGTACCTGACCGAAGAAATCCTGAAAGAAAACCCGAATATGTGTGCCTACATGGCACCGAGCCTGGATGCGCGCCAGGACATTGTGGTTGTCGAAGTTCCGAAACTGGGTAAAGAAGCGGCCACCAAAGCCATCAAAGAATGGGGCCAACCGAAATCAAAAATTACGCACCTGATCTTTTGCACCACGTCGGGTGTGGATATGCCGGGTGCAGACTATCAGCTGACCAAACTGCTGGGTCTGCGTCCGAGCGTTAAACGCTTTATGATGTACCAGCAAGGCTGCTTCGCAGGCGGTACGGTCCTGCGTCTGGCTAAAGATCTGGCGGAAAACAATAAAGGTGCTCGCGTTCTGGTGGTTTGTAGTGAAATTACCGCTGTCACGTTTCGTGGTCCGGCGGATACCCATCTGGACTCCCTGGTTGGCCAGGCCCTGTTCGGCGATGGTGCAGCTGCGGTTATCGTCGGCGCAGATCCGGACACGAGTGTGGAACGTCCGCTGTATCAGCTGGTTTCAACCTCGCAAACGATTCTGCCGGATTCCGACGGTGCGATCGATGGCCATCTGCGCGAAGTGGGTCTGACCTTTCACCTGCTGAAAGACGTTCCGGGCCTGATTTCAAAAAACATCGAAAAAAGCCTGTCTGAAGCCTTTGCACCGGTTGGTATTTCGGATTGGAGCTCTATTTTCTGGATCGCACATCCGGGCGGTCCGGCAATCCTGGACCAGGTGGAAAGCAAACTGGGTCTGAAAGAAGAAAAACTGAAAGCTACCCGTCAAGTCCTGTCTGAATACGGCAATATGAGTTCCGCGTGTGTGCTGTTCATTCTGGATGAAATGCGCAAAAAATCTGCCGAAGAAGCTAAAGCGACCACGGGCGAAGGTCTGGATTGGGGCGTGCTGTTTGGTTTCGGTCCGGGTCTGACCGTCGAAACGGTCGTGCTGCACAGTGTGCCGATCAAAGCG\n>a356511131_sb-2015-00012q_si_001.pdf_15\nATGAATCCGTCGCCGTCTGTTACCGAACTGCAAGTGGAAAATGTCACCTTTACGCCGAGTCTGCAACCGCCGGGCTCTACCAAATCGCATTTTCTGGGCGGTGCAGGTGAACGTGGCCTGGAAATCGAAGGCAAATTTGTTAAATTCACCGCTATTGGTGTCTATCTGGAAGAAAACGCCGTGCCGCTGCTGGCAGGCAAATGGAAAGGCAAAACCGCCGGTGAACTGACGGAATCTGTCGAATTTTTCCGCGATGTGGTTACCGGCCCGTTTGAAAAATTCATGAAAGTGACCATGATCCTGCCGCTGACGGGTGCGCAGTATTCAGAAAAAGTTGCTGAAAATTGCATGGCGATTTGGAAATTTTTCGGCATCTACACCGATGCAGAAGCTAAAGCGATTGAAAAATTTACGGAAGTGTTCAAAGACGAAATTTTTCCGCCGGGCAGCTCTATCCTGTTCACCCAAAGTTCCGGTTCGCTGACGATTTCATTTTCGAAAGATGGCAGCATCCCGAAAGACGGTGTCGCGGTGATTGAAAACAATCTGCTGAGCGAAGCCGTTCTGGAATCTATGATCGGTAAAAACGGCGTCAGTCCGGCGGCCAAAAAATCCCTGGCCGAACGTCTGTCAGCACTGCTGAATGTTGCTTCCGACAAAATGAAA\n>a356511131_sb-2015-00012q_si_001.pdf_16\nGGAAAGGGCCCGCTGGGAGTTCGTAG\n>a356511131_sb-2015-00012q_si_001.pdf_17\nCCCTTGTCGACGCTTGGATTCTGC\n>a356511131_sb-2015-00012q_si_001.pdf_18\nCGCTTTAATTAATCGGGGGACTGGCCCAAAAAATTGC\n>a356511131_sb-2015-00012q_si_001.pdf_19\nGGAGGACTCGAGGCCAATTAATTCTGAAAGTTCACG\n>a356511131_sb-2015-00012q_si_001.pdf_20\nCGCTTTAATTAAACTGAAGAAGGCCGGTATCAC\n>a356511131_sb-2015-00012q_si_001.pdf_21\nGGGAACTCGAGGAGGTAATCTTTAACCAGACG\n>a356511131_sb-2015-00012q_si_001.pdf_22\nCGCGCGGGCCCATGCGTCCGGCGTAGCCTA\n>a356511131_sb-2015-00012q_si_001.pdf_23\nCGCCAATCCGGATATAGTCGAC\n>a356511131_sb-2015-00012q_si_001.pdf_24\nCAAAAAGCGGTCAAATTATACGGTGCGCCCCCGTGATTTCAAACAATAAGTACGGCCCCAAGGTCCAAACGGTGA\n>a356511131_sb-2015-00012q_si_001.pdf_25\nATAACGTGGCTTTTTTTGGTAAGCAGAAAATAAGTCATTAGTGAAAATATTTGGCTTCAGGGATGAGGCGCCATC\n>a356511131_sb-2015-00012q_si_001.pdf_26\nCAGGTTATCTTTGCTCCTTG\n>a356511131_sb-2015-00012q_si_001.pdf_27\nCTTCGTCAGGTGCAACATGAGC\n>a356511131_sb-2015-00012q_si_001.pdf_28\nCTGAATGAACTGCAGGACGA\n>a356511131_sb-2015-00012q_si_001.pdf_29\nCAGTAACTGAACGAGCAGAAG\n>a356511131_sb-2015-00012q_si_001.pdf_30\nCGGATGCTTAACGTACGCTTTCG\n>a356511131_sb-2015-00012q_si_001.pdf_31\nAAACTGAGACCTGTCTCGGAAGCTCATAGGACTCG\n>a356511131_sb-2015-00012q_si_001.pdf_32\nAAAACGAGTCCTATGAGCTTCCGAGACAGGTCTCA\n>a356511131_sb-2015-00012q_si_001.pdf_33\nGTTTTGGGACCATTCAAAACAGCATAGCTCTAAAACATAGTGAGTCGTATTAATTTCGCGGGATCG\n>a356511131_sb-2015-00012q_si_001.pdf_34\nGTTTTGGGACCATTCAAAACAGCATAGCTCTAAAACGCGAAATTAATACGACTCACTATAGGGGAA\n>a356511131_sb-2015-00012q_si_001.pdf_35\nGTTTTGGGACCATTCAAAACAGCATAGCTCTAAAACTGTTGTCTTCTTCGCCTTTTGAAACCATAT\n>a356511131_sb-2015-00012q_si_001.pdf_36\nGTTTTGGGACCATTCAAAACAGCATAGCTCTAAAACCATGGAAGGCAGCGTCAATGGTCACGAATT\n>a356511131_sb-2015-00012q_si_001.pdf_37\nGTTTTGGGACCATTCAAAACAGCATAGCTCTAAAACAACTCGATCTAAACGCCCTGAACGAACTGC\n>a356511131_sb-2015-00012q_si_001.pdf_38\nGTTTTGGGACCATTCAAAACAGCATAGCTCTAAAACTGTTAATGCGCCTGCATGGCCATGAAGATC\n>a356511131_sb-2015-00012q_si_001.pdf_39\nAAACATGCTCGTTTGCGATAGTTGATCCTCAGCGGTTTTAGAGCTATGCTGTTTTGAATGGTCCCA\n>a356511131_sb-2015-00012q_si_001.pdf_40\nATGCTCGTTTGCGATAGTTGATCCTCAGCG\n>a356511131_sb-2015-00012q_si_001.pdf_41\nGTTTTGGGACCATTCAAAACAGCATAGCTCTAAAACCGCTGAGGATCAACTATCGCAAACGAGCAT\n>a356511131_sb-2015-00012q_si_001.pdf_42\nGTTTTGGGACCATTCAAAACAGCATAGCTCTAAAACTCTTTAAGCGGCTGCCTGCGAATTACCGTC\n>a356511131_sb-2015-00012q_si_001.pdf_43\nGTTTTGGGACCATTCAAAACAGCATAGCTCTAAAACGGAGATAATCAGAAAGGGAATTTCAAATAA\n>a356511131_sb-2015-00012q_si_001.pdf_44\nGTTTTGGGACCATTCAAAACAGCATAGCTCTAAAACACTTTGTTTTGCTGTGTTATGGAAATCTCA\n>a356511131_sb-2015-00012q_si_001.pdf_45\nGTTTTGGGACCATTCAAAACAGCATAGCTCTAAAACCTGACACTAAGACAGTTTTTAAAGGTTCCT\n>a356511131_sb-2015-00012q_si_001.pdf_46\nGTTTTGGGACCATTCAAAACAGCATAGCTCTAAAACAACATTTGTTATCAAATGGTAAATAATAAG\n>a356511131_sb-2015-00012q_si_001.pdf_47\nGTTTTGGGACCATTCAAAACAGCATAGCTCTAAAACCCAATGAAGCGGCAGAAATTATCCAGCATA\n"
        }
    ]
}