{
    "pub_num": "sb5b00002",
    "is_research": true,
    "keywords": [
        "synthetic biology",
        "type 3 secretion system",
        "protein delivery",
        "bacterial engineering"
    ],
    "abstract": [
        "Many Gram-negative pathogens encode type 3 secretion systems, sophisticated nanomachines that deliver proteins directly into the cytoplasm of mammalian cells. These systems present attractive opportunities for therapeutic protein delivery applications; however, their utility has been limited by their inherent pathogenicity. Here, we report the reengineering of a laboratory strain of with a tunable type 3 secretion system that can efficiently deliver heterologous proteins into mammalian cells, thereby circumventing the need for virulence attenuation. We first introduced a 31 kB region of DNA that encodes all of the information needed to form the secretion nanomachine onto a plasmid that can be directly propagated within or integrated into the chromosome. To provide flexible control over type 3 secretion and protein delivery, we generated plasmids expressing master regulators of the type 3 system from either constitutive or inducible promoters. We then constructed a Gateway-compatible plasmid library of type 3 secretion sequences to enable rapid screening and identification of sequences that do not perturb function when fused to heterologous protein substrates and optimized their delivery into mammalian cells. Combining these elements, we found that coordinated expression of the type 3 secretion system and modified target protein substrates produces a nonpathogenic strain that expresses, secretes, and delivers heterologous proteins into mammalian cells. This reengineered system thus provides a highly flexible protein delivery platform with potential for future therapeutic applications."
    ],
    "body": [
        {
            "text": "Designer microbes are being developed as drug delivery systems for the treatment and/or prevention of disease. A common approach is to repurpose a bacterium’s intrinsic biological systems/machines, which are already optimized for function by evolution. A therapeutic strategy that is gaining increasing interest is to engineer bacterial protein secretion systems to directly deliver bioactive payloads into mammalian cells. Type 3 secretion systems (T3SS) are trans-kingdom protein delivery devices that are used in nature to inject virulence proteins into host cells and are common to many Gram-negative bacterial human pathogens, including Shigella, Salmonella, Yersinia, and Pseudomonas.",
            "normalized_section_header": [],
            "section_header": null,
            "type": "paragraph"
        },
        {
            "text": "Type 3 secretion systems are complex nanomachines that assemble to form a syringe-like structure that spans the inner and outer membranes of Gram-negative bacteria as well as the mammalian plasma cell membrane, forming a conduit for the direct delivery of bacterial proteins into the cytoplasm of target cells. Over the course of an infection, pathogens use these secretion systems to inject tens of proteins, referred to as effectors, into mammalian cells. The effectors target and regulate mammalian host cell processes to promote bacterial survival and replication. Extensive studies have established that type 3 effectors are designated as secreted substrates by sequences confined to their N-terminal 50–100 amino acids. When fused to heterologous proteins of either of prokaryotic or eukaryotic origin, these sequences are sufficient to generate variants that are recognized and secreted by the T3SS machinery.",
            "normalized_section_header": [],
            "section_header": null,
            "type": "paragraph"
        },
        {
            "text": "Existing efforts toward developing T3SSs as therapeutics have focused on using virulence-attenuated pathogenic bacteria for protein delivery. Several strategies have been pursued to render these delivery strains avirulent, including the generation of auxotrophs, isolation of type 3 secretion-competent minicells, and the use of successive genetic manipulations to remove individual virulence genes from the genome. Recent studies have shown some success using these strategies to deliver antigenic molecules for vaccine development and transcription factors to alter gene expression in mammalian cells.",
            "normalized_section_header": [],
            "section_header": null,
            "type": "paragraph"
        },
        {
            "text": "However, while these attenuated-bacterial-based approaches are promising, the use of attenuated pathogens in humans, particularly those that are immunocompromised, will be limited. Theoretically, a pathogenic strain could be generated that no longer expresses any virulence proteins, but this is not a practical strategy, as most pathogens encode multiple virulence determinants, some of which are likely not currently known. For these reasons, we sought to develop a system in which type 3 secretion system functions could be introduced into a nonpathogenic, easily culturable laboratory strain. Here, we describe the generation of nonpathogenic strains of that encode a functional T3SS from a pathogen,, and show that these strains are fully capable of delivering heterologous proteins into mammalian cells. In particular, using a synthetic biology-based approach, we developed a protein delivery system composed of three discrete parts: (1) the machine, composed of the operons required for a functional T3SS from, (2) the activator, one of the regulators of T3SS expression, and (3) the substrates, target proteins fused to an N-terminal type 3 secretion sequences that promote their secretion without perturbing their activity. When these three parts are coexpressed in, the result is a nonpathogenic strain that can express, secrete and deliver a variety of heterologous proteins into mammalian cells (Figure). Importantly, this delivery system is easily adaptable for a variety of biotechnological purposes, as the type 3 activator and target protein expression constructs can be propagated in the delivery strain on separate but compatible plasmids that can be easily interchanged.",
            "normalized_section_header": [],
            "section_header": null,
            "type": "paragraph"
        },
        {
            "text": "Components of the bacterial protein delivery system in. (1) The delivery apparatus encodes the genes required to assemble a functional type 3 secretion system (T3SS) from. When T3SS genes are expressed, the secretion system assembles in the bacterial inner and outer membranes. Upon contact with a eukaryotic target cell, the secretion system forms a conduit between the bacterial and target cell that allows for protein delivery directly into the target cell cytoplasm. (2) The type 3 genes are activated by the VirB transcription factor, whose expression is induced either from a lac promoter by the addition of IPTG or from its native promoter, which is, in turn, activated by the expression of the VirB transcriptional activator, VirF. (3) The type 3 secreted substrates are target protein(s) fused to type 3 secretion sequence (SS) at their N-termini. Expression of the target protein is induced by the presence of IPTG and can be coordinated with expression of the type 3 secretion apparatus genes.",
            "normalized_section_header": [],
            "section_header": null,
            "type": "paragraph"
        },
        {
            "text": "By utilizing the common laboratory strain of, DH10β, as the platform for a protein delivery system, we demonstrate that pathogen attenuation may not be required in order to achieve therapeutic application of T3SS, as the normal repertoire of virulence determinants is absent in our reengineered system. The type 3 secretion competent strains described here thus represent a novel and highly promising biologic-based platform for the targeted delivery of defined therapeutic molecules into mammalian cells.",
            "normalized_section_header": [],
            "section_header": null,
            "type": "paragraph"
        },
        {
            "text": "Results and Discussion",
            "normalized_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "title"
        },
        {
            "text": "The overall scheme of the engineered bacterial protein delivery system is outlined in Figure. Activation of T3SS genes is coordinated with expression of a target protein modified with a type 3 secretion sequence on its N-terminus such that it is recognized as a secreted substrate. Upon contact with a mammalian cell, these reengineered deliver target protein(s) into the host cell cytoplasm.",
            "normalized_section_header": [
                "result",
                "discussion"
            ],
            "section_header": "Results and Discussion",
            "type": "paragraph"
        },
        {
            "text": "Introduction of the S. flexneri Type 3 Secretion System into E. coli",
            "normalized_header": [
                "introduction"
            ],
            "section_header": "Introduction of the S. flexneri Type 3 Secretion System into E. coli",
            "type": "title"
        },
        {
            "text": "Given our interest in developing a nonpathogenic protein delivery strain for therapeutic purposes, our efforts focused on introducing a functional type 3 secretion-based system into DH10β, a laboratory strain of that, like most Gram-negative bacteria, secretes few, if any, proteins into the extracellular milieu (Supporting Information Figure S1). To accomplish this, we chose to introduce the type 3 secretion apparatus from the phylogenetically related Shigella into. In Shigella, the genes needed for a functional secretion system, as well as almost all of its secreted substrates, are present on a large 220 kb plasmid, referred to as the Shigella virulence plasmid. The genes encoding the majority of secreted effectors are dispersed throughout the virulence plasmid, whereas those needed to form the type 3 secretion apparatus are contained in a series of large adjacent operons encompassing ∼31 kb of DNA (Supporting Information Figure S2). By isolating this region of DNA, we reasoned that we could introduce the components needed to form a Shigella T3SS and just four of its >30 known effectors into.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Introduction of the S. flexneri Type 3 Secretion System into E. coli",
            "type": "paragraph"
        },
        {
            "text": "To capture this region of the Shigella virulence plasmid onto a smaller autonomously replicating plasmid, we utilized a combination of yeast and bacterial homologous recombination-based approaches to generate pmT3SS (see Figure and Methods for details). Several features of the vector backbone of pmT3SS enable the transfer of this large 44 kb plasmid between bacteria as well as the stable integration of the Shigella operons that it carries onto the chromosome. First, the backbone of pmT3SS includes an origin of transfer region (oriT) to facilitate the transfer of this plasmid from one strain background to another via conjugation. Second, the region of the Shigella operons present on pmT3SS is flanked on each end by a defined “landing pad” sequence such that this region of DNA can be integrated onto the chromosome of engineered to have the corresponding “landing pad” sequence. In this manner, the methodology developed by Kuhlman and Cox was adapted to add large captured regions of DNA at specific chromosomal loci, an approach that can be easily adapted to capture other large pieces of DNA. The introduction of mT3SS into the chromosome alleviates the need for antibiotic selection, thus resulting in a strain, mT3, that should be particularly well-suited for use as an in vivo therapeutic protein delivery system.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Introduction of the S. flexneri Type 3 Secretion System into E. coli",
            "type": "paragraph"
        },
        {
            "text": "Generation of mT3, the protein delivery strain. A kanamycin-resistance cassette (striped box) was inserted into a nonessential region of the virulence plasmid to assist in selection of proper recombination events with the capture vector. A capture vector was constructed that contains regions of homology to the regions of the Shigella virulence plasmid flanking the type 3 secretion genes, which are represented as gray boxes. Landing pad (LP) sequence, denoted as a green box, flanks the pieces of T3SS gene homology to facilitate downstream integration into the chromosome. An origin of transfer (oriT), which can mobilize the plasmid between bacterial host strains by conjugation, is represented by a black oval. λ-Red recombination was then used to introduce the region of the Shigella virulence plasmid that contains the T3SS genes onto the capture vector. The resulting 44 kb plasmid (pmT3SS) contains the entire T3SS. When pmT3SS is introduced into a strain of harboring an engineered landing pad sequence, recombination leads to integration of the intervening sequence, in this case the T3SS operons, into the chromosome, generating the strain mT3.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Introduction of the S. flexneri Type 3 Secretion System into E. coli",
            "type": "paragraph"
        },
        {
            "text": "Regulation of Expression of Type 3 Secretion in mT3 E. coli",
            "normalized_header": [
                "introduction"
            ],
            "section_header": "Regulation of Expression of Type 3 Secretion in mT3 E. coli",
            "type": "title"
        },
        {
            "text": "To evaluate the potential of mT3 as a protein delivery strain, we first investigated whether this strain expresses a functional type 3 secretion system. mT3 was grown under conditions that activate Shigella type 3 secretion: growth at 37 °C followed by the addition of the dye Congo Red, an in vitro inducer of type 3 secretion. Cell lysate and secreted fractions were examined for the presence of IpaB and IpaD, two secreted components of the Shigella translocon apparatus and the outermost proteins of the machine. However, in contrast to wild-type Shigella, we observed no evidence of the production or secretion of IpaB or IpaD from mT3, suggesting that an essential type 3 secretion regulator was missing from this strain (Figure a).",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Regulation of Expression of Type 3 Secretion in mT3 E. coli",
            "type": "paragraph"
        },
        {
            "text": "mT3 secretes and delivers proteins into mammalian cells. Shigella and mT3 strains were grown under conditions that induce type 3 secretion system expression. Secretion was induced by exposure to Congo Red dye, and delivery was induced by bacterial contact with mammalian cells. (a) Western blot analysis of T3SS apparatus proteins in mT3. Whole cell lysate and supernatant proteins were separated by SDS-PAGE and immunoblotted with anti-IpaB or anti-IpaD antibodies. DnaK is a cytoplasmic protein unrelated to type 3 secretion and serves as a loading and bacterial cell lysis control. (b) Plasmids expressing FLAG-tagged versions of native Shigella effectors were introduced into each strain background, and cell lysate (L) and secreted proteins (S) were probed with anti-FLAG antibodies. The blots shown are representative of at least three experiments. Each strain was transformed with a target protein (substrate) plasmid that expresses an IPTG-inducible construct of an OspB–TEM-1 fusion protein illustrated in (c). (d) Images of HeLa cells loaded with CCF4/AM exposed to wild-type Shigella or mT3 strains expressing OspB–TEM-1. (e) Translocation was quantified by measuring the percentage of cells that fluoresce blue (cleaved CCF4/AM). Data are expressed as the mean of three independent experiments performed in triplicate. Error bars represent the standard error of the mean (SEM). At least 600 cells were counted for each sample.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Regulation of Expression of Type 3 Secretion in mT3 E. coli",
            "type": "paragraph"
        },
        {
            "text": "There are two transcription factors in Shigella that regulate expression of the T3SS, VirF and VirB. When the bacteria are grown at 37 °C, VirF promotes transcription of VirB, which, in turn, activates transcription of the type 3 secretion operons (Supporting Information Figure S3). The gene encoding VirB, but not VirF, is present within the region of Shigella DNA introduced into mT3 (Supporting Information Figure S2), suggesting that addition of virF to mT3 would be sufficient to activate expression of the T3SS genes. Indeed, the introduction into mT3 of a plasmid that carries virF under the control of its endogenous promoter results in a strain, mT3_virF endo, that expresses and secretes IpaB and IpaD at levels similar to those of wild-type Shigella when exposed to the dye Congo Red (Figure a and Supporting Information Figure S1). These experiments demonstrate that the expression of a single protein, VirF, is sufficient to trigger type 3 secretion activation in mT3.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Regulation of Expression of Type 3 Secretion in mT3 E. coli",
            "type": "paragraph"
        },
        {
            "text": "We next investigated whether it would be possible to bypass the requirement for VirF by placing VirB expression under the control of a regulatable promoter. We introduced a plasmid into mT3 in which expression of virB is driven from an IPTG-inducible promoter to generate the strain mT3_virB IPTG. Induction of VirB expression effectively activates type 3 expression, although this strain secretes slightly decreased levels of IpaB and IpaD as compared to those in mT3_virF endo (Figure a). Importantly, this data indicates that using regulatable promoters to drive expression of either VirB or VirF could provide a method to control the activation of type 3 secretion such that proteins are delivered only under defined conditions. This approach could be particularly useful for in vivo purposes, as it should be possible to control T3SS gene expression temporally or in response to environmental cues such as temperature, low oxygen, or the presence of specific metabolites or ions, as long as a suitable promoter can be identified and cloned.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Regulation of Expression of Type 3 Secretion in mT3 E. coli",
            "type": "paragraph"
        },
        {
            "text": "mT3 E. coli Secrete Native Type 3 Effectors",
            "normalized_header": [
                "introduction"
            ],
            "section_header": "mT3 E. coli Secrete Native Type 3 Effectors",
            "type": "title"
        },
        {
            "text": "Once we established conditions under which mT3 express the type 3 secretion apparatus, we investigated whether mT3 would recognize Shigella effectors as secreted substrates. While many effectors require the presence of a cognate chaperone to promote their recognition as a secreted substrate, this is not the case for at least half of the currently known Shigella effectors. To gauge the substrate plasticity of mT3, we tested whether a representative chaperoned (OspD2) and a nonchaperoned (OspG) effectors are recognized as secreted substrates by mT3. While the genes for OspG and OspD2 are not present in mT3, the gene for spa15, the OspD2 chaperone, is present (Supporting Information Figure S2). Plasmids carrying epitope (FLAG)-tagged versions of each effector under the control of an IPTG-driven promoter were introduced into wild-type Shigella as well as mT3, mT3_virB IPTG, and mT3_virF endo. When these strains are grown under conditions that induce type 3 secretion, mT3_virB IPTG and mT3_virF endo secrete OspG and OspD2 at levels equivalent to or slightly lower than those in Shigella, respectively (Figure b). These data confirm that mT3 in is functional and capable of recognizing effectors as secreted proteins.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "mT3 E. coli Secrete Native Type 3 Effectors",
            "type": "paragraph"
        },
        {
            "text": "mT3 E. coli Can Deliver Effectors Directly into the Cytosol of Mammalian Cells",
            "normalized_header": [
                "introduction"
            ],
            "section_header": "mT3 E. coli Can Deliver Effectors Directly into the Cytosol of Mammalian Cells",
            "type": "title"
        },
        {
            "text": "The ability of mT3 to secrete effectors demonstrates that the type 3 secretion apparatus is correctly assembled. However, unless the machine is correctly inserted into the membrane of mammalian cells, effectors will not be delivered (translocated) into the target cells. Thus, we next compared the ability of mT3 and Shigella to deliver proteins into host cells using the well-established TEM-1 (β-lactamase) reporter assay. In this assay, cells are preloaded with CCF4/AM, a fluorescence resonance energy transfer (FRET)-based dye that accumulates within their cytosol, such that they emit a green fluorescence. If and when an effector−β-lactamase (TEM-1) fusion protein is delivered via type 3 secretion into the cytosol of these cells, the CCF4/AM substrate is cleaved, disrupting FRET and resulting in cells that emit blue fluorescence. The ability of a strain to deliver proteins into target cells, i.e., translocation efficiency, is defined by the percentage of cells that fluoresce blue. We introduced a plasmid that conditionally expresses the Shigella effector OspB fused to TEM-1 (OspB–TEM-1) (Figure c) into Shigella, mT3, mT3_virB IPTG, and mT3_virF endo and observed that when the resulting strains are incubated with mammalian cells (HeLa), mT3_virF endo and wild-type Shigella translocate proteins into similar numbers of cells, 68 versus 75%, respectively (Figure d,e). Slightly lower levels of translocation (∼50%) are observed with mT3_virB IPTG (Figure d,e). In the absence of an activator protein, mT3 does not deliver OspB–TEM-1 into HeLa cells. Taken together, these data confirm that the mT3 functions as a protein delivery device to recognize and deliver type 3 effectors into mammalian cells.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "mT3 E. coli Can Deliver Effectors Directly into the Cytosol of Mammalian Cells",
            "type": "paragraph"
        },
        {
            "text": "Development of a Screening Platform To Identify Optimal Type 3 Secretion Sequence–Target Protein Combinations",
            "normalized_header": [
                "introduction"
            ],
            "section_header": "Development of a Screening Platform To Identify Optimal Type 3 Secretion Sequence–Target Protein Combinations",
            "type": "title"
        },
        {
            "text": "A critical step in generating a bacteria-based protein delivery strain for therapeutic purposes is to determine the optimal means to generate variants of target heterologous proteins that are recognized as secreted proteins. This is a challenging question in type 3 secretion, as little is currently known regarding what determines the relative levels of effectors that are delivered into cells, even in the context of an infection. All type 3 effectors are defined by an N-terminal secretion sequence (SS) present within their first ∼30 residues that is characterized as an intrinsically disordered structural motif rather than a defined amino acid sequence. In addition, many, but not all, effectors bind a chaperone, an interaction needed for delivery into host cells. Downstream from their N-terminal secretion sequences, these effectors contain a chaperone binding domain (CBD) within their first 50–100 amino acid residues. Limited studies in Yersinia and Salmonella suggest that fusion of the first 15–20 residues of an effector to a heterologous protein is sufficient to generate a secreted substrate, although these proteins are generally only poorly delivered into mammalian cells. More commonly, fusion of the first 50–100 residues of type 3 effectors has been demonstrated to generate variants of heterologous proteins that are transported into eukaryotic cells.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Development of a Screening Platform To Identify Optimal Type 3 Secretion Sequence–Target Protein Combinations",
            "type": "paragraph"
        },
        {
            "text": "To identify the regions of Shigella effectors that are sufficient to generate a secreted substrates when fused to heterologous proteins, we developed a secretion sequence screening platform. Shigella encode ∼30 effectors, about half of which require a chaperone for secretion. Nine of these effectors bind to a single chaperone, Spa15. The CBDs of these effectors reside within their first 50 residues, suggesting that fusion to these regions should be sufficient to define a protein as secreted substrate. For chaperone-independent effectors, there is little information available regarding what defines these proteins as secreted substrates other than their N-terminal secretion sequences. Chamekh and colleagues previously observed that the fusion of the first 30 residues of one of chaperone-independent Shigella effector was insufficient to target the secretion of a heterologous protein. On the basis of these data, we generated a collection of 14 plasmids, each of which carries the first 30 or 50 residues of a Shigella effector plus an upstream consensus Shine–Dalgarno sequence in a Gateway recombination-based entry plasmid. Nine of the secretion sequences tested were derived from chaperone-independent effectors, and two (OspC1 and OspC3), from Spa15-dependent effectors. Using this plasmid collection, along with a Gateway-compatible destination vector for the target protein, it is possible to rapidly generate and test the secretion of a variety of N-terminal effector–target fusion proteins (Supporting Information Figure S4a,b).",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Development of a Screening Platform To Identify Optimal Type 3 Secretion Sequence–Target Protein Combinations",
            "type": "paragraph"
        },
        {
            "text": "As proof of concept, we used the secretion sequence (SS) screening platform to identify sequences that promote the recognition of mammalian MyoD protein as a type 3 secreted substrate. MyoD is a master regulatory transcription factor that can induce skeletal muscle differentiation, even in nonmyogenic cell types. MyoD was chosen as the model protein for this analysis given that it is recognized as a type 3 secreted substrate by the T3SS when fused to the first 54 residues of one of its effectors. To rapidly generate secretion sequence–MyoD (SS-MyoD) fusion proteins, we developed a Gateway-recombination compatible MyoD destination vector (Supporting Information Figure S4b). The construct is designed such that a flexible glycine–serine linker is present between the SS and MyoD to minimize potential issues with steric hindrance (Figure a). Plasmids that conditionally express each of these SS–MyoD fusion proteins were introduced into mT3_virF endo, and secretion was assessed. Fusion of MyoD to 50 but not 30 residues of all effectors tested, both chaperone-dependent and-independent, resulted in fusion proteins recognized as secreted substrates by mT3 (Figure b,c). However, only a subset of the secreted variants was detected within extracts of mammalian cells exposed to the same bacterial strains (Figure d), suggesting that the different secretion sequences differ in their translocation efficiencies. While some correlation was observed between the levels of SS–MyoD secreted into the media and delivered into host cells, this was not always the case, suggesting that additional factors, e.g., protein stability, might play a role in regulating protein levels after delivery into host cells.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Development of a Screening Platform To Identify Optimal Type 3 Secretion Sequence–Target Protein Combinations",
            "type": "paragraph"
        },
        {
            "text": "Secretion sequence–MyoD fusion proteins are recognized as type 3 secreted substrates and directly delivered into mammalian cells. (a) Schematic of MyoD fused to a 30 or 50 amino acid secretion sequence and separated by a flexible glycine linker. (b) Secretion assay of the set of 30 amino acid secretion sequence fusion proteins to MyoD (SS–MyoD) in mT3_virF endo. Blots were probed with an anti-MyoD or anti-IpaD antibody. (c) Secretion assay of the library of 50 amino acid SS–MyoD fusion proteins in mT3_virF endo. Blots were probed with an anti-MyoD antibody. (d) Delivery of SS–MyoD into MEFs exposed to mT3_virF endo expressing each of the designated SS–MyoD proteins. After 1 h, MEF cell lysates were collected and probed with anti-MyoD and anti-actin antibodies. Actin serves as a loading control for cell lysate. S, supernatant; L, whole cell lysate. Supporting Information Figure S5 demonstrates that DH10β does not secrete these proteins in the absence of the Shigella type 3 secretion system operons.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Development of a Screening Platform To Identify Optimal Type 3 Secretion Sequence–Target Protein Combinations",
            "type": "paragraph"
        },
        {
            "text": "Prior studies conducted in the context of the Salmonella T3SS demonstrated that the type 3 secretion sequence that optimizes the recognition of one heterologous protein as a secreted substrate does not always result in the optimal secretion of other proteins. These observations, together with the results of our secretion and translocation (delivery) assays, suggest that the ideal secretion sequence for particular target proteins may need to be independently determined and verified. The recombination-based screening platform developed here should markedly facilitate such future studies.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Development of a Screening Platform To Identify Optimal Type 3 Secretion Sequence–Target Protein Combinations",
            "type": "paragraph"
        },
        {
            "text": "Type 3 Secretion Sequences Can Affect Heterologous Protein Activity by Altering Protein Stability or Localization",
            "normalized_header": [
                "introduction"
            ],
            "section_header": "Type 3 Secretion Sequences Can Affect Heterologous Protein Activity by Altering Protein Stability or Localization",
            "type": "title"
        },
        {
            "text": "In addition to containing secretion sequences, the N-terminal regions of some effectors encode localization as well as protein degradation domains, raising the possibility that fusion of these regions to heterologous proteins might perturb the function of those proteins. Of the 11 sequences included within our library, only the N-terminal 50 residues of one, OspF, is currently known to encode a functional domain. To investigate potential phenotypes conferred by fusion to specific individual secretion sequences, we compared the activity of the 11 SS–MyoD variants that are recognized as secreted substrates (Figure c) using myogenic differentiation assays. Given the observed differences in the levels of each delivered fusion protein into host cells via type 3 secretion, we compared the functional activity of each variant by assessing their ability to promote myogenic reprogramming and differentiation when directly expressed in 10T1/2 mouse embryo fibroblast cells. As shown in Figure a, we observed a large variation in myogenic activity. Fusion to some secretion sequences such as those from IpaH7.8 and OspG reproducibly exhibited myogenic activity equivalent to or greater than that of native MyoD, whereas others, including those from OspE, OspF, and VirA, ablated MyoD activity. Of note, for these experiments, we compared the activity of wild-type MyoD to SS–MyoD (S200A), a variant that carries a mutation known to increase MyoD stability and activity. The use of this variant may account for the increased myogenic potential observed with several of the modified fusion proteins.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Type 3 Secretion Sequences Can Affect Heterologous Protein Activity by Altering Protein Stability or Localization",
            "type": "paragraph"
        },
        {
            "text": "Fusion to type 3 secretion sequences (SS) can affect heterologous protein activity by altering protein stability or localization. MEFs were transfected with equal amounts of mammalian expression plasmids that express wild-type or the designated SS–MyoD proteins. Cells were fixed after 7 days and stained for myosin heavy and light chain expression. Myosin positive cells were enumerated. (a) Relative myogenic activity was determined by dividing the number of myosin positive cells produced by transfection with SS–MyoD by the average amount generated by wild-type MyoD, with wild type set to 100%. Data are expressed as the mean plus the standard error of the mean (SEM) from four independent transfections. (b) Localization of representative SS–MyoD derivatives. Cells were fixed and stained with anti-MyoD antibody 24 h post-transfection. Nuclei and actin were stained with DAPI and phalloidin, respectively. (c) Stability of SS–MyoD fusion proteins. Lysates from 10T1/2 cells transfected with wild-type or SS–MyoD fusion proteins were probed with anti-MyoD antibody 24 h after transfection. Actin was used as a loading control.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Type 3 Secretion Sequences Can Affect Heterologous Protein Activity by Altering Protein Stability or Localization",
            "type": "paragraph"
        },
        {
            "text": "We next investigated whether decreased activity of any of the fusion proteins was due to MyoD mislocalization and/or instability. With the exception of SS VirA-MyoD, all of the SS–MyoD variants exhibited a nuclear localization pattern similar to that of unmodified MyoD (representative images in Figure b and comprehensive images in Supporting Information Figure S6). To assess the relative stabilities of the MyoD fusion proteins, we compared the steady-state levels of wild-type and modified MyoD in 10T1/2 cell lysates 24 h post-transfection. We found a correlation between the steady-state level of a particular modified MyoD protein and its myogenic activity (Figure a,c). For example, fusion proteins with low myogenic activity, e.g., SS OspE –MyoD, exhibited low or undetectable steady-state expression levels, whereas fusion proteins with higher myogenic activity, e.g. SS IpaH7.8 –MyoD, exhibited higher steady-state levels. Thus, at least in these cases, we have identified reasons to explain the loss of mammalian protein activity due to fusion to a type 3 secretion sequence, demonstrating that protein stability and activity need to be investigated when selecting the ideal type 3 secretion sequence to fuse to a heterologous protein. The secretion sequence recombination-based screening platform developed here can be easily adapted for such investigations.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Type 3 Secretion Sequences Can Affect Heterologous Protein Activity by Altering Protein Stability or Localization",
            "type": "paragraph"
        },
        {
            "text": "Flexibility of Recognition of Heterologous Proteins as Type 3 Secreted Substrates",
            "normalized_header": [
                "introduction"
            ],
            "section_header": "Flexibility of Recognition of Heterologous Proteins as Type 3 Secreted Substrates",
            "type": "title"
        },
        {
            "text": "Limited data currently exist regarding the ability of type 3 protein delivery systems to recognize heterologous mammalian proteins as secreted substrates. Thus, we tested whether proteins other than MyoD are recognized as secreted substrates by mT3. Given the strength of the SS OspG sequence in promoting MyoD secretion and activity, we generated additional fusions to this sequence. Fusion of this sequence to each of four induced pluripotent stem (iPS) cell reprogramming factors, Oct4, Sox2, Klf4, and c-Myc, as well as two cardiac reprogramming factors (Mef2c and Tbx5) and a protein with potential use in gene therapy, a TALE (transcription activator-like effector) protein, resulted in fusion proteins that are recognized as secreted substrates by mT3_virF endo (Figure). These observations demonstrate the versatility of mT3 as a protein delivery system and suggest that it could be used for multiple therapeutic applications.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Flexibility of Recognition of Heterologous Proteins as Type 3 Secreted Substrates",
            "type": "paragraph"
        },
        {
            "text": "mT3_virF endo expresses and secretes a variety of target proteins modified by the Shigella OspG type 3 secretion sequence. Plasmids expressing FLAG-tagged versions of target proteins were introduced into mT3_virF endo cell lysate, and type 3 secreted proteins were probed with anti-FLAG antibodies. Included are iPS reprogramming factors, MyoD, two cardiac reprogramming factors, and a TALE–activator fusion protein. The blots shown are representative of at least three experimental repeats. S, supernatant; L, whole cell lysates.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "Flexibility of Recognition of Heterologous Proteins as Type 3 Secreted Substrates",
            "type": "paragraph"
        },
        {
            "text": "mT3 E. coli Invade but Do Not Replicate or Induce Cytotoxicity of Mammalian Target Cells",
            "normalized_header": [
                "introduction"
            ],
            "section_header": "mT3 E. coli Invade but Do Not Replicate or Induce Cytotoxicity of Mammalian Target Cells",
            "type": "title"
        },
        {
            "text": "Given our long-term interest in developing mT3 to deliver proteins of therapeutic value into mammalian cells, we characterized the behavior of human cells exposed to the reengineered bacteria. Wild-type Shigella is an intracellular pathogen that utilizes its T3SS and effectors to invade cells. Thus, we investigated whether mT3 strains invade nonphagocytic HeLa cells. As shown in Figure a,b, mT3_virF endo and mT3_virB IPTG but not mT3 can invade epithelial cells. This is not surprising given that the 31 kb region of the Shigella DNA present in mT3 contains three Shigella effectors (IpgB1, IpgD, and IpaA, Supporting Information Figure S2) reported to play a role in the invasion of Shigella into host cells. However, these strains replicate very poorly, if at all, within mammalian cells (Figure b). These results are consistent with early studies demonstrating that that carry a cosmid containing 45 kb of the Shigella virulence plasmid, which includes the 31 kb present in mT3, invade but do not replicate within HeLa cells. Notably, entry of these bacteria into the cytosol of mammalian cells causes minimal cytotoxicity, as monitored by the release of lactate dehydrogenase (LDH) (Figure c).",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "mT3 E. coli Invade but Do Not Replicate or Induce Cytotoxicity of Mammalian Target Cells",
            "type": "paragraph"
        },
        {
            "text": "Type 3 secretion genes in mT3 induce invasion but not replication or cytotoxicity in HeLa cells. (a) HeLa cells were differentially stained following a 1 h exposure to bacteria. To distinguish internal vs external bacteria (Methods), prior to permeabilization, HeLa cells were fixed and stained with anti-antibodies followed by Alexa-Fluor 568 (red) conjugated secondary antibodies. After this initial staining, HeLa cells were permeabilized, followed by another round of staining with primary anti-antibodies and Alexa-Fluor 488 (green) conjugated secondary antibodies. This procedure results in internalized bacteria staining green, whereas external bacteria stain both red and green, appearing yellow. Nuclei were stained with DAPI (blue). (b) mT3_virB IPTG and mT3_virF endo are able to invade, but they grow very poorly in HeLa cells compared to that of wild-type Shigella. HeLa cells were infected at an MOI of 100:1, and intracellular bacteria were enumerated for 6 h postinfection in a gentamicin protection assay. Values represent the means of measurements for triplicate samples from a representative experiment. Error bars represent the SEM. (c) HeLa cells were exposed to bacteria for 4 h, and supernatants were analyzed for cytotoxicity by lactate dehydrogenase (LDH) release assay. Data are expressed as the mean + standard error of the mean (SEM) from four independent experiments.",
            "normalized_section_header": [
                "introduction"
            ],
            "section_header": "mT3 E. coli Invade but Do Not Replicate or Induce Cytotoxicity of Mammalian Target Cells",
            "type": "paragraph"
        },
        {
            "text": "Summary",
            "normalized_header": [
                "summary"
            ],
            "section_header": "Summary",
            "type": "title"
        },
        {
            "text": "Herein, we describe the development of mT3_virB IPTG and mT3_virF endo, nonpathogenic tunable bacterial protein delivery strains capable of injecting functional proteins directly into the cytoplasm of mammalian cells. The modular nature of these strains provides not only flexibility in substrate selection but also the ability to control the activity of the protein delivery system as well as expression of its substrates. In these studies, we used an IPTG-inducible lac promoter to drive expression of VirB, which successfully led to secretion and delivery of target proteins. However, this promoter could easily be exchanged for a synthetic promoter that responds to an exogenously added small molecule or for an endogenous bacterial promoter that is induced under conditions present within certain diseased tissues and/or organs, i.e., the microaerophilic environment within solid tumors or the inflammatory milieu of the intestines of patients with inflammatory bowel disease. Similarly, the pmT3SS plasmid contains the features needed to change host strains quickly via conjugation if, for example, the target protein is not expressed well or is unstable in DH10β or if a commensal or flagellated bacterial host strain is desired. Thus far, the pmT3SS plasmid has been successfully transferred via conjugation into a variety of genetic backgrounds including DH5α, BL-21, and HB101 (data not shown). In addition, we have developed and validated a screening platform that can rapidly identify those secretion sequences that not only promote the delivery of heterologous proteins but also maintain their activity when delivered into host cells. On the basis of our ability to generate variants of several mammalian proteins that are recognized as secreted substrates, we anticipate that a wide variety of proteins can be modified by a type 3 secretion sequence and delivered into mammalian cells by these bacterial strains.",
            "normalized_section_header": [
                "summary"
            ],
            "section_header": "Summary",
            "type": "paragraph"
        },
        {
            "text": "The genetic tractability of the mT3 strains also should allow for additional future modifications that would enable these strains to be used as biologics for a variety of therapeutic applications. Particular cell types, such as the intestinal epithelia or tumor cells, could be targeted for protein delivery by the addition of ligands or adhesion proteins that promote binding to these cell types. Similarly, the residual invasive activity of mT3 could be a useful mechanism for expressing and delivering foreign antigens into the cytoplasm of antigen-presenting cells, thereby facilitating its development as a potential vaccine vector to protect against various infectious diseases or cancers. Conversely, for applications such as cellular reprogramming, in which invasion of mammalian cells may not be desirable, mT3 invasion can likely be reduced or eliminated by removing the few remaining effectors present in the 31 kb region of the Shigella virulence plasmid present. Alternatively, the addition of a lysis device that ruptures any bacteria that do manage to invade a mammalian cell could easily be incorporated. Lastly, prior to introduction into patients, these bacterial strains will need to be engineered to encode “kill switches” or modifications that prevent the propagation or release of protein delivery strains in the environment. Although, notably, it has been previously demonstrated that K12 strains that carry the entire 220 kb Shigella virulence plasmid are completely avirulent in animal models of disease, likely due to the absence of multiple chromosomally encoded Shigella virulence determinants. Thus, in conclusion, we believe this system will serve as a convenient platform for the delivery of a number of different types of proteins for various diagnostic and therapeutic applications.",
            "normalized_section_header": [
                "summary"
            ],
            "section_header": "Summary",
            "type": "paragraph"
        },
        {
            "text": "Methods",
            "normalized_header": [
                "method"
            ],
            "section_header": "Methods",
            "type": "title"
        },
        {
            "text": "Construction of the T3SS Capture Vector",
            "normalized_header": [
                "method"
            ],
            "section_header": "Construction of the T3SS Capture Vector",
            "type": "title"
        },
        {
            "text": "To generate the T3SS capture vector, we assembled four DNA sequences via homologous recombination in using a protocol modified from Wolfgang et al. The DNA sequences include the following: (1) pLLX13 vector backbone, linearized with Nhe I. pLLX13 is a yeast/shuttle vector that carries a yeast selectable Ura3 marker and a tetracycline-resistance marker for bacteria. (2) A PCR-amplified product with homology to the 1000 bp of sequence upstream of the ipaJ open reading frame (ORF) amplified from purified Shigella virulence plasmid DNA, (3) a PCR product with homology to the spa40 ORF, and (4) a PCR fragment amplified from the vector pLLX8, which encodes the ampicillin-resistance gene cassette, bla. The ipaJ upstream region and spa40 ORF were amplified by PCR with primers that add homology to both the pLLX8-derived bla PCR fragment and the vector backbone pLLX13. The bla carrying fragment from pLLX8 was amplified with primers that provide homology to the IpaJ upstream region and spa40 ORF. The flanking homology on these DNA sequences enables their assembly by homologous recombination when cotransformed into competent. The following amounts of transformed DNA yielded successful recombination: 200 ng each of the Shigella specific PCR products (ipaJ and spa40), 600 ng of the pLLX8-derived bla PCR product, and 100 ng of linearized pLLX13. Recombined plasmids were harvested from yeast by pooling all transformant colonies using a Qiagen miniprep kit modified by including a lysis step in which the harvested yeast were vortexed for 5 min the presence of glass beads. Pooled minipreps were then electroporated into DH10β MAX Efficiency cells (Life Technologies) and plated onto LB media containing tetracycline and ampicillin to allow recovery of recombined plasmids containing all four pieces of DNA. The assembled capture vector, pLLX13-ipaJ-bla-spa40, was confirmed by PCR and sequence analysis. Additionally, two Sce I sites on the pLLX13 vector backbone that flank the ipaJ-bla-spa40 insertion can be used to confirm the proper recombined insert size (∼5 kb).",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Construction of the T3SS Capture Vector",
            "type": "paragraph"
        },
        {
            "text": "As a strategy for integrating the T3SS into the chromosome, the pLLX13-ipaJ-bla-spa40 T3SS capture vector was designed to include landing pad recombination sites adjacent to the ipaJ and spa40 homologous sequences. The ipaJ upstream region and spa40 ORF were amplified by PCR with primers that add homology to both the pLLX8-derived bla PCR fragment and a landing pad integration site (described below). Then, a nested PCR was performed with the ipaJ upstream region–landing pad and spa40 ORF–landing pad PCRs to add homology to the pLLX13 vector backbone. These two pieces along with the bla fragment carrying ipaJ and spa40 homology and linearized pLLX13 vector backbone (described above) were recombined in yeast as described above and confirmed by sequencing, PCR, and restriction digest.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Construction of the T3SS Capture Vector",
            "type": "paragraph"
        },
        {
            "text": "Generation of the pmT3SS Plasmid",
            "normalized_header": [
                "method"
            ],
            "section_header": "Generation of the pmT3SS Plasmid",
            "type": "title"
        },
        {
            "text": "To generate a strain of that contains the entire Shigella virulence plasmid, genomic DNA from Shigella ΔipaJ::Kan was harvested using a DNeasy kit (Qiagen), transformed into DH10β MAX Efficiency cells (Life Technologies), and plated on LB media containing KAN. A Shigella ΔipaJ::Kan virulence plasmid was used because IpaJ is located directly upstream of the T3SS operons so that when recombination occurs between the virulence plasmid and the pLLX13-ipaJ-bla-spa40 T3SS capture vector the kanamycin-resistance gene is included in the captured region, providing a means of selection for the recombined region. To allow for the induction of homologous recombination in harboring the Shigella ΔipaJ::KAN virulence plasmid, pKD46 was introduced into the strain. pKD46 is a temperature-sensitive, ampicillin-resistant plasmid that encodes an arabinose-inducible version of λ-Red recombinase. Strains containing λ-Red and ΔipaJ::KAN virulence plasmid were grown in LB broth containing KAN, AMP, and 0.2% arabinose until they reached an OD 600 of 0.6, and then they were made electrocompetent by washing four times in ice-cold 10% glycerol. Prior to transformation, the capture vector (pLLX13-ipaJ-bla-spa40) was digested with Mlu I and Pme I to remove the ampicillin-resistance cassette. The resulting ∼10 kb linearized vector was gel-purified, and 100 ng of DNA was transformed into the recombination-induced. Transformants were selected on LB plates containing TET (to select for the capture vector backbone) and KAN (to select for the Shigella virulence plasmid). The resulting Tet/Kan-resistant colonies were pooled, and DNA was collected on a miniprep column (Qiagen) to perform size exclusion of the recombined “captured” T3SS plasmids (44 kb) away from the virulence plasmid DNA (220 kb) and genomic DNA. Harvested pmT3SS plasmids were then introduced into DH10β MAX Efficiency cells (New England Biolabs) and selected for a second time on LB plates containing TET and KAN. Single colonies were examined for plasmids that contained the correct recombination event, and the presence of T3SS genes was confirmed by PCR and sequencing.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Generation of the pmT3SS Plasmid",
            "type": "paragraph"
        },
        {
            "text": "Integration of the Shigella T3SS into the E. coli Chromosome",
            "normalized_header": [
                "method"
            ],
            "section_header": "Integration of the Shigella T3SS into the E. coli Chromosome",
            "type": "title"
        },
        {
            "text": "To integrate the 31 kb region containing the genes needed for type 3 secretion into the chromosome, we used the landing pad recombination system described in detail in Kuhlman and Cox. Initially, DH10β was transformed with helper plasmid pTKRED, which harbors genes encoding the λ-Red enzymes and I-SceI endonuclease. Then, the DH10β genome was modified at the atp1/gidB locus with the insertion of a 1.3 kb landing pad integration site: a tetracycline-resistance gene (tetA) flanked by I-SceI recognition sites and 25 bp landing pad regions. Successful landing pad integrants were screened for tetracycline resistance, and integration into the proper location was confirmed by PCR. This strain was then transformed with pmT3SS. The T3SS genes and landing pad regions were excised from the plasmid by I-SceI digestion and incorporated into the genome via recombination at the landing pad regions at the atp1/gidB locus. KAN-resistant/TET-susceptible transformants were screened for proper integration of the 31 kb T3SS DNA and sequenced.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Integration of the Shigella T3SS into the E. coli Chromosome",
            "type": "paragraph"
        },
        {
            "text": "Expression Plasmids",
            "normalized_header": [
                "method"
            ],
            "section_header": "Expression Plasmids",
            "type": "title"
        },
        {
            "text": "All bacterial and mammalian expression plasmids were created via Gateway site-specific recombination (Life Technologies). Gateway reactions were used to generate the TEM-1 β-lactamase and MyoD fusion proteins flanked by attB sites. To generate the secretion signal library, PCRs were performed that amplified the first 150 bp (50 amino acids) of a Shigella effector and added a 5′ Shine–Dalgarno sequence (AGGAGG) and 3′ sequence homologous to a flexible poly glycine linker. Each insert was sequence-verified and subsequently transferred into Gateway destination vectors pDSW206 (bacterial expression vector, ColE1 ori, ampicillin resistant), containing the MyoD open reading frame, or into the low-copy gateway destination vector, pNG162-ccdB-TEM-1 (spectinomycin resistant). Sewing PCRs were used to generate the mammalian expression constructs and fusion proteins with iPS and cardiac reprogramming factors. The first PCR amplified the secretion signal as described above. The second PCR product amplified the mammalian protein open reading frame and 5′ homology to the polyglycine linker and 3′ attB site. The two PCRs were there sewn together in another round of PCR. The amplified genes were then introduced into pDNR221 via BP reactions (Invitrogen). Each insert was sequence-verified and subsequently transferred into Gateway destination vector pDEST47 (mammalian expression vector, pCMV promoter, ampicillin resistant) (Addgene) or bacterial expression vector pDSW206-ccdB-FLAG. The pDSW206-OspB-TEM (β-lactamase) fusion protein plasmid was used as previously described. The TAL expression plasmid was generated by cloning the open reading frame from pEF1-VP64-TALE into Sac I/Hin dIII-digested pDSW206-FLAG. Secretion sequences were amplified by PCR and ligated into the SacI site of pDSW206-TALE using Gibson assembly master mix (New England Biolabs). To generate the IPTG-inducible virB plasmid, pNG162-virB, the virB open reading frame was amplified using oligos that added a 5′ Shine–Dalgarno sequence and flanking attB sites for Gateway site-specific recombination cloning. The PCR was introduced into pDNR221 by BP reaction and subsequently transferred into the low-copy gateway destination vector, pNG162-ccdB. All oligonucleotide primers used in these constructs are listed in Supporting Information Table S1.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Expression Plasmids",
            "type": "paragraph"
        },
        {
            "text": "Secretion Assay",
            "normalized_header": [
                "method"
            ],
            "section_header": "Secretion Assay",
            "type": "title"
        },
        {
            "text": "Congo Red secretion assays were performed as previously described. Briefly, the total cell and supernatant fractions were separated by two centrifugations at 20 000g for 2 min. The cell pellet of the initial centrifugation was taken as the total cell fraction. The pellet was resuspended in 200 μL of protein loading dye (40% glycerol, 240 mM Tris/HCl pH 6.8, 8% SDS, 0.04% bromophenol blue, 5% beta-mercaptoethanol), and 5 μL was loaded onto a 10% SDS-PAGE gel for analysis. Proteins in the supernatant were precipitated with trichloroacetic acid (TCA) (10% v/v) and resuspended in 50 μL of protein loading dye. Ten microliters of supernatant sample was loaded onto a 10% SDS-PAGE gel for analysis. Protein content of the pellet and supernatant fraction were assessed by western blotting with anti-FLAG (Sigma), anti-β-lactamase (sc-66062, Santa Cruz), or anti-MyoD (C-20, Santa-Cruz) antibodies. For type 3 secretion expression analysis, membranes were probed with anti-IpaB and anti-IpaD antibodies, proteins in the type 3 secretion needle apparatus. Controls for cell lysis were conducted using anti-DnaK (a cytoplasmic protein found in Shigella and) (Abcam ab69617).",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Secretion Assay",
            "type": "paragraph"
        },
        {
            "text": "Translocation Assay/CCF4 Assay",
            "normalized_header": [
                "method"
            ],
            "section_header": "Translocation Assay/CCF4 Assay",
            "type": "title"
        },
        {
            "text": "Translocation of TEM-1 fusion proteins into mammalian cells was preformed as previously described with some modifications. Strains were grown overnight in either LB broth () or TCS (Shigella). The next morning, strains were back-diluted (1:50), and after 90 min, 1 mM IPTG was added to induce expression of OspB–TEM-1 fusion proteins. After 30 min of induction, bacteria were centrifuged and washed twice in DMEM (Invitrogen). Induced, washed bacteria were added to the HeLa cells (1 × 10 4 cells/well in a 96-well flat, clear bottom plate (Costar)) at an MOI (bacteria per cell) of 100:1 in triplicate wells. The plates were centrifuged for 10 min at 2000 rpm to promote bacterial contact with HeLa cells. One millimolar IPTG was added to the medium to maintain constant induction of the TEM fusion proteins. After 45 min, the HeLa cells were loaded with CCF4/AM according to the manufacturer’s instructions (Life Technologies). After an additional 20 min, cells were imaged with a 40× objective on a Nikon TE2000 microscope with Chroma Technology filters. The percentage of blue cells was determined by manual counting of at least six fields or 600 cells.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Translocation Assay/CCF4 Assay",
            "type": "paragraph"
        },
        {
            "text": "Cytotoxicity Assays",
            "normalized_header": [
                "method"
            ],
            "section_header": "Cytotoxicity Assays",
            "type": "title"
        },
        {
            "text": "Lactate dehydrogenase release assays were performed using a lactic dehydrogenase based in vitro toxicology assay kit (Sigma) according to the manufacturer’s instructions using 10 000 HeLa cells infected at an MOI of 100 4 h postinfection. Experimental replicates were performed in triplicate in each of four independent experiments.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Cytotoxicity Assays",
            "type": "paragraph"
        },
        {
            "text": "Immunofluorescence",
            "normalized_header": [
                "method"
            ],
            "section_header": "Immunofluorescence",
            "type": "title"
        },
        {
            "text": "10T1/2 cells were fixed with 3.7% paraformaldehyde, permeabilized with 0.2% Triton X-100 in PBS, and blocked using mouse-on-mouse (MOM) blocking reagents (BMK-2202, Vector Laboratories). Staining was carried out using a combination of mouse anti-myosin fast (My-32, Sigma M4276, 1:100), anti-myosin slow (NOQ7.5.4.D, Sigma M8421, 1:200), and rabbit anti-MyoD (C-20, Santa Cruz). HeLa cells infected with or Shigella were stained with polyclonal rabbit anti-(Abcam ab137967) or anti-Shigella (Abcam ab65282) antibodies at 1:200. Alexa-Fluor 488 goat-anti-mouse and Alexa-Fluor 568 goat-anti-rabbit secondary antibodies were used at 1:200 (Life Technologies) as appropriate. To determine internal vs external bacteria, HeLa cells that had been exposed to bacteria were fixed and immediately stained with primary antibodies, followed by Alexa-Fluor 568 goat-anti-rabbit secondary antibodies, prior to permeabilization. After this initial staining, HeLa cells were permeabilized with 0.2% Triton X-100, and another round of staining with primary antibodies was followed by Alexa-Fluor 488 goat-anti-rabbit secondary antibodies. Nuclei were stained with DAPI, and actin was stained with Alexa-Fluor 488 phalloidin (Life Technologies).",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Immunofluorescence",
            "type": "paragraph"
        },
        {
            "text": "Cell Culture Conditions",
            "normalized_header": [
                "method"
            ],
            "section_header": "Cell Culture Conditions",
            "type": "title"
        },
        {
            "text": "HeLa and 10T1/2 cells were maintained in high-glucose DMEM (Life Technologies) supplemented with 10% FBS (Atlanta Biologics). For muscle differentiation, 2% horse serum (Life Technologies) was used instead of FBS. All media was supplemented with penicillin and streptomycin (Life Technologies) except when noted otherwise. All cells were grown at 37 °C in a 5% CO 2 incubator.",
            "normalized_section_header": [
                "method"
            ],
            "section_header": "Cell Culture Conditions",
            "type": "paragraph"
        }
    ],
    "issue_pub_date": null,
    "electron_pub_date": "05/15/2015",
    "article_id": "10.1021/acssynbio.5b00002",
    "internal_id": "c279962362",
    "history": [
        {
            "event": "received",
            "time": "01/03/2015"
        },
        {
            "event": "asap",
            "time": "04/24/2015"
        },
        {
            "event": "issue-pub",
            "time": "05/15/2015"
        },
        {
            "event": "just-accepted",
            "time": "04/08/2015"
        }
    ],
    "type": "Research Article",
    "article_title": "Engineering Escherichia coli into a Protein Delivery System for Mammalian Cells",
    "suppl_files": [
        {
            "suppl_filename": "info.xml",
            "rpath": "sb5b00002/suppl/info.xml",
            "sequences": null
        },
        {
            "suppl_filename": "sb5b00002.pdf",
            "rpath": "sb5b00002/suppl/sb5b00002.pdf",
            "sequences": null
        },
        {
            "suppl_filename": "sb-2015-00002h_si_liveslides.zip",
            "rpath": "sb5b00002/suppl/sb-2015-00002h_si_liveslides.zip",
            "sequences": null
        },
        {
            "suppl_filename": "sb5b00002.pptx",
            "rpath": "sb5b00002/suppl/sb5b00002.pptx",
            "sequences": null
        },
        {
            "suppl_filename": "sb5b00002.xml",
            "rpath": "sb5b00002/suppl/sb5b00002.xml",
            "sequences": null
        },
        {
            "suppl_filename": "sb5b00002_high_quality.mp4",
            "rpath": "sb5b00002/suppl/sb5b00002_high_quality.mp4",
            "sequences": null
        },
        {
            "suppl_filename": "sb-2015-00002h_si_001.pdf",
            "rpath": "sb5b00002/suppl/sb-2015-00002h_si_001.pdf",
            "sequences": ">c279962362_sb-2015-00002h_si_001.pdf_0\nCGAAGGAGATAGAACCATGCATAATGTAAATAATACTCAAGCG\n>c279962362_sb-2015-00002h_si_001.pdf_1\nCGAAGGAGATAGAACCATGAAACCGATCAACAATCATTCT\n>c279962362_sb-2015-00002h_si_001.pdf_2\nCGAAGGAGATAGAACCATGTTCTCTGTAAATAATACACACTC\n>c279962362_sb-2015-00002h_si_001.pdf_3\nCGAAGGAGATAGAACCATGTTACCGATAAATAATAACTTTTCATTG\n>c279962362_sb-2015-00002h_si_001.pdf_4\nCGAAGGAGATAGAACCATGAATATATCAGAAACACTGAACTC\n>c279962362_sb-2015-00002h_si_001.pdf_5\nCGAAGGAGATAGAACCATGAAAATACCTGAAGCAGTAAATC\n>c279962362_sb-2015-00002h_si_001.pdf_6\nCGAAGGAGATAGAACCATGCCATCAGTAAATTTAATCCCATC\n>c279962362_sb-2015-00002h_si_001.pdf_7\nCGAAGGAGATAGAACCATGCTTACACAAACTATATTCCCT\n>c279962362_sb-2015-00002h_si_001.pdf_8\nCGAAGGAGATAGAACCATGCCCATAAAAAAGCCCTGTCTAA\n>c279962362_sb-2015-00002h_si_001.pdf_9\nCGAAGGAGATAGAACCATGAAAATAACATCTACCATTATTCAAACAC\n>c279962362_sb-2015-00002h_si_001.pdf_10\nCGAAGGAGATAGAACCATGCAGACATCAAACATAACTAAC\n>c279962362_sb-2015-00002h_si_001.pdf_11\nGGGGACAACTTTGTACAAAAAAGTTGGCGAAGGAGATAGAACCATG\n>c279962362_sb-2015-00002h_si_001.pdf_12\nCGAAGGAGATAGAACCATGGTGGATTTGTGCAACGACTTGT\n>c279962362_sb-2015-00002h_si_001.pdf_13\nGGGGACAACTTTGTACAAGAAAGTTGGTTTTTCAGACACTGATGCTGG\n>c279962362_sb-2015-00002h_si_001.pdf_14\nGGGGACAACTTTGTACAAGAAAGTTGG\n>c279962362_sb-2015-00002h_si_001.pdf_15\nGATGCGATTTTCTGTTGTTC\n>c279962362_sb-2015-00002h_si_001.pdf_16\nGGGGACAACTTTGTACAAGAAAGTTGG\n>c279962362_sb-2015-00002h_si_001.pdf_17\nTCTGTTAAAAGCAATGCCTCG\n>c279962362_sb-2015-00002h_si_001.pdf_18\nGGGGACAACTTTGTACAAGAAAGTTGG\n>c279962362_sb-2015-00002h_si_001.pdf_19\nAAGTCGGGAGACAGCCTCATC\n>c279962362_sb-2015-00002h_si_001.pdf_20\nGGGGACAACTTTGTACAAGAAAGTTGG\n>c279962362_sb-2015-00002h_si_001.pdf_21\nACTATCTTTTAAATTTTTTTCATCTGG\n>c279962362_sb-2015-00002h_si_001.pdf_22\nGGGGACAACTTTGTACAAGAAAGTTGG\n>c279962362_sb-2015-00002h_si_001.pdf_23\nTTTTTCACTTATGCCAGAAGAGG\n>c279962362_sb-2015-00002h_si_001.pdf_24\nGGGGACAACTTTGTACAAGAAAGTTGG\n>c279962362_sb-2015-00002h_si_001.pdf_25\nTAGATTTAATAAAAAACTCC\n>c279962362_sb-2015-00002h_si_001.pdf_26\nGGGGACAACTTTGTACAAGAAAGTTGG\n>c279962362_sb-2015-00002h_si_001.pdf_27\nTATTTGTAATTCGTATATAGC\n>c279962362_sb-2015-00002h_si_001.pdf_28\nGGGGACAACTTTGTACAAGAAAGTTGG\n>c279962362_sb-2015-00002h_si_001.pdf_29\nATAGTACGCTGGGTATTGCCG\n>c279962362_sb-2015-00002h_si_001.pdf_30\nGGGGACAACTTTGTACAAGAAAGTTGG\n>c279962362_sb-2015-00002h_si_001.pdf_31\nAGCAGATGAATCATTCACATC\n>c279962362_sb-2015-00002h_si_001.pdf_32\nGGGGACAACTTTGTACAAGAAAGTTGG\n>c279962362_sb-2015-00002h_si_001.pdf_33\nTTCGTGTGGAGAATATATGCCG\n>c279962362_sb-2015-00002h_si_001.pdf_34\nGGGGACAACTTTGTACAAGAAAGTTGGTCTGGTACACTGTTCTTCTACCGAT\n>c279962362_sb-2015-00002h_si_001.pdf_35\nGGGGACAACTTTGTACAAGAAAGTTGGAGACTGGATTGTCTCAACAGAGACG\n>c279962362_sb-2015-00002h_si_001.pdf_36\nGGGGACAACTTTGTACAAGAAAGTTGGTTCATTCGCAGAAAGCATCTGCGGT\n>c279962362_sb-2015-00002h_si_001.pdf_37\nGGGGACAACTTTGTACAAGAAAGTTGGTTTATTCCAACTTACTTCTGTAGTT\n>c279962362_sb-2015-00002h_si_001.pdf_38\nGGGGACAACTTTGTACAAGAAAGTTGGTTATGAAGACGATAGATGGCGAGAA\n>c279962362_sb-2015-00002h_si_001.pdf_39\nCGAAGGAGATAGAACCATGGAGCTTCTATCGCCGCCACTCCGGG\n>c279962362_sb-2015-00002h_si_001.pdf_40\nGGGGACAACTTTGTACAAGAAAGTTGGAAGCACCTGATAAATGGGG\n>c279962362_sb-2015-00002h_si_001.pdf_41\nGCGACTCAGATGCATCCGCACCGCGCTCCAACTGCTCTGA\n>c279962362_sb-2015-00002h_si_001.pdf_42\nTCAGAGCAGTTGGAGCGCGGTGCGGATGCATCTGAGTCGC\n>c279962362_sb-2015-00002h_si_001.pdf_43\nGGTGGAGGTGGATCAGGAGGAGGTGGATCAATGGAGCTTCTATCGCCGCC\n>c279962362_sb-2015-00002h_si_001.pdf_44\nGCAGGATCCGGTGGAGGTGGATCAG\n>c279962362_sb-2015-00002h_si_001.pdf_45\nAGCTCTAGAAAGCACCTGATAAATCGC\n>c279962362_sb-2015-00002h_si_001.pdf_46\nATATTACCCTGTTATCCCTAGCGTAACTATCGATCTCGAGATGCAGAAGGTGTAGAGTCTCGC\n>c279962362_sb-2015-00002h_si_001.pdf_47\nCATATATACTTTAGATTTTAATTAAACGCGTTCTAGAAAATCCGTCGTCATCACGTCCGTCAC\n>c279962362_sb-2015-00002h_si_001.pdf_48\nCATTTTCACCGTTTTTTGTTTAAACGTTAACTCTAGAGGG\n>c279962362_sb-2015-00002h_si_001.pdf_49\nATGGCAAATAAAACAGAAAAGCCG\n>c279962362_sb-2015-00002h_si_001.pdf_50\nTAACAGGGTAATATAGAGATCTGGTACCCTGCAGGAGCTC\n>c279962362_sb-2015-00002h_si_001.pdf_51\nTTAACTCCCATATAACACATCTCC\n>c279962362_sb-2015-00002h_si_001.pdf_52\nTTTTCTAGAACGCGTTTAATTAAAATCTAAAGTATATATGAGTAAAC\n>c279962362_sb-2015-00002h_si_001.pdf_53\nCCCTCTAGAGTTAACGTTTAAACAAAAAACGGTGAAAATGGGTGATAG\n>c279962362_sb-2015-00002h_si_001.pdf_54\nAGAGCGTCGCTGACAGCCATAAGTCGGGAGACAGCCTCAT\n>c279962362_sb-2015-00002h_si_001.pdf_55\nATGAGGCTGTCTCCCGACTTATGGCTGTCAGCGACGCTCT\n>c279962362_sb-2015-00002h_si_001.pdf_56\nGGGGACAACTTTGTACAAGAAAGTTGGAAAGTGCCTCTTCATGTGTAAGGCA\n>c279962362_sb-2015-00002h_si_001.pdf_57\nGTCTCCATCATGTTATACATAAGTCGGGAGACAGCCTCAT\n>c279962362_sb-2015-00002h_si_001.pdf_58\nATGAGGCTGTCTCCCGACTTATGTATAACATGATGGAGAC\n>c279962362_sb-2015-00002h_si_001.pdf_59\nGGGGACAACTTTGTACAAGAAAGTTGGCATGTGCGACAGGGGCAGTGTGCCG\n>c279962362_sb-2015-00002h_si_001.pdf_60\nAAGTTCACGTTGAGGGGCATAAGTCGGGAGACAGCCTCAT\n>c279962362_sb-2015-00002h_si_001.pdf_61\nATGAGGCTGTCTCCCGACTTATGCCCCTCAACGTGAACTT\n>c279962362_sb-2015-00002h_si_001.pdf_62\nGGGGACAACTTTGTACAAGAAAGTTGGTGCACCAGAGTTTCGAAGCTGTTCG\n>c279962362_sb-2015-00002h_si_001.pdf_63\nGGGACAACTTTGTACAAGAAAGTTGGGTTTGAATGCATGGGAGAGCCCAGA\n>c279962362_sb-2015-00002h_si_001.pdf_64\nGCAGAGCGTCGCTGACAGCCATTTTATTCTTAAACTGAATTAGTTC\n>c279962362_sb-2015-00002h_si_001.pdf_65\nGAACTAATTCAGTTTAAGAATAAA\n>c279962362_sb-2015-00002h_si_001.pdf_66\nATGGCTGTCAGCGACGCTCTGC\n>c279962362_sb-2015-00002h_si_001.pdf_67\nTGAATCTTTTTTCTCCCCATTGATCCACCTCCTCCTGATC\n>c279962362_sb-2015-00002h_si_001.pdf_68\nGATCAGGAGGAGGTGGATCAATGGGGAGAAAAAAGATTCA\n>c279962362_sb-2015-00002h_si_001.pdf_69\nGGGGACAACTTTGTACAAGAAAGTTGGTGTTGCCCATCCTTCAGAGAGTCGC\n>c279962362_sb-2015-00002h_si_001.pdf_70\nCCCTCGTCTGCGTCGGCCATTGATCCACCTCCTCCTGATC\n>c279962362_sb-2015-00002h_si_001.pdf_71\nGATCAGGAGGAGGTGGATCAATGGCCGACGCAGACGAGGG\n>c279962362_sb-2015-00002h_si_001.pdf_72\nGGGGACAACTTTGTACAAGAAAGTTGGGCTATTGTCGCTCCACTCTGGCACC\n"
        },
        {
            "suppl_filename": "sb-2015-00002h_si_003.zip",
            "rpath": "sb5b00002/suppl/sb-2015-00002h_si_003.zip",
            "sequences": null
        },
        {
            "suppl_filename": "sb5b00002.mp3",
            "rpath": "sb5b00002/suppl/sb5b00002.mp3",
            "sequences": null
        }
    ]
}